<!DOCTYPE html>












  


<html class="theme-next mist use-motion" lang="zh-CN">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=2"/>
<meta name="theme-color" content="#222">






  
  
    
    
  <script src="/lib/pace/pace.min.js?v=1.0.2"></script>
  <link href="/lib/pace/pace-theme-minimal.min.css?v=1.0.2" rel="stylesheet">




  
  
  <link rel="stylesheet" media="all" href="/lib/Han/dist/han.min.css?v=3.3">




<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />






















<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=6.4.2" rel="stylesheet" type="text/css" />


  <link rel="apple-touch-icon" sizes="180x180" href="/images/favicon.png?v=6.4.2">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon.png?v=6.4.2">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon.png?v=6.4.2">


  <link rel="mask-icon" href="/images/logo.svg?v=6.4.2" color="#222">









<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    version: '6.4.2',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":false,"onmobile":false},
    fancybox: false,
    fastclick: false,
    lazyload: false,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>


  




  <meta name="description" content="&amp;#x4ECA;&amp;#x5929;&amp;#x662F;&amp;#x7237;&amp;#x7237;&amp;#x751F;&amp;#x75C5;&amp;#x4F4F;&amp;#x9662;&amp;#x7684;&amp;#x7B2C;22&amp;#x5929;&amp;#x3002; &amp;#x65E9;&amp;#x4E0A;&amp;#x6211;&amp;#x4ECE;&amp;#x533B;&amp;#x9662;&amp;#x56DE;&amp;#x5BB6;&amp;#xFF0C;&amp;#x4F34;&amp;#x7740;&amp;#x53">
<meta name="keywords" content="日记,爷爷">
<meta property="og:type" content="article">
<meta property="og:title" content="diary-2017-12-06-WED">
<meta property="og:url" content="http://whiledoing.me/2017/12/07/diary/diary-2017-12-06-WED/index.html">
<meta property="og:site_name" content="whiledoing">
<meta property="og:description" content="&amp;#x4ECA;&amp;#x5929;&amp;#x662F;&amp;#x7237;&amp;#x7237;&amp;#x751F;&amp;#x75C5;&amp;#x4F4F;&amp;#x9662;&amp;#x7684;&amp;#x7B2C;22&amp;#x5929;&amp;#x3002; &amp;#x65E9;&amp;#x4E0A;&amp;#x6211;&amp;#x4ECE;&amp;#x533B;&amp;#x9662;&amp;#x56DE;&amp;#x5BB6;&amp;#xFF0C;&amp;#x4F34;&amp;#x7740;&amp;#x53">
<meta property="og:locale" content="zh-CN">
<meta property="og:image" content="http://static.zybuluo.com/whiledoing/yrpe3hdcg7gt9yeubuzxpl3a/image_1c10oep21uiv1cai1aksn01p149.png">
<meta property="og:updated_time" content="2018-04-17T13:29:52.969Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="diary-2017-12-06-WED">
<meta name="twitter:description" content="&amp;#x4ECA;&amp;#x5929;&amp;#x662F;&amp;#x7237;&amp;#x7237;&amp;#x751F;&amp;#x75C5;&amp;#x4F4F;&amp;#x9662;&amp;#x7684;&amp;#x7B2C;22&amp;#x5929;&amp;#x3002; &amp;#x65E9;&amp;#x4E0A;&amp;#x6211;&amp;#x4ECE;&amp;#x533B;&amp;#x9662;&amp;#x56DE;&amp;#x5BB6;&amp;#xFF0C;&amp;#x4F34;&amp;#x7740;&amp;#x53">
<meta name="twitter:image" content="http://static.zybuluo.com/whiledoing/yrpe3hdcg7gt9yeubuzxpl3a/image_1c10oep21uiv1cai1aksn01p149.png">






  <link rel="canonical" href="http://whiledoing.me/2017/12/07/diary/diary-2017-12-06-WED/"/>



<script type="text/javascript" id="page.configurations">
  CONFIG.page = {
    sidebar: "",
  };
</script>

  <title>diary-2017-12-06-WED | whiledoing</title>
  




<script async src="https://www.googletagmanager.com/gtag/js?id=UA-117714040-1"></script>
<script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'UA-117714040-1');
</script>



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "https://hm.baidu.com/hm.js?6de2920425778ca5a4ee717be5055e96";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>




  <noscript>
  <style type="text/css">
    .use-motion .motion-element,
    .use-motion .brand,
    .use-motion .menu-item,
    .sidebar-inner,
    .use-motion .post-block,
    .use-motion .pagination,
    .use-motion .comments,
    .use-motion .post-header,
    .use-motion .post-body,
    .use-motion .collection-title { opacity: initial; }

    .use-motion .logo,
    .use-motion .site-title,
    .use-motion .site-subtitle {
      opacity: initial;
      top: initial;
    }

    .use-motion {
      .logo-line-before i { left: initial; }
      .logo-line-after i { right: initial; }
    }
  </style>
</noscript>

</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-CN">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">whiledoing</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
    
      
        <p class="site-subtitle">喜欢一切简单且美的事物，包括人。</p>
      
    
  </div>

  <div class="site-nav-toggle">
    <button aria-label="切换导航栏">
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>



<nav class="site-nav">
  
    <ul id="menu" class="menu">
      
        
        
        
          
          <li class="menu-item menu-item-home">
    <a href="/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-home"></i> <br />首页</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-about">
    <a href="/about/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-user"></i> <br />关于</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-tags">
    <a href="/tags/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />标签</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-archives">
    <a href="/archives/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />归档</a>
  </li>

      
      
    </ul>
  

  
    

  

  
</nav>



  



</div>
    </header>

    


    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  
    <div class="reading-progress-bar"></div>
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://whiledoing.me/2017/12/07/diary/diary-2017-12-06-WED/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="whiledoing">
      <meta itemprop="description" content="喜欢一切简单且美的事物，包括人。">
      <meta itemprop="image" content="/images/avatar.jpeg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="whiledoing">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">diary-2017-12-06-WED
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">

            
            
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              

              
                
              

              <time title="创建时间：2017-12-07 20:03:12" itemprop="dateCreated datePublished" datetime="2017-12-07T20:03:12+08:00">2017-12-07</time>
            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body han-init-context" itemprop="articleBody">

      
      

      
        <p>&#x4ECA;&#x5929;&#x662F;&#x7237;&#x7237;&#x751F;&#x75C5;&#x4F4F;&#x9662;&#x7684;&#x7B2C;22&#x5929;&#x3002;
&#x65E9;&#x4E0A;&#x6211;&#x4ECE;&#x533B;&#x9662;&#x56DE;&#x5BB6;&#xFF0C;&#x4F34;&#x7740;&#x5357;&#x4EAC;&#x65E9;&#x4E0A;&#x660E;&#x5A9A;&#x548C;&#x7166;&#x7684;&#x9633;&#x5149;&#xFF0C;&#x5FC3;&#x91CC;&#x60F3;&#x7740;&#x7237;&#x7237;&#x8FD9;&#x5468;&#x5E94;&#x8BE5;&#x5C31;&#x53EF;&#x4EE5;&#x79BB;&#x5F00;&#x795E;&#x7ECF;&#x5185;&#x79D1;&#x800C;&#x8F6C;&#x5230;&#x5EB7;&#x590D;&#x79D1;&#x8FDB;&#x884C;&#x5EB7;&#x590D;&#x6CBB;&#x7597;&#xFF0C;&#x5FC3;&#x91CC;&#x987F;&#x65F6;&#x89C9;&#x5F97;&#x6696;&#x6696;&#x7684;&#x3002;&#x56DE;&#x5230;&#x59D1;&#x59D1;&#x5BB6;&#xFF0C;&#x672C;&#x6765;&#x5E94;&#x8BE5;&#x76F4;&#x63A5;&#x7761;&#x89C9;&#x7684;&#xFF0C;&#x4E0D;&#x8FC7;&#x4E09;&#x5A76;&#x4E4B;&#x524D;&#x544A;&#x8BC9;&#x6211;&#x5979;&#x51FA;&#x95E8;&#x53BB;&#x533B;&#x9662;&#x94A5;&#x5319;&#x6CA1;&#x6709;&#x5E26;&#xFF0C;&#x4E2D;&#x5348;&#x56DE;&#x53BB;&#x65F6;&#x5019;&#x9700;&#x8981;&#x6211;&#x5F00;&#x95E8;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5C31;&#x6CA1;&#x6709;&#x7761;&#xFF0C;&#x7B49;&#x5230;&#x5979;&#x56DE;&#x6765;&#x5403;&#x8FC7;&#x4E2D;&#x996D;&#x624D;&#x8EBA;&#x5230;&#x5E8A;&#x4E0A;&#x4F11;&#x606F;&#x3002;</p>
<p>&#x6CA1;&#x8FC7;&#x591A;&#x4E45;&#xFF0C;&#x4E8C;&#x7237;&#x7ED9;&#x6211;&#x7535;&#x8BDD;&#xFF0C;&#x4ED6;&#x544A;&#x8BC9;&#x6211;&#x5EB7;&#x590D;&#x79D1;&#x4ECA;&#x5929;&#x75C5;&#x5E8A;&#x7A7A;&#x51FA;&#x6765;&#x4E00;&#x4E2A;&#xFF0C;&#x7237;&#x7237;&#x4E0B;&#x5348;&#x5C31;&#x53EF;&#x4EE5;&#x8F6C;&#x8FC7;&#x53BB;&#x3002;&#x4ED6;&#x672C;&#x6765;&#x4EE5;&#x4E3A;&#x6211;&#x8FD8;&#x5728;&#x533B;&#x9662;&#xFF0C;&#x6240;&#x4EE5;&#x662F;&#x8981;&#x6211;&#x529E;&#x4E00;&#x4E0B;&#x51FA;&#x9662;&#x624B;&#x7EED;&#xFF0C;&#x4E0D;&#x8FC7;&#x6211;&#x5DF2;&#x7ECF;&#x56DE;&#x6765;&#x4F11;&#x606F;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x540E;&#x6765;&#x53C8;&#x544A;&#x8BC9;&#x4E86;&#x59D1;&#x59D1;&#xFF0C;&#x59D1;&#x59D1;&#x4E0B;&#x5348;&#x5C31;&#x8BF7;&#x5047;&#x6765;&#x533B;&#x9662;&#x529E;&#x7406;&#x624B;&#x7EED;&#x3002;&#x6211;&#x5FC3;&#x60F3;&#x4E8B;&#x60C5;&#x80AF;&#x5B9A;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x5C31;&#x6CA1;&#x6709;&#x4F11;&#x606F;&#xFF0C;&#x76F4;&#x63A5;&#x53BB;&#x4E86;&#x533B;&#x9662;&#xFF0C;&#x5728;&#x516C;&#x4EA4;&#x8F66;&#x4E0A;&#x9762;&#x7761;&#x4E86;&#x4E00;&#x8DEF;&#xFF0C;&#x4E0B;&#x8F66;&#x4E4B;&#x540E;&#x53D1;&#x73B0;&#x7CBE;&#x795E;&#x8FD8;&#x53EF;&#x4EE5;&#xFF0C;&#x5C31;&#x76F4;&#x63A5;&#x53BB;&#x4E86;&#x75C5;&#x623F;&#x3002;</p>
<p>&#x5230;&#x4E86;&#x53D1;&#x73B0;&#x5E76;&#x6CA1;&#x6709;&#x7ACB;&#x523B;&#x642C;&#x8D70;&#xFF0C;&#x4E00;&#x6765;&#x51FA;&#x9662;&#x548C;&#x4F4F;&#x9662;&#x624B;&#x7EED;&#x8FD8;&#x9700;&#x8981;&#x4E0D;&#x5C11;&#x6D41;&#x7A0B;&#x548C;&#x65F6;&#x95F4;&#x6765;&#x529E;&#x7406;&#xFF0C;&#x4E8C;&#x6765;&#x90A3;&#x8FB9;&#x75C5;&#x4EBA;&#x8981;&#x5230;&#x665A;&#x4E0A;6&#x70B9;&#x5DE6;&#x53F3;&#x624D;&#x642C;&#x8D70;&#x3002;&#x8FC7;&#x4E86;&#x4E00;&#x4F1A;&#xFF0C;&#x7A0B;&#x4E3B;&#x4EFB;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x75C5;&#x5E8A;&#x5176;&#x5B9E;&#x662F;&#x8FD9;&#x8FB9;&#x548C;&#x5EB7;&#x590D;&#x79D1;&#x4E00;&#x5BF9;&#x4E00;&#x6362;&#x8FC7;&#x6765;&#x7684;&#xFF0C;&#x4E0D;&#x7136;&#x8FD8;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x65F6;&#x95F4;&#xFF0C;&#x53EF;&#x89C1;&#x533B;&#x9662;&#x75C5;&#x5E8A;&#x4E4B;&#x7D27;&#x5F20;&#x3002;</p>
<p>&#x7EA6;&#x4E0B;&#x5348;&#x56DB;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x6536;&#x5230;&#x901A;&#x77E5;&#x6709;&#x5E8A;&#x4F4D;&#xFF0C;&#x5C31;&#x7ACB;&#x523B;&#x6536;&#x62FE;&#x884C;&#x674E;&#x642C;&#x4E86;&#x8FC7;&#x53BB;&#x3002;&#x642C;&#x8FC7;&#x53BB;&#x7684;&#x65F6;&#x5019;&#x53D1;&#x751F;&#x4E86;&#x4EF6;&#x8DA3;&#x4E8B;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x521A;&#x5C06;&#x5750;&#x8F6E;&#x6905;&#x7684;&#x7237;&#x7237;&#x63A8;&#x9001;&#x5230;&#x75C5;&#x623F;&#x95E8;&#x53E3;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x56F4;&#x7740;&#x4E00;&#x5806;&#x7684;&#x533B;&#x62A4;&#x4EBA;&#x5458;&#xFF0C;&#x6211;&#x5F53;&#x65F6;&#x5FC3;&#x60F3;&#x8FD9;&#x4E48;&#x5927;&#x7684;&#x67B6;&#x52BF;&#xFF01;&#x540E;&#x6765;&#x5F53;&#x6211;&#x4EEC;&#x8FDB;&#x5165;&#x75C5;&#x623F;&#x624D;&#x77E5;&#x9053;&#xFF0C;&#x4ED6;&#x4EEC;&#x662F;&#x8981;&#x6C42;&#x6211;&#x4EEC;&#x5C06;&#x6240;&#x6709;&#x884C;&#x674E;&#x4F4F;&#x9662;&#x7528;&#x54C1;&#x90FD;&#x6536;&#x597D;&#xFF0C;&#x6216;&#x8005;&#x85CF;&#x8D77;&#x6765;&#xFF0C;&#x4E0D;&#x80FD;&#x5728;&#x5916;&#x9762;&#x653E;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x4F1A;&#x6C5F;&#x82CF;&#x7701;&#x7684;&#x7701;&#x957F;&#x8981;&#x6765;&#x89C6;&#x5BDF;&#x7701;&#x533B;&#x9662;&#x7684;&#x5EB7;&#x590D;&#x79D1;&#xFF0C;&#x602A;&#x4E0D;&#x5F97;&#x8FD9;&#x4E48;&#x7D27;&#x5F20;&#x548C;&#x8FD9;&#x4E48;&#x5927;&#x7684;&#x67B6;&#x52BF;&#x3002;&#x4E5F;&#x771F;&#x662F;&#x5DE7;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x653E;&#x597D;&#x4E1C;&#x897F;&#xFF0C;&#x6CA1;&#x8FC7;&#x51E0;&#x5206;&#x949F;&#x7701;&#x957F;&#x5C31;&#x6765;&#x4E86;&#xFF0C;&#x5468;&#x56F4;&#x4E00;&#x5806;&#x9662;&#x957F;&#x966A;&#x540C;&#xFF0C;&#x6211;&#x4E5F;&#x662F;&#x4EBA;&#x751F;&#x7B2C;&#x4E00;&#x6B21;&#x9762;&#x5BF9;&#x9762;&#x89C1;&#x5230;&#x7701;&#x957F;&#x804C;&#x4F4D;&#x7684;&#x5E72;&#x90E8;&#xFF0C;&#x5F53;&#x65F6;&#x5F88;&#x60F3;&#x5077;&#x62CD;&#xFF0C;&#x7EC8;&#x7A76;&#x6CA1;&#x597D;&#x610F;&#x601D;&#x3002;&#x8FD8;&#x597D;&#x7701;&#x957F;&#x6CA1;&#x89C6;&#x5BDF;&#x591A;&#x4E45;&#x5C31;&#x53C8;&#x5728;&#x4E00;&#x5806;&#x9662;&#x957F;&#x966A;&#x540C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x547C;&#x5566;&#x547C;&#x5566;&#x7684;&#x79BB;&#x5F00;&#x4E86;&#xFF0C;&#x79BB;&#x5F00;&#x7684;&#x80CC;&#x5F71;&#x540E;&#x662F;&#x6211;&#x4EEC;&#x5306;&#x5FD9;&#x6446;&#x653E;&#x884C;&#x674E;&#x7684;&#x8EAB;&#x5F71;&#x3002;</p>
<p>&#x4E4B;&#x524D;&#x4E00;&#x76F4;&#x662F;&#x6211;&#x548C;&#x59D1;&#x59D1;&#x8F6E;&#x7740;&#x4E0A;&#x591C;&#x73ED;&#x966A;&#x62A4;&#x7237;&#x7237;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x5546;&#x91CF;&#x8FC7;&#xFF1A;&#x5230;&#x4E86;&#x5EB7;&#x590D;&#x79D1;&#x8981;&#x627E;&#x4E00;&#x4E2A;&#x4E00;&#x5BF9;&#x4E00;&#x7684;&#x62A4;&#x5DE5;&#x6765;&#x966A;&#x62A4;&#xFF08;&#x4E4B;&#x524D;&#x662F;&#x4E00;&#x5BF9;&#x591A;&#xFF09;&#xFF0C;&#x4E0D;&#x7136;&#x6211;&#x4EEC;&#x4E00;&#x76F4;&#x71AC;&#x591C;&#x966A;&#x62A4;&#x4E5F;&#x4E0D;&#x662F;&#x957F;&#x4E45;&#x4E4B;&#x8BA1;&#x3002;&#x6765;&#x4E86;&#x4E4B;&#x540E;&#xFF0C;&#x548C;&#x8FD9;&#x8FB9;&#x7684;&#x62A4;&#x5DE5;&#x5C0F;&#x961F;&#x957F;&#x4E07;&#x5E08;&#x5085;&#x534F;&#x8C03;&#xFF0C;&#x8BF7;&#x4E86;&#x4E00;&#x4E2A;&#x4E00;&#x5BF9;&#x4E00;&#x7684;&#x62A4;&#x5DE5;&#x8FDB;&#x884C;24&#x5C0F;&#x65F6;&#x7684;&#x770B;&#x62A4;&#x3002;&#x867D;&#x7136;&#x5982;&#x6B64;&#x5B89;&#x6392;&#xFF0C;&#x6211;&#x4EEC;&#x5FC3;&#x91CC;&#x8FD8;&#x662F;&#x975E;&#x5E38;&#x5FD0;&#x5FD1;&#x4E0D;&#x5B89;&#xFF0C;&#x56E0;&#x4E3A;&#x591C;&#x91CC;&#x7167;&#x6599;&#x7237;&#x7237;&#x7684;&#x4EFB;&#x52A1;&#x5176;&#x5B9E;&#x975E;&#x5E38;&#x8270;&#x5DE8;&#x3002;&#x56E0;&#x4E3A;&#x7237;&#x7237;&#x4ED6;&#x534A;&#x8FB9;&#x762B;&#x75EA;&#xFF0C;&#x591C;&#x91CC;&#x4F1A;&#x7ECF;&#x5E38;&#x7FFB;&#x8EAB;&#xFF0C;&#x7FFB;&#x8EAB;&#x5C31;&#x9700;&#x8981;&#x4EBA;&#x8F85;&#x52A9;&#xFF0C;&#x662F;&#x4E2A;&#x529B;&#x6C14;&#x6D3B;&#xFF1B;&#x540C;&#x65F6;&#x4ED6;&#x73B0;&#x5728;&#x5927;&#x8111;&#x53D7;&#x635F;&#xFF0C;&#x795E;&#x7ECF;&#x7CFB;&#x7EDF;&#x548C;&#x8BA4;&#x77E5;&#x7CFB;&#x7EDF;&#x90FD;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#xFF0C;&#x8FD9;&#x5BFC;&#x81F4;&#x4ED6;&#x8BF4;&#x4E0D;&#x6E05;&#x695A;&#x8BDD;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x8BF4;&#x7684;&#x8BDD;&#x4ED6;&#x4EA6;&#x4E0D;&#x61C2;&#x3002;&#x5F53;&#x4ED6;&#x591C;&#x91CC;&#x6709;&#x9700;&#x6C42;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x4F1A;&#x8BF4;&#x8BDD;&#xFF0C;&#x4F46;&#x662F;&#x8BF4;&#x4E0D;&#x6E05;&#x695A;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x9700;&#x8981;&#x731C;&#x6D4B;&#x4ED6;&#x7684;&#x60F3;&#x6CD5;&#x3002;&#x800C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x505A;&#x5230;&#x4ED6;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x4ED6;&#x5C31;&#x4F1A;&#x50CF;&#x5C0F;&#x5B69;&#x5B50;&#x4E00;&#x6837;&#x5927;&#x58F0;&#x53EB;&#x5524;&#xFF0C;&#x8D8A;&#x53EB;&#x8D8A;&#x5927;&#xFF0C;&#x4E0D;&#x53D7;&#x63A7;&#x5236;&#xFF0C;&#x6240;&#x4EE5;&#x7167;&#x987E;&#x7237;&#x7237;&#x53C8;&#x662F;&#x4E00;&#x4E2A;&#x5FC3;&#x7406;&#x6D3B;&#xFF0C;&#x9700;&#x8981;&#x6781;&#x5F3A;&#x7684;&#x7EC6;&#x5FC3;&#x548C;&#x8010;&#x5FC3;&#x3002;&#x4F46;&#x662F;&#x60F3;&#x5230;&#x7237;&#x7237;&#x7684;&#x5EB7;&#x590D;&#x6CBB;&#x7597;&#x662F;&#x4E00;&#x4E2A;&#x957F;&#x671F;&#x548C;&#x75C5;&#x9B54;&#x6297;&#x6218;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x4ECE;&#x957F;&#x8BA1;&#x8BAE;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7B2C;&#x4E09;&#x65B9;&#x4EBA;&#x5458;&#x7684;&#x534F;&#x52A9;&#xFF0C;&#x4E0D;&#x7136;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x4E5F;&#x4F1A;&#x7D2F;&#x57AE;&#x3002;&#x6240;&#x4EE5;&#x867D;&#x7136;&#x5FC3;&#x91CC;&#x6709;&#x4E00;&#x4E07;&#x4E2A;&#x4E0D;&#x653E;&#x5FC3;&#xFF0C;&#x8FD8;&#x662F;&#x591C;&#x91CC;&#x4EA4;&#x7ED9;&#x4E86;&#x62A4;&#x5DE5;&#xFF0C;&#x60F3;&#x7740;&#x660E;&#x5929;&#x65E9;&#x70B9;&#x8FC7;&#x6765;&#x518D;&#x6765;&#x770B;&#x770B;&#x5177;&#x4F53;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x53C8;&#x53CA;&#xFF0C;&#x7237;&#x7237;&#x5EB7;&#x590D;&#x8BAD;&#x7EC3;&#x65F6;&#x5019;&#x7684;&#x7167;&#x7247;&#xFF1A;</p>
<p><img src="http://static.zybuluo.com/whiledoing/yrpe3hdcg7gt9yeubuzxpl3a/image_1c10oep21uiv1cai1aksn01p149.png" alt="image_1c10oep21uiv1cai1aksn01p149.png-1161.4kB"></p>

      
    </div>

    
      

  <div class="popular-posts-header">相关文章</div>
  <ul class="popular-posts">
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/21/diary/diary-2017-12-16-SAT/" rel="bookmark">diary-2017-12-16-SAT</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/19/diary/diary-2016-12-14-THU/" rel="bookmark">diary-2016-12-14-THU</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/12/diary/diary-2017-12-09-SAT/" rel="bookmark">diary-2017-12-09-SAT</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/11/diary/diary-2017-12-07-THU/" rel="bookmark">diary-2017-12-07-THU</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/12/diary/diary-2017-12-10-SUN/" rel="bookmark">diary-2017-12-10-SUN</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/12/diary/diary-2017-12-11-MON/" rel="bookmark">diary-2017-12-11-MON</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/16/diary/diary-2017-12-12-TUE/" rel="bookmark">diary-2017-12-12-TUE</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/21/diary/diary-2017-12-15-FRI/" rel="bookmark">diary-2017-12-15-FRI</a></div>
      
    </li>
  
  </ul>


    

    
    
    

    

    

    
      <div>
        <ul class="post-copyright">
  <li class="post-copyright-author">
    <strong>本文作者： </strong>whiledoing</li>
  <li class="post-copyright-link">
    <strong>本文链接：</strong>
    <a href="http://whiledoing.me/2017/12/07/diary/diary-2017-12-06-WED/" title="diary-2017-12-06-WED">http://whiledoing.me/2017/12/07/diary/diary-2017-12-06-WED/</a>
  </li>
  <li class="post-copyright-license">
    <strong>版权声明： </strong>本博客所有文章除特别声明外，均采用 <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/" rel="external nofollow" target="_blank">CC BY-NC-SA 4.0</a> 许可协议。转载请注明出处！</li>
</ul>

      </div>
    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/日记/" rel="tag"># 日记</a>
          
            <a href="/tags/爷爷/" rel="tag"># 爷爷</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2017/11/30/money-hacker-reading-note/" rel="next" title="《富爸爸穷爸爸》&《小狗钱钱》读书笔记">
                <i class="fa fa-chevron-left"></i> 《富爸爸穷爸爸》&《小狗钱钱》读书笔记
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2017/12/11/diary/diary-2017-12-07-THU/" rel="prev" title="diary-2017-12-07-THU">
                diary-2017-12-07-THU <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


  </div>


          </div>
          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      

      <section class="site-overview-wrap sidebar-panel sidebar-panel-active">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <img class="site-author-image" itemprop="image"
                src="/images/avatar.jpeg"
                alt="whiledoing" />
            
              <p class="site-author-name" itemprop="name">whiledoing</p>
              <p class="site-description motion-element" itemprop="description">喜欢一切简单且美的事物，包括人。</p>
          </div>

          
            <nav class="site-state motion-element">
              
                <div class="site-state-item site-state-posts">
                
                  <a href="/archives/">
                
                    <span class="site-state-item-count">62</span>
                    <span class="site-state-item-name">日志</span>
                  </a>
                </div>
              

              

              
                
                
                <div class="site-state-item site-state-tags">
                  <a href="/tags/index.html">
                    
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                    <span class="site-state-item-count">33</span>
                    <span class="site-state-item-name">标签</span>
                  </a>
                </div>
              
            </nav>
          

          

          
            <div class="links-of-author motion-element">
              
                <span class="links-of-author-item">
                  <a href="https://github.com/whiledoing" target="_blank" title="GitHub">GitHub</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="http://www.douban.com/people/58249409" target="_blank" title="豆瓣">豆瓣</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="https://www.zhihu.com/people/whiledoing" target="_blank" title="知乎">知乎</a>
                  
                </span>
              
            </div>
          

          
          

          
          

          
            
          
          

        </div>
      </section>

      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; 2016 – <span itemprop="copyrightYear">2018</span>
  <span class="with-love" id="animate">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">whiledoing</span>

  

  
</div>




  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动 v3.7.1</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 – <a class="theme-link" target="_blank" href="https://theme-next.org">NexT.Mist</a> v6.4.2</div>




        








        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

    
	
    

    
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>
























  



  
  
    <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/reading_progress/reading_progress.js"></script>
  


  


  <script type="text/javascript" src="/js/src/utils.js?v=6.4.2"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=6.4.2"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=6.4.2"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=6.4.2"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=6.4.2"></script>



  



  










  





  

  

  
<script>
(function(){
    var bp = document.createElement('script');
    var curProtocol = window.location.protocol.split(':')[0];
    if (curProtocol === 'https') {
        bp.src = 'https://zz.bdstatic.com/linksubmit/push.js';        
    }
    else {
        bp.src = 'http://push.zhanzhang.baidu.com/push.js';
    }
    var s = document.getElementsByTagName("script")[0];
    s.parentNode.insertBefore(bp, s);
})();
</script>


  
  

  
  

  


  
  

  
  
  
  <script src="/lib/pangu/dist/pangu.min.js?v=3.3"></script>
  <script type="text/javascript">pangu.spacingPage();</script>


  
  <script type="text/javascript" src="/js/src/js.cookie.js?v=6.4.2"></script>
  <script type="text/javascript" src="/js/src/scroll-cookie.js?v=6.4.2"></script>


  

  

  
  <style>
    .copy-btn {
      display: inline-block;
      padding: 6px 12px;
      font-size: 13px;
      font-weight: 700;
      line-height: 20px;
      color: #333;
      white-space: nowrap;
      vertical-align: middle;
      cursor: pointer;
      background-color: #eee;
      background-image: linear-gradient(#fcfcfc, #eee);
      border: 1px solid #d5d5d5;
      border-radius: 3px;
      user-select: none;
      outline: 0;
    }

    .highlight-wrap .copy-btn {
      transition: opacity .3s ease-in-out;
      opacity: 0;
      padding: 2px 6px;
      position: absolute;
      right: 4px;
      top: 8px;
    }

    .highlight-wrap:hover .copy-btn,
    .highlight-wrap .copy-btn:focus {
      opacity: 1
    }

    .highlight-wrap {
      position: relative;
    }
  </style>
  <script>
    $('.highlight').each(function (i, e) {
      var $wrap = $('<div>').addClass('highlight-wrap')
      $(e).after($wrap)
      $wrap.append($('<button>').addClass('copy-btn').append('复制').on('click', function (e) {
        var code = $(this).parent().find('.code').find('.line').map(function (i, e) {
          return $(e).text()
        }).toArray().join('\n')
        var ta = document.createElement('textarea')
        document.body.appendChild(ta)
        ta.style.position = 'absolute'
        ta.style.top = '0px'
        ta.style.left = '0px'
        ta.value = code
        ta.select()
        ta.focus()
        var result = document.execCommand('copy')
        document.body.removeChild(ta)
        
        $(this).blur()
      })).on('mouseleave', function (e) {
        var $b = $(this).find('.copy-btn')
        setTimeout(function () {
          $b.text('复制')
        }, 300)
      }).append(e)
    })
  </script>


</body>
</html>
