<!DOCTYPE html>












  


<html class="theme-next mist use-motion" lang="zh-CN">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=2"/>
<meta name="theme-color" content="#222">



  
  
  <link rel="stylesheet" href="/lib/needsharebutton/needsharebutton.css">




  
  
    
    
  <script src="/lib/pace/pace.min.js?v=1.0.2"></script>
  <link href="/lib/pace/pace-theme-minimal.min.css?v=1.0.2" rel="stylesheet">




  
  
  <link rel="stylesheet" media="all" href="/lib/Han/dist/han.min.css?v=3.3">




<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />






















<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=6.4.0" rel="stylesheet" type="text/css" />


  <link rel="apple-touch-icon" sizes="180x180" href="/images/favicon.png?v=6.4.0">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon.png?v=6.4.0">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon.png?v=6.4.0">


  <link rel="mask-icon" href="/images/logo.svg?v=6.4.0" color="#222">









<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    version: '6.4.0',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":false,"onmobile":false},
    fancybox: false,
    fastclick: false,
    lazyload: false,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>


  




  <meta name="description" content="《活法》是日本稻盛和夫老先生写的关于人生为什么活着，应该怎样活着的一本书。书中很多道理和思想值得大家一辈子去学习和体会。人生就是一场修行，苦行僧的修行。">
<meta name="keywords" content="读书笔记,哲理">
<meta property="og:type" content="article">
<meta property="og:title" content="《活法》读书笔记">
<meta property="og:url" content="http://whiledoing.me/2016/04/01/how-to-life-learn-note/index.html">
<meta property="og:site_name" content="whiledoing">
<meta property="og:description" content="《活法》是日本稻盛和夫老先生写的关于人生为什么活着，应该怎样活着的一本书。书中很多道理和思想值得大家一辈子去学习和体会。人生就是一场修行，苦行僧的修行。">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2018-04-17T13:29:53.017Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="《活法》读书笔记">
<meta name="twitter:description" content="《活法》是日本稻盛和夫老先生写的关于人生为什么活着，应该怎样活着的一本书。书中很多道理和思想值得大家一辈子去学习和体会。人生就是一场修行，苦行僧的修行。">






  <link rel="canonical" href="http://whiledoing.me/2016/04/01/how-to-life-learn-note/"/>



<script type="text/javascript" id="page.configurations">
  CONFIG.page = {
    sidebar: "",
  };
</script>

  <title>《活法》读书笔记 | whiledoing</title>
  




<script async src="https://www.googletagmanager.com/gtag/js?id=UA-117714040-1"></script>
<script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'UA-117714040-1');
</script>



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "https://hm.baidu.com/hm.js?6de2920425778ca5a4ee717be5055e96";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>




  <noscript>
  <style type="text/css">
    .use-motion .motion-element,
    .use-motion .brand,
    .use-motion .menu-item,
    .sidebar-inner,
    .use-motion .post-block,
    .use-motion .pagination,
    .use-motion .comments,
    .use-motion .post-header,
    .use-motion .post-body,
    .use-motion .collection-title { opacity: initial; }

    .use-motion .logo,
    .use-motion .site-title,
    .use-motion .site-subtitle {
      opacity: initial;
      top: initial;
    }

    .use-motion {
      .logo-line-before i { left: initial; }
      .logo-line-after i { right: initial; }
    }
  </style>
</noscript>

</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-CN">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">whiledoing</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
    
      
        <p class="site-subtitle">喜欢一切简单且美的事物，包括人。</p>
      
    
  </div>

  <div class="site-nav-toggle">
    <button aria-label="切换导航栏">
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>



<nav class="site-nav">
  
    <ul id="menu" class="menu">
      
        
        
        
          
          <li class="menu-item menu-item-home">
    <a href="/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-home"></i> <br />首页</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-about">
    <a href="/about/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-user"></i> <br />关于</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-tags">
    <a href="/tags/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />标签</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-archives">
    <a href="/archives/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />归档</a>
  </li>

      
      
    </ul>
  

  
    

  

  
</nav>



  



</div>
    </header>

    


    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  
    <div class="reading-progress-bar"></div>
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://whiledoing.me/2016/04/01/how-to-life-learn-note/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="whiledoing">
      <meta itemprop="description" content="喜欢一切简单且美的事物，包括人。">
      <meta itemprop="image" content="/images/avatar.jpeg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="whiledoing">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">《活法》读书笔记
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">

            
            
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              

              
                
              

              <time title="创建时间：2016-04-01 17:16:09" itemprop="dateCreated datePublished" datetime="2016-04-01T17:16:09+08:00">2016-04-01</time>
            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body han-init-context" itemprop="articleBody">

      
      

      
        <p><a href="https://book.douban.com/subject/1269900/" target="_blank" rel="noopener">&#x300A;&#x6D3B;&#x6CD5;&#x300B;</a>&#x662F;&#x65E5;&#x672C;&#x7A3B;&#x76DB;&#x548C;&#x592B;&#x8001;&#x5148;&#x751F;&#x5199;&#x7684;&#x5173;&#x4E8E;&#x4EBA;&#x751F;&#x4E3A;&#x4EC0;&#x4E48;&#x6D3B;&#x7740;&#xFF0C;&#x5E94;&#x8BE5;&#x600E;&#x6837;&#x6D3B;&#x7740;&#x7684;&#x4E00;&#x672C;&#x4E66;&#x3002;&#x4E66;&#x4E2D;&#x5F88;&#x591A;&#x9053;&#x7406;&#x548C;&#x601D;&#x60F3;&#x503C;&#x5F97;&#x5927;&#x5BB6;&#x4E00;&#x8F88;&#x5B50;&#x53BB;&#x5B66;&#x4E60;&#x548C;&#x4F53;&#x4F1A;&#x3002;&#x4EBA;&#x751F;&#x5C31;&#x662F;&#x4E00;&#x573A;&#x4FEE;&#x884C;&#xFF0C;&#x82E6;&#x884C;&#x50E7;&#x7684;&#x4FEE;&#x884C;&#x3002;</p>
<a id="more"></a>
<p>&#x6709;&#x7A7A;&#x770B;&#x4E00;&#x4E0B;&#x4E2D;&#x592E;&#x7535;&#x89C6;&#x53F0;&#x5BF9;&#x4E8E;&#x8001;&#x5148;&#x751F;&#x7684;&#x91C7;&#x8BBF;&#x3002;</p>
<p>&#x4EBA;&#x751F;&#x7684;&#x76EE;&#x7684;&#x5728;&#x54EA;&#x91CC;&#xFF1F;&#x63D0;&#x5347;&#x5FC3;&#x6027;&#xFF0C;&#x78E8;&#x7EC3;&#x7075;&#x9B42;&#x3002;&#x5728;&#x6B7B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7075;&#x9B42;&#x6BD4;&#x751F;&#x7684;&#x65F6;&#x5019;&#x66F4;&#x52A0;&#x7EAF;&#x6D01;&#x3002;</p>
<p>&#x522B;&#x4EBA;&#x95EE;&#x6211;&#x6210;&#x529F;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x6211;&#x60F3;&#x7406;&#x7531;&#x5C31;&#x662F;&#x4E00;&#x70B9;&#x3002;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x6211;&#x7684;&#x624D;&#x80FD;&#x6216;&#x8BB8;&#x6709;&#x9650;&#xFF0C;&#x4F46;&#x6211;&#x62E5;&#x6709;&#x867D;&#x7136;&#x5355;&#x7EAF;&#x5374;&#x975E;&#x5E38;&#x6709;&#x529B;&#x7684;&#x6307;&#x9488;&#xFF1A;<strong>&#x8FFD;&#x6C42;&#x505A;&#x4EBA;&#x7684;&#x6B63;&#x786E;&#x6CD5;&#x5219;&#x3002;</strong></p>
<p>&#x4EBA;&#x751F;&#x7684;&#x4FEE;&#x884C;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x5DE5;&#x4F5C;&#x4E2D;&#x4F53;&#x4F1A;&#xFF1A;</p>
<ol>
<li>&#x91CA;&#x8FE6;&#x6469;&#x5C3C;&#x8C08;&#x5230;&#x53C2;&#x609F;&#x4E4B;&#x9053;&#xFF0C;&#x5176;&#x4E2D;&#x91CD;&#x8981;&#x4E00;&#x6761;&#x53EB;&#x505A;&#x300C;&#x7CBE;&#x8FDB;&#x300D;&#xFF0C;&#x5C31;&#x662F;&#x62FC;&#x547D;&#x52AA;&#x529B;&#xFF0C;&#x5FC3;&#x65E0;&#x65C1;&#x8D37;&#xFF0C;&#x57CB;&#x5934;&#x773C;&#x524D;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x8FD9;&#x662F;&#x63D0;&#x9AD8;&#x5FC3;&#x6027;&#xFF0C;&#x78E8;&#x7EC3;&#x4EBA;&#x683C;&#x6700;&#x91CD;&#x8981;&#x4E5F;&#x662F;&#x6700;&#x6709;&#x6548;&#x7684;&#x65B9;&#x5F0F;&#x3002;</li>
<li>&#x5168;&#x8EAB;&#x5FC3;&#x7684;&#x6295;&#x5165;&#x6BCF;&#x5929;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5C31;&#x662F;&#x6700;&#x6709;&#x6548;&#x7684;&#x300C;&#x4FEE;&#x884C;&#x300D;</li>
<li>&#x6BD4;&#x5B8C;&#x6210;&#x6D3B;&#x513F;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#x5B8C;&#x5584;&#x5E72;&#x6D3B;&#x4EBA;&#x7684;&#x4EBA;&#x683C;&#x3002;</li>
<li>&#x6211;&#x5E38;&#x5BF9;&#x5458;&#x5DE5;&#x8BB2;&#xFF0C;&#x5FC5;&#x987B;<strong>&#x6781;&#x5EA6;&#x8BA4;&#x771F;</strong>&#x5730;&#x8FC7;&#x597D;&#x6BCF;&#x4E00;&#x5929;&#xFF0C;&#x4EBA;&#x751F;&#x53EA;&#x6709;&#x4E00;&#x6B21;&#xFF0C;&#x7EDD;&#x5BF9;&#x4E0D;&#x53EF;&#x4EE5;&#x6D6A;&#x8D39;&#xFF0C;&#x5FC5;&#x987B;<strong>&#x6781;&#x5EA6;&#x52AA;&#x529B;</strong></li>
</ol>
<p>&#x4EBA;&#x751F;&#x53D6;&#x5F97;&#x6210;&#x5C31; &#xFF1D; &#x300C;&#x601D;&#x7EF4;&#x65B9;&#x5F0F; * &#x80FD;&#x529B; * &#x70ED;&#x60C5;&#x300D;</p>
<p>&#x5176;&#x4E2D;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x7279;&#x522B;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x53EF;&#x80FD;&#x662F;&#x6B63;&#x503C;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x8D1F;&#x503C;&#x3002;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x54C1;&#x8D28;&#xFF0C;&#x6001;&#x5EA6;&#xFF0C;&#x5FC3;&#x6027;&#x7B49;&#x7B49;&#x4EBA;&#x683C;&#x54C1;&#x8D28;&#xFF0C;&#x8BF4;&#x7684;&#x865A;&#x7684;&#xFF0C;&#x5C31;&#x662F;&#x4EBA;&#x751F;&#x89C2;&#x4EF7;&#x503C;&#x89C2;&#xFF0C;&#x4E5F;&#x662F;&#x9700;&#x8981;&#x53BB;&#x4FEE;&#x884C;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x4EBA;&#x751F;&#x6CD5;&#x5219;&#xFF1A;&#x53EA;&#x6709;&#x4E3B;&#x52A8;&#x8FFD;&#x6C42;&#x7684;&#x4E1C;&#x897F;&#x624D;&#x53EF;&#x80FD;&#x5230;&#x624B;&#x3002;<strong>&#x5FC3;&#x4E0D;&#x5524;&#x7269;&#xFF0C;&#x7269;&#x4E0D;&#x81F3;</strong>&#x3002;</p>
<p>&#x52AA;&#x529B;&#x5230;<strong>&#x4F1A;&#x5212;&#x7834;&#x624B;</strong>&#x7684;&#x72B6;&#x6001;&#x3002;&#x4E00;&#x4E2A;&#x5B8C;&#x7F8E;&#x7684;&#x4EA7;&#x54C1;&#x5448;&#x73B0;&#x5728;&#x4F60;&#x773C;&#x524D;&#x65F6;&#xFF0C;&#x4EBA;&#x4EEC;&#x6B23;&#x8D4F;&#x5B83;&#xFF0C;&#x51FA;&#x4E8E;&#x656C;&#x754F;&#x4E4B;&#x5FC3;&#xFF0C;&#x751A;&#x81F3;&#x4E0D;&#x6562;&#x7528;&#x624B;&#x53BB;&#x78B0;&#x5B83;&#xFF0C;&#x5C31;&#x662F;&#x8981;&#x505A;&#x5230;&#x8FD9;&#x79CD;&#x7A0B;&#x5EA6;&#x3002;&#x5BF9;&#x4E8E;&#x5B8C;&#x7F8E;&#x8981;&#x6709;&#x8FFD;&#x6C42;&#x3002;</p>
<p>&#x300C;&#x4E50;&#x89C2;&#x6784;&#x60F3;&#xFF0C;&#x60B2;&#x89C2;&#x6267;&#x884C;&#xFF0C;&#x4E50;&#x89C2;&#x5B9E;&#x73B0;&#x300D;&#xFF0C;&#x8FD9;&#x662F;&#x6210;&#x5C31;&#x4E8B;&#x4E1A;&#xFF0C;&#x53D8;&#x7406;&#x60F3;&#x4E3A;&#x73B0;&#x5B9E;&#x65F6;&#x5FC5;&#x987B;&#x7684;&#x6001;&#x5EA6;&#x3002;</p>
<p>&#x300C;&#x6709;&#x610F;&#x6CE8;&#x610F;&#x300D; &#x662F;&#x5C06;&#x81EA;&#x5DF1;&#x7684;&#x610F;&#x8BC6;&#x51DD;&#x805A;&#x8D77;&#x6765;&#xFF0C;&#x96C6;&#x4E2D;&#x5230;&#x67D0;&#x4E00;&#x4E8B;&#x52A1;&#x6240;&#x6709;&#x65B9;&#x9762;&#x7684;&#x4E00;&#x5207;&#x7EC6;&#x8282;&#x4E0A;&#x3002;&#x4EBA;&#x751F;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x6709;&#x610F;&#x6CE8;&#x610F;&#x5C31;&#x6CA1;&#x6709;&#x4EF7;&#x503C;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6162;&#x6162;&#x57F9;&#x517B;&#x89C1;&#x96C6;&#x4E2D;&#x529B;&#x653E;&#x5728;&#x4E00;&#x5904;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x4F1A;&#x6293;&#x4F4F;&#x4E8B;&#x52A1;&#x7684;&#x672C;&#x8D28;&#x3002;</p>
<p>&#x771F;&#x7406;&#x5F80;&#x5F80;&#x662F;&#x7B80;&#x5355;&#x7684;&#x3002;&#x4EBA;&#x7C7B;&#x7684;&#x57FA;&#x56E0;&#x6709;&#x4E09;&#x5341;&#x4EBF;&#x7684;&#x78B1;&#x57FA;&#x5BF9;&#x6784;&#x6210;&#xFF0C;&#x4F46;&#x8868;&#x8FBE;&#x57FA;&#x56E0;&#x7684;&#x5BC6;&#x7801;&#x53EA;&#x6709;4&#x79CD;&#x3002;</p>
<p>&#x300C;&#x6BCF;&#x4E00;&#x5929;&#x90FD;&#x6781;&#x5EA6;&#x8BA4;&#x771F;&#x300D;-- &#x8FD9;&#x53E5;&#x8BDD;&#x975E;&#x5E38;&#x7684;&#x7B80;&#x5355;&#xFF0C;&#x5374;&#x662F;&#x4EBA;&#x751F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x6CD5;&#x5219;&#x3002;&#x5982;&#x679C;&#x5E0C;&#x671B;&#x4EBA;&#x751F;&#x4E4B;&#x620F;&#x5185;&#x5BB9;&#x4E30;&#x5BCC;&#xFF0C;&#x60C5;&#x8282;&#x751F;&#x52A8;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x4E00;&#x5929;&#x4E00;&#x5929;&#xFF0C;&#x4E00;&#x77AC;&#x4E00;&#x77AC;&#xFF0C;&#x51A0;&#x4EE5;<strong>&#x6781;&#x5EA6;</strong>&#x4E8C;&#x5B57;&#x7684;&#x8BA4;&#x771F;&#x6001;&#x5EA6;&#x5FC5;&#x4E0D;&#x53EF;&#x5C11;&#x3002;</p>
<p>&#x4E0D;&#x5728;&#x73B0;&#x573A;&#x6D41;&#x6C57;&#xFF0C;&#x4EC0;&#x4E48;&#x4E5F;&#x5B66;&#x4E0D;&#x5230;&#x3002;&#x300C;&#x4F53;&#x9A8C;&#x91CD;&#x4E8E;&#x77E5;&#x8BC6;&#x300D;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4EBA;&#x751F;&#x91CD;&#x8981;&#x7684;&#x6CD5;&#x5219;&#x3002;&#x4E0D;&#x8981;&#x4EE5;&#x4E3A;&#x77E5;&#x9053;&#x5C31;&#x7B49;&#x4E8E;&#x4F1A;&#xFF0C;&#x91CD;&#x89C6;&#x5B9E;&#x8DF5;&#xFF0C;&#x91CD;&#x89C6;&#x4F53;&#x9A8C;&#x3002;</p>
<p>&#x6210;&#x5C31;&#x4E8B;&#x4E1A;&#x9700;&#x8981;<strong>&#x81EA;&#x71C3;&#x578B;</strong>&#x4EBA;&#x683C;&#xFF0C;&#x5C31;&#x662F;&#x81EA;&#x5DF1;&#x5C31;&#x80FD;&#x5C06;&#x81EA;&#x5DF1;&#x7684;&#x70ED;&#x60C5;&#x70B9;&#x71C3;&#x3002;</p>
<p>&#x300C;&#x559C;&#x6B22;&#x300D;&#x548C;&#x300C;&#x6295;&#x5165;&#x300D;&#x662F;&#x786C;&#x5E01;&#x7684;&#x6B63;&#x53CD;&#x9762;&#xFF0C;&#x4F60;&#x8D8A;&#x559C;&#x6B22;&#x4F60;&#x8D8A;&#x6295;&#x5165;&#xFF0C;&#x540C;&#x6837;&#xFF0C;<strong>&#x4F60;&#x8D8A;&#x6295;&#x5165;&#x4F60;&#x8D8A;&#x559C;&#x6B22;</strong>&#x3002;&#x5982;&#x679C;&#x627E;&#x4E0D;&#x5230;&#x5DE5;&#x4F5C;&#x7684;&#x4E50;&#x8DA3;&#xFF0C;&#x59D1;&#x4E14;&#x4E00;&#x5FC3;&#x4E0D;&#x4E71;&#xFF0C;&#x62FC;&#x547D;&#x6295;&#x5165;&#x5DE5;&#x4F5C;&#x518D;&#x8BF4;&#x3002;</p>
<p>&#x4EBA;&#x771F;&#x6B63;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x5E94;&#x8BE5;&#x5305;&#x62EC;&#x6291;&#x5236;&#x6B32;&#x671B;&#xFF0C;&#x5168;&#x529B;&#x6295;&#x5165;&#x5DE5;&#x4F5C;&#x7684;&#x514B;&#x5DF1;&#x5FC3;&#x5728;&#x5185;&#x3002;&#x4E0D;&#x7BA1;&#x4F60;&#x7684;&#x80FD;&#x529B;&#x6709;&#x591A;&#x5927;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x80FD;&#x6218;&#x80DC;&#x81EA;&#x5DF1;&#x7684;&#x8D2A;&#x56FE;&#x5B89;&#x9038;&#x4E4B;&#x5FC3;&#xFF0C;&#x4E0D;&#x80AF;&#x52AA;&#x529B;&#x594B;&#x6597;&#xFF0C;&#x4E0D;&#x80FD;&#x53D1;&#x6325;&#x81EA;&#x5DF1;&#x7684;&#x806A;&#x660E;&#x624D;&#x667A;&#xFF0C;&#x4ECE;&#x8FD9;&#x4E2A;&#x610F;&#x4E49;&#x4E0A;&#x8BF4;&#xFF0C;&#x4E00;&#x6837;&#x662F;&#x7F3A;&#x4E4F;&#x80FD;&#x529B;&#x7684;&#x4EBA;&#x3002;</p>
<p>&#x4FDD;&#x6301;&#x8C26;&#x900A;&#x4E4B;&#x5FC3;&#xFF1A;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x624D;&#x80FD;&#x90FD;&#x662F;<strong>&#x4ECE;&#x4E0A;&#x5929;&#x501F;&#x6765;&#x7684;</strong>&#x3002;</p>
<p>&#x4E2D;&#x56FD;&#x660E;&#x4EE3;&#x601D;&#x60F3;&#x5BB6;&#x5415;&#x65B0;&#x543E;&#x5728;&#x4ED6;&#x6240;&#x8457;&#x300A;&#x547B;&#x541F;&#x8BED;&#x300B;&#x4E2D;&#x66FE;&#x660E;&#x786E;&#x63D0;&#x51FA;&#xFF1A;&#x300C;&#x6DF1;&#x6C89;&#x539A;&#x91CD;&#x662F;&#x4E00;&#x7B49;&#x8D44;&#x8D28;&#xFF0C;&#x78CA;&#x843D;&#x8C6A;&#x96C4;&#x662F;&#x4E8C;&#x7B49;&#x8D44;&#x8D28;&#xFF0C;&#x806A;&#x660E;&#x624D;&#x8FA9;&#x662F;&#x4E09;&#x7B49;&#x8D44;&#x8D28;&#x300D;&#xFF0C;&#x5BF9;&#x5E94;&#x8FD9;<strong>&#x4EBA;&#x683C; &gt; &#x52C7;&#x6C14; &gt; &#x80FD;&#x529B;&#x3002;</strong></p>
<p>&#x7A3B;&#x76DB;&#x548C;&#x592B;&#x63D0;&#x51FA;&#x7684;&#x300C;&#x516D;&#x9879;&#x7CBE;&#x8FDB;&#x300D;&#xFF1A;</p>
<ol>
<li>&#x4ED8;&#x51FA;&#x4E0D;&#x4E9A;&#x4E8E;&#x4EFB;&#x4F55;&#x4EBA;&#x7684;&#x52AA;&#x529B;&#x3002;</li>
<li>&#x8C26;&#x865A;&#x6212;&#x9A84;&#x3002;</li>
<li>&#x5929;&#x5929;&#x53CD;&#x7701;&#x3002;</li>
<li>&#x6D3B;&#x7740;&#x5C31;&#x8981;&#x611F;&#x8C22;&#x3002;</li>
<li>&#x79EF;&#x5584;&#x884C;&#xFF0C;&#x601D;&#x5229;&#x4ED6;&#x3002;</li>
<li>&#x4E0D;&#x8981;&#x6709;&#x611F;&#x6027;&#x7684;&#x70E6;&#x607C;&#x3002;</li>
</ol>
<p>&#x9690;&#x853D;&#x5FF5;&#x4F5B;&#xFF0C;&#x591A;&#x591A;&#x611F;&#x8C22;&#x4E0A;&#x82CD;&#xFF0C;&#x591A;&#x591A;&#x81EA;&#x6211;&#x53CD;&#x7701;&#x3002;</p>
<p>&#x4FDD;&#x6301;<strong>&#x7387;&#x76F4;&#x4E4B;&#x5FC3;</strong>&#xFF1A;&#x6C38;&#x8FDC;&#x4FDD;&#x6301;&#x8C26;&#x865A;&#x7684;&#x6001;&#x5EA6;&#xFF0C;&#x5982;&#x5B9E;&#x627F;&#x8BA4;&#x81EA;&#x5DF1;&#x7684;&#x4E0D;&#x8DB3;&#xFF0C;&#x7136;&#x540E;&#x4E0D;&#x60DC;&#x4E00;&#x5207;&#x52AA;&#x529B;&#x3002;</p>
<p>&#x53EA;&#x6709;&#x575A;&#x6301;&#x5929;&#x5929;&#x53CD;&#x7701;&#x7684;&#x4EBA;&#x624D;&#x80FD;&#x4E0D;&#x65AD;&#x63D0;&#x5347;&#x81EA;&#x5DF1;&#x7684;&#x5FC3;&#x5FD7;&#x3002;&#x300C;&#x795E;&#x554A;&#xFF0C;&#x5BF9;&#x4E0D;&#x8D77;&#x300D; &#x2013; &#x6211;&#x5C1D;&#x5C1D;&#x8131;&#x53E3;&#x800C;&#x51FA;&#xFF0C;&#x7528;&#x8FD9;&#x53E5;&#x8BDD;&#x8868;&#x8FBE;&#x53CD;&#x6094;&#x4E4B;&#x610F;&#x3002;&#x65E0;&#x610F;&#x4E2D;&#x901E;&#x4E86;&#x5A01;&#x98CE;&#xFF0C;&#x8BF4;&#x4E86;&#x8FC7;&#x5934;&#x7684;&#x8BDD;&#xFF0C;&#x56DE;&#x5230;&#x5BB6;&#x4E2D;&#xFF0C;&#x6211;&#x5C31;&#x4F1A;&#x5411;&#x795E;&#x5FCF;&#x6094;&#xFF1A;&#x300C;&#x795E;&#x554A;&#xFF0C;&#x8BF7;&#x539F;&#x8C05;&#x6211;&#x521A;&#x624D;&#x7684;&#x7F6A;&#x884C;&#x3002;&#x300D;&#xFF0C;&#x544A;&#x8BEB;&#x81EA;&#x5DF1;&#x4EE5;&#x540E;&#x4E0D;&#x4F1A;&#x518D;&#x72AF;&#x3002;</p>
<p>&#x5207;&#x65AD;&#x86CA;&#x60D1;&#x4EBA;&#x5FC3;&#x7684;&#x4E09;&#x6BD2;&#xFF1A;&#x300C;&#x4F5B;&#x6559;&#x79F0;&#x8D2A;&#xFF0C;&#x55D4;&#xFF0C;&#x75F4;&#x4E3A;&#x4EBA;&#x5FC3;&#x4E09;&#x6BD2;&#x3002;&#x8D2A;&#x5C31;&#x662F;&#x6B32;&#x671B;&#xFF0C;&#x6B32;&#x671B;&#x8FBE;&#x4E0D;&#x5230;&#x65F6;&#x5019;&#x5C31;&#x4F1A;&#x66B4;&#x6012;&#xFF0C;&#x75F4;&#x5C31;&#x662F;&#x5BF9;&#x522B;&#x4EBA;&#x7684;&#x5AC9;&#x5992;&#x4E4B;&#x5FC3;&#x3002;&#x300D;</p>
<p>&#x5174;&#x8DA3;&#x548C;&#x6E38;&#x73A9;&#x83B7;&#x5F97;&#x7684;&#x5FEB;&#x4E50;&#xFF0C;&#x53EA;&#x6709;&#x5728;&#x5145;&#x5B9E;&#x5DE5;&#x4F5C;&#x4E4B;&#x4F59;&#x624D;&#x80FD;&#x54C1;&#x5C1D;&#x3002;&#x5DE5;&#x4F5C;&#x9A6C;&#x9A6C;&#x864E;&#x864E;&#xFF0C;&#x53EA;&#x60F3;&#x5728;&#x5174;&#x8DA3;&#x548C;&#x6E38;&#x620F;&#x91CC;&#x5BFB;&#x89C5;&#x5FEB;&#x6D3B;&#xFF0C;&#x5145;&#x5176;&#x91CF;&#x53EA;&#x80FD;&#x83B7;&#x5F97;&#x4E00;&#x65F6;&#x7684;&#x5FEB;&#x611F;&#xFF0C;&#x51B3;&#x4E0D;&#x662F;&#x5C1D;&#x5230;&#x4ECE;&#x5FC3;&#x5E95;&#x6D8C;&#x51FA;&#x7684;&#x60CA;&#x559C;&#x548C;&#x5FEB;&#x4E50;&#x3002;</p>
<p>&#x91CA;&#x8FE6;&#x6469;&#x5C3C;&#x7684;&#x201C;&#x516D;&#x6CE2;&#x7F57;&#x871C;&#x201D;&#xFF1A;</p>
<ol>
<li>&#x5E03;&#x65BD;&#x3002;</li>
<li>&#x6301;&#x6212;&#x3002;</li>
<li>&#x7CBE;&#x8FDB;&#x3002;</li>
<li>&#x5FCD;&#x8FB1;&#x3002;</li>
<li>&#x7985;&#x5B9A;&#x3002;</li>
<li>&#x667A;&#x6167;&#x3002;</li>
</ol>

      
    </div>

    
      

  <div class="popular-posts-header">相关文章</div>
  <ul class="popular-posts">
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/06/28/book-thinking-about-running-md/" rel="bookmark">《当我跑步时我谈些什么》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/02/19/how-to-measure-your-life-reading-notes/" rel="bookmark">《如何衡量你的人生》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/02/03/the-art-of-stop-learn-note-md/" rel="bookmark">《止学》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/03/18/book-touchable-tidy-up-life-md/" rel="bookmark">《怦然心动的人生整理魔法》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/02/02/code-complete-2-learn-note/" rel="bookmark">《Code Complete 2》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2018/03/24/note/beauty-of-prog-note/" rel="bookmark">《编程之美》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/06/27/peopleware-reading-notes/" rel="bookmark">《人件》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/11/30/money-hacker-reading-note/" rel="bookmark">《富爸爸穷爸爸》&《小狗钱钱》读书笔记</a></div>
      
    </li>
  
  </ul>


    

    
    
    

    

    

    
      <div>
        <ul class="post-copyright">
  <li class="post-copyright-author">
    <strong>本文作者： </strong>whiledoing</li>
  <li class="post-copyright-link">
    <strong>本文链接：</strong>
    <a href="http://whiledoing.me/2016/04/01/how-to-life-learn-note/" title="《活法》读书笔记">http://whiledoing.me/2016/04/01/how-to-life-learn-note/</a>
  </li>
  <li class="post-copyright-license">
    <strong>版权声明： </strong>本博客所有文章除特别声明外，均采用 <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/" rel="external nofollow" target="_blank">CC BY-NC-SA 4.0</a> 许可协议。转载请注明出处！</li>
</ul>

      </div>
    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/读书笔记/" rel="tag"># 读书笔记</a>
          
            <a href="/tags/哲理/" rel="tag"># 哲理</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/03/24/book-liaoge-linux-course-md/" rel="next" title="《鸟哥的Linux私房菜》读书笔记">
                <i class="fa fa-chevron-left"></i> 《鸟哥的Linux私房菜》读书笔记
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/04/22/my-vim/" rel="prev" title="折腾vim">
                折腾vim <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


  </div>


          </div>
          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      

      <section class="site-overview-wrap sidebar-panel sidebar-panel-active">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <img class="site-author-image" itemprop="image"
                src="/images/avatar.jpeg"
                alt="whiledoing" />
            
              <p class="site-author-name" itemprop="name">whiledoing</p>
              <p class="site-description motion-element" itemprop="description">喜欢一切简单且美的事物，包括人。</p>
          </div>

          
            <nav class="site-state motion-element">
              
                <div class="site-state-item site-state-posts">
                
                  <a href="/archives/">
                
                    <span class="site-state-item-count">60</span>
                    <span class="site-state-item-name">日志</span>
                  </a>
                </div>
              

              

              
                
                
                <div class="site-state-item site-state-tags">
                  <a href="/tags/index.html">
                    
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                    <span class="site-state-item-count">32</span>
                    <span class="site-state-item-name">标签</span>
                  </a>
                </div>
              
            </nav>
          

          

          
            <div class="links-of-author motion-element">
              
                <span class="links-of-author-item">
                  <a href="https://github.com/whiledoing" target="_blank" title="GitHub">GitHub</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="http://www.douban.com/people/58249409" target="_blank" title="豆瓣">豆瓣</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="https://www.zhihu.com/people/whiledoing" target="_blank" title="知乎">知乎</a>
                  
                </span>
              
            </div>
          

          
          

          
          

          
            
          
          

        </div>
      </section>

      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; 2016 – <span itemprop="copyrightYear">2018</span>
  <span class="with-love" id="animate">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">whiledoing</span>

  

  
</div>




  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动 v3.7.1</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 – <a class="theme-link" target="_blank" href="https://theme-next.org">NexT.Mist</a> v6.4.0</div>




        








        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

    
      <div id="needsharebutton-float">
        <span class="btn">
          <i class="fa fa-share-alt" aria-hidden="true"></i>
        </span>
      </div>
    
	
    

    
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>
























  



  
  
    <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/reading_progress/reading_progress.js"></script>
  


  


  <script type="text/javascript" src="/js/src/utils.js?v=6.4.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=6.4.0"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=6.4.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=6.4.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=6.4.0"></script>



  



  










  





  

  

  
<script>
(function(){
    var bp = document.createElement('script');
    var curProtocol = window.location.protocol.split(':')[0];
    if (curProtocol === 'https') {
        bp.src = 'https://zz.bdstatic.com/linksubmit/push.js';        
    }
    else {
        bp.src = 'http://push.zhanzhang.baidu.com/push.js';
    }
    var s = document.getElementsByTagName("script")[0];
    s.parentNode.insertBefore(bp, s);
})();
</script>


  
  

  
  

  


  
  
  
  <script src="/lib/needsharebutton/needsharebutton.js"></script>

  <script>
    
    
      flOptions = {};
      
          flOptions.iconStyle = "box";
      
          flOptions.boxForm = "vertical";
      
          flOptions.position = "middleRight";
      
          flOptions.networks = "Weibo,Wechat,Douban,QQZone,Twitter,Facebook";
      
      new needShareButton('#needsharebutton-float', flOptions);
    
  </script>

  

  
  
  
  <script src="/lib/pangu/dist/pangu.min.js?v=3.3"></script>
  <script type="text/javascript">pangu.spacingPage();</script>


  
  <script type="text/javascript" src="/js/src/js.cookie.js?v=6.4.0"></script>
  <script type="text/javascript" src="/js/src/scroll-cookie.js?v=6.4.0"></script>


  

  

  
  <style>
    .copy-btn {
      display: inline-block;
      padding: 6px 12px;
      font-size: 13px;
      font-weight: 700;
      line-height: 20px;
      color: #333;
      white-space: nowrap;
      vertical-align: middle;
      cursor: pointer;
      background-color: #eee;
      background-image: linear-gradient(#fcfcfc, #eee);
      border: 1px solid #d5d5d5;
      border-radius: 3px;
      user-select: none;
      outline: 0;
    }

    .highlight-wrap .copy-btn {
      transition: opacity .3s ease-in-out;
      opacity: 0;
      padding: 2px 6px;
      position: absolute;
      right: 4px;
      top: 8px;
    }

    .highlight-wrap:hover .copy-btn,
    .highlight-wrap .copy-btn:focus {
      opacity: 1
    }

    .highlight-wrap {
      position: relative;
    }
  </style>
  <script>
    $('.highlight').each(function (i, e) {
      var $wrap = $('<div>').addClass('highlight-wrap')
      $(e).after($wrap)
      $wrap.append($('<button>').addClass('copy-btn').append('复制').on('click', function (e) {
        var code = $(this).parent().find('.code').find('.line').map(function (i, e) {
          return $(e).text()
        }).toArray().join('\n')
        var ta = document.createElement('textarea')
        document.body.appendChild(ta)
        ta.style.position = 'absolute'
        ta.style.top = '0px'
        ta.style.left = '0px'
        ta.value = code
        ta.select()
        ta.focus()
        var result = document.execCommand('copy')
        document.body.removeChild(ta)
        
        $(this).blur()
      })).on('mouseleave', function (e) {
        var $b = $(this).find('.copy-btn')
        setTimeout(function () {
          $b.text('复制')
        }, 300)
      }).append(e)
    })
  </script>


</body>
</html>
