<!DOCTYPE html>



  


<html class="theme-next mist use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>
<meta name="theme-color" content="#222">



  
  
    
    
  <script src="/lib/pace/pace.min.js?v=1.0.2"></script>
  <link href="/lib/pace/pace-theme-minimal.min.css?v=1.0.2" rel="stylesheet">




  
  
  <link rel="stylesheet" media="all" href="/lib/Han/dist/han.min.css?v=3.3">




<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />
















  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />







<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.3" rel="stylesheet" type="text/css" />


  <link rel="apple-touch-icon" sizes="180x180" href="/favicon.png?v=5.1.3">


  <link rel="icon" type="image/png" sizes="32x32" href="/favicon.png?v=5.1.3">


  <link rel="icon" type="image/png" sizes="16x16" href="/favicon.png?v=5.1.3">


  <link rel="mask-icon" href="/favicon.png?v=5.1.3" color="#222">





  <meta name="keywords" content="hexo, whiledoing, blog" />










<meta name="description" content="喜欢一切简单且美的事物，包括人。">
<meta property="og:type" content="website">
<meta property="og:title" content="whiledoing">
<meta property="og:url" content="http://whiledoing.github.io/index.html">
<meta property="og:site_name" content="whiledoing">
<meta property="og:description" content="喜欢一切简单且美的事物，包括人。">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="whiledoing">
<meta name="twitter:description" content="喜欢一切简单且美的事物，包括人。">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    version: '5.1.3',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":true,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://whiledoing.github.io/"/>





  <title>whiledoing</title>
  








</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left 
  page-home">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/"  class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">whiledoing</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">喜欢一切简单且美的事物，包括人。</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br />
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup search-popup local-search-popup">
  <div class="local-search-header clearfix">
    <span class="search-icon">
      <i class="fa fa-search"></i>
    </span>
    <span class="popup-btn-close">
      <i class="fa fa-times-circle"></i>
    </span>
    <div class="local-search-input-wrapper">
      <input autocomplete="off"
             placeholder="搜索..." spellcheck="false"
             type="text" id="local-search-input">
    </div>
  </div>
  <div id="local-search-result"></div>
</div>



    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            
  <section id="posts" class="posts-expand">
    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://whiledoing.github.io/2017/12/21/diary/diary-2017-12-17-SUN/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="whiledoing">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/images/avatar.jpeg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="whiledoing">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="/2017/12/21/diary/diary-2017-12-17-SUN/" itemprop="url">diary-2017-12-17-SUN</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2017-12-21T23:43:26+08:00">
                2017-12-21
              </time>
            

            
              <span class="post-meta-divider">|</span>
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-check-o"></i>
              </span>
              
                <span class="post-meta-item-text">更新于&#58;</span>
              
              <time title="更新于" itemprop="dateModified" datetime="2017-12-21T23:43:47+08:00">
                2017-12-21
              </time>
            
          </span>

          

          
            
          

          
          

          

          
            <div class="post-wordcount">
              
                
                  <span class="post-meta-divider">|</span>
                
                <span class="post-meta-item-icon">
                  <i class="fa fa-file-word-o"></i>
                </span>
                
                  <span class="post-meta-item-text">字数统计&#58;</span>
                
                <span title="字数统计">
                  1,269
                </span>
              

              

              
            </div>
          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body han-init-context" itemprop="articleBody">

      
      

      
        
          
            <p>&#x4ECA;&#x5929;&#x662F;&#x7237;&#x7237;&#x751F;&#x75C5;&#x4F4F;&#x9662;&#x7684;&#x7B2C;33&#x5929;&#x3002;</p>
<p>&#x524D;&#x51E0;&#x5929;&#x7684;&#x7ECF;&#x9A8C;&#x544A;&#x8BC9;&#x6211;&#xFF1A;&#x7237;&#x7237;&#x7684;&#x72B6;&#x6001;&#x5927;&#x7EA6;&#x662F;&#x4E00;&#x5929;&#x597D;&#xFF0C;&#x4E00;&#x5929;&#x4E0D;&#x597D;&#x3002;&#x6240;&#x4EE5;&#x6309;&#x7167;&#x89C4;&#x5F8B;&#xFF0C;&#x7237;&#x7237;&#x4ECA;&#x5929;&#x72B6;&#x6001;&#x6982;&#x7387;&#x9762;&#x4E0A;&#x4F1A;&#x4E0D;&#x592A;&#x597D;&#xFF0C;&#x6211;&#x5FC3;&#x91CC;&#x4E5F;&#x662F;&#x5E26;&#x7740;&#x62C5;&#x5FE7;&#x7684;&#x5FC3;&#x60C5;&#x53BB;&#x533B;&#x9662;&#x3002;&#x5230;&#x4E86;&#x540E;&#xFF0C;&#x62A4;&#x5DE5;&#x5E08;&#x5085;&#x544A;&#x8BC9;&#x6211;&#x6628;&#x5929;&#x591C;&#x91CC;&#x95F9;&#x5F97;&#x5B9E;&#x5728;&#x5389;&#x5BB3;&#xFF0C;&#x7ED9;&#x5403;&#x4E86;&#x5B89;&#x7720;&#x836F;&#xFF0C;&#x7761;&#x4E86;&#x7EA6;2&#x5C0F;&#x65F6;&#xFF0C; &#x540E;&#x9762;&#x4E5F;&#x7ECF;&#x5E38;&#x9192;&#xFF0C;&#x4E0D;&#x8FC7;&#x60C5;&#x7EEA;&#x8FD8;&#x597D;&#xFF0C;&#x591A;&#x662F;&#x7FFB;&#x8EAB;&#x559D;&#x6C34;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x4ED6;&#x4E5F;&#x53EF;&#x4EE5;&#x5E94;&#x4ED8;&#x7684;&#x6765;&#x3002;&#x4E4B;&#x524D;&#x7684;&#x7ECF;&#x9A8C;&#x5C31;&#x662F;&#x5403;&#x4E86;&#x5B89;&#x7720;&#x836F;&#xFF0C;&#x7B2C;&#x4E8C;&#x5929;&#x767D;&#x5929;&#x7684;&#x7CBE;&#x795E;&#x5C31;&#x4F1A;&#x5F88;&#x4E0D;&#x597D;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5631;&#x5490;&#x5E08;&#x5085;&#x4E0D;&#x662F;&#x5728;&#x7279;&#x522B;&#x60C5;&#x51B5;&#x4E0B;&#xFF08;&#x6BD4;&#x5982;&#x591C;&#x91CC;&#x95F9;&#x817E;&#x8D85;&#x8FC7;&#x4E00;&#x5C0F;&#x65F6;&#x8FD8;&#x662F;&#x5B89;&#x629A;&#x4E0D;&#x4E86;&#xFF09;&#x5C3D;&#x91CF;&#x4E0D;&#x5403;&#x5B89;&#x7720;&#x836F;&#x3002;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E5F;&#x4E0D;&#x80FD;&#x602A;&#x5E08;&#x5085;&#xFF0C;&#x591C;&#x91CC;&#x4E00;&#x76F4;&#x95F9;&#x817E;&#xFF0C;&#x522B;&#x4EBA;&#x4E5F;&#x53D7;&#x4E0D;&#x4E86;&#xFF0C;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#x62C5;&#x5FC3;&#x4ED6;&#x95F9;&#x8D77;&#x6765;&#x4E0D;&#x76D6;&#x88AB;&#x5B50;&#xFF0C;&#x611F;&#x5192;&#x53D1;&#x70E7;&#x7684;&#x8BDD;&#x5C31;&#x4F1A;&#x975E;&#x5E38;&#x9EBB;&#x70E6;&#xFF0C;&#x6240;&#x4EE5;&#x8BF4;&#x8FD9;&#x786E;&#x5B9E;&#x662F;&#x4E2A;&#x4E24;&#x96BE;&#x7684;&#x884C;&#x4E3A;&#x3002;</p>
<p>&#x4E2D;&#x5348;&#x53D1;&#x751F;&#x4E86;&#x4EF6;&#x8DA3;&#x4E8B;&#x3002;&#x6211;&#x5403;&#x4E86;&#x5348;&#x996D;&#x56DE;&#x5230;&#x75C5;&#x623F;&#xFF0C;&#x53D1;&#x73B0;&#x6211;&#x7684;&#x95E8;&#x7981;&#x5361;&#xFF08;&#x4E5F;&#x662F;&#x536B;&#x751F;&#x95F4;&#x51FA;&#x70ED;&#x6C34;&#x7684;&#x5361;&#xFF09;&#x6CA1;&#x6709;&#x4E86;&#xFF0C;&#x4ED4;&#x7EC6;&#x60F3;&#x6765;&#x6211;&#x5E94;&#x8BE5;&#x662F;&#x63D2;&#x5728;&#x536B;&#x751F;&#x95F4;&#x7684;&#x5361;&#x69FD;&#x4E0A;&#xFF0C;&#x6CA1;&#x6709;&#x62D4;&#x4E0B;&#x88AB;&#x522B;&#x4EBA;&#x62FF;&#x8D70;&#x3002;&#x524D;&#x51E0;&#x5929;&#x6700;&#x91CC;&#x9762;&#x5E8A;&#x7684;&#x62A4;&#x5DE5;&#x5E08;&#x5085;&#x4ECE;&#x536B;&#x751F;&#x95F4;&#x51FA;&#x6765;&#x5C31;&#x9887;&#x6709;&#x5FAE;&#x8BCD;&#x7684;&#x5927;&#x58F0;&#x8BF4;&#x5230;&#x300E;&#x662F;&#x8C01;&#x7F3A;&#x5FB7;&#x62FF;&#x8D70;&#x4E86;&#x70ED;&#x6C34;&#x5361;&#x300F;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x4E00;&#x8138;&#x61F5;&#x6BD4;&#x7684;&#x5E94;&#x4ED8;&#x5230;&#xFF1A;&#x6CA1;&#x6709;&#x62FF;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x8C01;&#x5E72;&#x7684;&#x3002;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x7528;&#x70ED;&#x6C34;&#x4E86;&#xFF0C;&#x6211;&#x65E9;&#x4E0A;&#x5C31;&#x5C06;&#x6211;&#x6C34;&#x5361;&#x63D2;&#x4E0A;&#x53BB;&#x4F7F;&#x7528;&#xFF0C;&#x5FD8;&#x8BB0;&#x62FF;&#x4E0B;&#x6765;&#xFF0C;&#x7ED3;&#x679C;&#x4E2D;&#x5348;&#x4E5F;&#x6CA1;&#x6709;&#x4E86;&#x3002;&#x6211;&#x4E5F;&#x5F88;&#x751F;&#x6C14;&#x7684;&#x5728;&#x623F;&#x95F4;&#x8BF4;&#x8D77;&#x6765;&#xFF0C;&#x597D;&#x7AEF;&#x7AEF;&#x7684;&#x8C01;&#x6CA1;&#x4E8B;&#x7F3A;&#x5FB7;&#x62FF;&#x5361;&#xFF01;&#x672C;&#x6765;&#x6211;&#x4EEC;&#x7167;&#x987E;&#x75C5;&#x4EBA;&#x5C31;&#x7ECF;&#x5E38;&#x9700;&#x8981;&#x7528;&#x6C34;&#xFF0C;&#x6BCF;&#x6B21;&#x63D2;&#x62D4;&#x592A;&#x5F71;&#x54CD;&#x6548;&#x7387;&#xFF0C;&#x5C31;&#x4E00;&#x76F4;&#x63D2;&#x7740;&#xFF0C;&#x8C01;&#x60F3;&#x5230;&#x88AB;&#x522B;&#x4EBA;&#x5077;&#x4E86;&#x3002;&#x6211;&#x76F4;&#x63A5;&#x6253;&#x4E86;110&#xFF0C;&#x6298;&#x817E;&#x4E86;&#x51E0;&#x756A;&#x529F;&#x592B;&#x4E4B;&#x540E;&#xFF0C;&#x7EC8;&#x4E8E;&#x5F97;&#x5230;&#x4E86;&#x770B;&#x533B;&#x9662;&#x76D1;&#x63A7;&#x7684;&#x6743;&#x9650;&#x3002;&#x6211;&#x548C;&#x8B66;&#x5BDF;&#x53D4;&#x53D4;&#x8BF4;&#xFF0C;&#x6211;&#x627E;&#x8FD9;&#x4E2A;&#x6C34;&#x5361;&#x4E0D;&#x4E3A;&#x5565;&#xFF0C;&#x8FD9;&#x672C;&#x8EAB;&#x4E5F;&#x6CA1;&#x6709;&#x591A;&#x5C11;&#x94B1;&#xFF0C;&#x5C31;&#x662F;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x8BA9;&#x6211;&#x6076;&#x5FC3;&#xFF0C;&#x8C01;tmd&#x7F3A;&#x5FB7;&#x5077;&#x75C5;&#x623F;&#x7684;&#x6C34;&#x5361;&#x3002;&#xFF08;&#x8BB2;&#x771F;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x77E5;&#x9053;&#x8C03;&#x770B;&#x76D1;&#x63A7;&#x9700;&#x8981;&#x5982;&#x6B64;&#x590D;&#x6742;&#x7684;&#x624B;&#x7EED;&#x6D41;&#x7A0B;&#xFF0C;&#x6211;&#x53EF;&#x80FD;&#x4E5F;&#x5C31;&#x4E0D;&#x6298;&#x817E;&#x4E86;&#x3002;&#x3002;&#xFF09;&#x3002;&#x5728;&#x8B66;&#x5BDF;&#x540C;&#x5FD7;&#x7684;&#x5E26;&#x9886;&#x4E0B;&#xFF0C;&#x6211;&#x8FDB;&#x5165;&#x533B;&#x9662;&#x7684;&#x76D1;&#x63A7;&#x623F;&#x95F4;&#xFF0C;&#x5728;&#x7B7E;&#x4E86;&#x4E00;&#x5806;&#x624B;&#x7EED;&#x540E;&#xFF0C;&#x624D;&#x8C03;&#x51FA;&#x4E86;&#x4E2D;&#x5348;&#x65F6;&#x6BB5;&#x7684;&#x8D70;&#x5ECA;&#x76D1;&#x63A7;&#x3002;&#x7ED3;&#x679C;&#x662F;&#xFF0C;&#x6211;&#x770B;&#x4E86;&#x4E00;&#x4E2A;&#x4E2D;&#x5348;&#xFF0C;&#x7EA6;3&#x5C0F;&#x65F6;&#x957F;&#x7684;&#x76D1;&#x63A7;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x53D1;&#x73B0;&#x5916;&#x4EBA;&#xFF08;&#x4E0D;&#x662F;&#x6211;&#x4EEC;&#x623F;&#x95F4;&#x7684;&#x75C5;&#x4EBA;&#xFF0C;&#x5BB6;&#x5C5E;&#xFF0C;&#x62A4;&#x5DE5;&#xFF09;&#x8FDB;&#x51FA;&#x3002;&#x5F53;&#x65F6;&#x6211;&#x5C31;&#x60F3;&#x5F88;&#x53EF;&#x80FD;&#x662F;&#x4E4B;&#x524D;&#x6389;&#x5361;&#x7684;&#x62A4;&#x5DE5;&#x62FF;&#x4E86;&#x6211;&#x7684;&#x5361;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x81EA;&#x5DF1;&#x6389;&#x4E86;&#x5361;&#xFF0C;&#x7528;&#x6211;&#x7684;&#x5361;&#x6765;&#x9876;&#x3002;&#x4E0D;&#x8FC7;&#x540E;&#x60F3;&#xFF0C;&#x4E00;&#x662F;&#x53EA;&#x662F;&#x6211;&#x4E2A;&#x4EBA;&#x731C;&#x6D4B;&#xFF1B;&#x4E8C;&#x662F;&#x5373;&#x4FBF;&#x5982;&#x6B64;&#xFF0C;&#x8FD9;&#x4E8B;&#x60C5;&#x4E5F;&#x6CA1;&#x5FC5;&#x8981;&#x641E;&#x50F5;&#xFF0C;&#x6BD5;&#x7ADF;&#x5728;&#x4E00;&#x4E2A;&#x75C5;&#x623F;&#xFF0C;&#x8865;&#x4E00;&#x5F20;&#x5361;&#x4E5F;&#x5C31;&#x4E94;&#x5341;&#x5143;&#x94B1;&#xFF0C;&#x6CA1;&#x5FC5;&#x8981;&#x4E3A;&#x6B64;&#x4F24;&#x4E86;&#x548C;&#x6C14;&#x3002;&#x4E0B;&#x5348;&#x6211;&#x76F4;&#x63A5;&#x53BB;&#x8865;&#x529E;&#x4E86;&#x4E00;&#x5F20;&#x5361;&#xFF0C;&#x4E5F;&#x6CA1;&#x548C;&#x540C;&#x75C5;&#x623F;&#x7684;&#x4EBA;&#x8BF4;&#x66F4;&#x591A;&#x7EC6;&#x8282;&#xFF0C;&#x5C31;&#x5C06;&#x8FD9;&#x4E8B;&#x7565;&#x8FC7;&#x4E86;&#x3002;&#x597D;&#x73A9;&#x7684;&#x662F;&#xFF0C;&#x5F53;&#x665A;&#x4E0A;&#x6211;&#x5C06;&#x65B0;&#x529E;&#x7684;&#x5361;&#x4EA4;&#x7ED9;&#x6211;&#x4EEC;&#x62A4;&#x5DE5;&#x91D1;&#x5E08;&#x5085;&#x7528;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x987A;&#x7740;&#x65E9;&#x4E0A;&#x5077;&#x5361;&#x7684;&#x4E8B;&#x60C5;&#x591A;&#x8BF4;&#x4E86;&#x51E0;&#x53E5;&#xFF0C;&#x800C;&#x4E5F;&#x5C31;&#x5728;&#x540C;&#x65F6;&#xFF0C;&#x6700;&#x53F3;&#x8FB9;&#x5E8A;&#x4F4D;&#x7684;&#x62A4;&#x5DE5;&#x5E08;&#x5085;&#x8DF3;&#x4E86;&#x51FA;&#x6765;&#xFF0C;&#x9887;&#x6709;&#x4E9B;&#x6FC0;&#x52A8;&#x7684;&#x4E5F;&#x987A;&#x7740;&#x8BF4;&#x4E86;&#x51E0;&#x53E5;&#xFF0C;&#x9887;&#x6709;&#x4E9B;&#x300C;&#x6B64;&#x5730;&#x65E0;&#x94F6;&#x4E09;&#x767E;&#x4E24;&#x300D;&#x7684;&#x610F;&#x601D;&#xFF0C;&#x60F3;&#x6765;&#xFF0C;&#x5341;&#x6709;&#x516B;&#x4E5D;&#xFF0C;&#x987F;&#x89C9;&#x6709;&#x8DA3;&#x3002;</p>
<p>&#x5468;&#x672B;&#x6674;&#x6717;&#x7684;&#x5929;&#x6C14;&#x5F97;&#x5230;&#x4E86;&#x5EF6;&#x7EED;&#xFF0C;&#x4E0B;&#x5348;&#x6211;&#x4EEC;&#x8FD8;&#x5C06;&#x7237;&#x7237;&#x63A8;&#x5230;&#x4E86;&#x5927;&#x5385;&#x9633;&#x5149;&#x597D;&#x7684;&#x5730;&#x65B9;&#x5750;&#x5750;&#x3002;&#x4E0B;&#x5348;&#x6211;&#x53BB;&#x8865;&#x529E;&#x5361;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E8C;&#x7237;&#x548C;&#x4E8C;&#x5A76;&#x8FC7;&#x6765;&#x4E86;&#x3002;&#x6211;&#x548C;&#x4E8C;&#x7237;&#x4E24;&#x4E2A;&#x4EBA;&#x4E00;&#x4EBA;&#x4E00;&#x53E5;&#x7684;&#x5E94;&#x5BF9;&#x7740;&#x7237;&#x7237;&#x8BF4;&#x4E0D;&#x6E05;&#x695A;&#x7684;&#x8BDD;&#x8BED;&#xFF1A;&#x867D;&#x7136;&#x4E0D;&#x61C2;&#x4ED6;&#x7684;&#x8BDD;&#xFF0C;&#x4F46;&#x662F;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x4ED6;&#x8BF4;&#x8BDD;&#x7684;&#x60C5;&#x7EEA;&#x731C;&#x6D4B;&#x7237;&#x7237;&#x8BF4;&#x8BDD;&#x7684;&#x8BED;&#x6C14;&#xFF0C;&#x7136;&#x540E;&#x8FDB;&#x884C;&#x7C7B;&#x4F3C;&#x4E8E;&#x300C;&#x5965;&#x3002;&#x771F;&#x7684;&#x554A;&#x3002;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x7684;&#x4E8B;&#x60C5;&#x554A;&#x3002;&#x6CA1;&#x95EE;&#x9898;&#x300D;&#x4E4B;&#x7C7B;&#x4E07;&#x80FD;&#x7684;&#x642D;&#x8BDD;&#x8BCD;&#x3002;&#x540E;&#x6765;&#x7237;&#x7237;&#x7A81;&#x7136;&#x795E;&#x60C5;&#x6FC0;&#x52A8;&#x7684;&#x8BF4;&#x8981;&#x7AD9;&#x8D77;&#x6765;&#x8BD5;&#x8BD5;&#xFF0C;&#x6211;&#x4EEC;&#x62DB;&#x67B6;&#x4E0D;&#x4F4F;&#xFF0C;&#x5C31;&#x591A;&#x4EBA;&#x914D;&#x5408;&#x5C06;&#x8001;&#x7237;&#x5B50;&#x6400;&#x6276;&#x7740;&#x7AD9;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x53EA;&#x662F;&#x6CA1;&#x7AD9;&#x591A;&#x4E45;&#xFF0C;&#x5927;&#x5BB6;&#x5C31;&#x6491;&#x4E0D;&#x4F4F;&#x529B;&#x6C14;&#x53C8;&#x8BA9;&#x4ED6;&#x5750;&#x4E86;&#x4E0B;&#x53BB;&#x3002;&#x540E;&#x6765;&#x60F3;&#x5230;&#x4E00;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x6298;&#x4E2D;&#x65B9;&#x6848;&#xFF1A;&#x5C06;&#x7237;&#x7237;&#x8F6E;&#x6905;&#x63A8;&#x5230;&#x9760;&#x5899;&#x6709;&#x6276;&#x624B;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x8BA9;&#x7237;&#x7237;&#x81EA;&#x5DF1;&#x5DE6;&#x624B;&#x6293;&#x4F4F;&#x6276;&#x624B;&#xFF0C;&#x5750;&#x5728;&#x8F6E;&#x6905;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5176;&#x540E;&#x80CC;&#x9876;&#x4F4F;&#xFF0C;&#x633A;&#x8D77;&#x6210;&#x5750;&#x7ACB;&#x6001;&#xFF0C;&#x7237;&#x7237;&#x4E5F;&#x5C31;&#x4E0D;&#x518D;&#x95F9;&#x817E;&#x3002;</p>
<p>&#x4ECA;&#x5929;&#x72B6;&#x6001;&#x603B;&#x7684;&#x8BF4;&#x6765;&#x5EF6;&#x7EED;&#x4E86;&#x4E00;&#x5929;&#x597D;&#x4E00;&#x5929;&#x4E0D;&#x597D;&#x7684;&#x89C4;&#x5F8B;&#x3002;&#x665A;&#x4E0A;&#x4E00;&#x76F4;&#x4E0D;&#x80AF;&#x5403;&#x996D;&#xFF0C;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x53EA;&#x80FD;&#x8BA9;&#x4ED6;&#x5148;&#x7761;&#x89C9;&#x3002;&#x8FD8;&#x597D;&#x665A;&#x4E0A;&#x5A9B;&#x5A9B;&#x59B9;&#x59B9;&#x8FC7;&#x6765;&#x5E2E;&#x5FD9;&#xFF0C;&#x8BA9;&#x6211;&#x8F7B;&#x677E;&#x4E86;&#x4E0D;&#x5C11;&#x3002;&#x665A;&#x4E0A;8&#x70B9;&#x534A;&#x5DE6;&#x53F3;&#xFF0C;&#x6211;&#x548C;&#x59B9;&#x59B9;&#x4E24;&#x4EBA;&#x5408;&#x4F5C;&#xFF0C;&#x4E00;&#x4E2A;&#x60F3;&#x529E;&#x6CD5;&#x5F04;&#x9192;&#x7237;&#x7237;&#xFF0C;&#x4E00;&#x4E2A;&#x51C6;&#x5907;&#x70ED;&#x83DC;&#xFF0C;&#x6C34;&#xFF0C;&#x8425;&#x517B;&#x6DB2;&#x7B49;&#x5582;&#x98DF;&#x7269;&#x4EF6;&#x3002;&#x7EC8;&#x4E8E;&#x5728;&#x78E8;&#x4E86;&#x4E00;&#x4E2A;&#x591A;&#x5C0F;&#x65F6;&#x540E;&#xFF0C;&#x5C06;400ml&#x7684;&#x5582;&#x98DF;&#x91CF;&#x7ED9;&#x5B8C;&#x6210;&#x4E86;&#x3002;</p>
<p>&#x53C8;&#x53CA;&#xFF0C;&#x5A9B;&#x5A9B;&#x59B9;&#x59B9;&#x665A;&#x4E0A;&#x8FC7;&#x6765;&#x5E2E;&#x6211;&#x5582;&#x7237;&#x7237;&#xFF1A;</p>
<p><img src="http://static.zybuluo.com/whiledoing/s7hogqmjuefvogr2kstbvb60/image_1c1srt7abus28m17be1vvt17ji9.png" alt="image_1c1srt7abus28m17be1vvt17ji9.png-1053.7kB"></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://whiledoing.github.io/2017/12/21/diary/diary-2017-12-16-SAT/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="whiledoing">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/images/avatar.jpeg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="whiledoing">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="/2017/12/21/diary/diary-2017-12-16-SAT/" itemprop="url">diary-2017-12-16-SAT.md</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2017-12-21T23:42:29+08:00">
                2017-12-21
              </time>
            

            
              <span class="post-meta-divider">|</span>
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-check-o"></i>
              </span>
              
                <span class="post-meta-item-text">更新于&#58;</span>
              
              <time title="更新于" itemprop="dateModified" datetime="2017-12-21T23:47:49+08:00">
                2017-12-21
              </time>
            
          </span>

          

          
            
          

          
          

          

          
            <div class="post-wordcount">
              
                
                  <span class="post-meta-divider">|</span>
                
                <span class="post-meta-item-icon">
                  <i class="fa fa-file-word-o"></i>
                </span>
                
                  <span class="post-meta-item-text">字数统计&#58;</span>
                
                <span title="字数统计">
                  582
                </span>
              

              

              
            </div>
          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body han-init-context" itemprop="articleBody">

      
      

      
        
          
            <p>&#x4ECA;&#x5929;&#x662F;&#x7237;&#x7237;&#x751F;&#x75C5;&#x4F4F;&#x9662;&#x7684;&#x7B2C;32&#x5929;&#x3002;</p>
<p>&#x4ECA;&#x5929;&#x5468;&#x516D;&#xFF0C;&#x5EB7;&#x590D;&#x6CBB;&#x7597;&#x7684;&#x9879;&#x76EE;&#x5E76;&#x4E0D;&#x591A;&#xFF0C;&#x533B;&#x751F;&#x4E5F;&#x591A;&#x6570;&#x8F6E;&#x4F11;&#x3002;&#x65E9;&#x4E0A;&#x5230;&#x4E86;&#x533B;&#x9662;&#xFF0C;&#x5582;&#x4E86;&#x7237;&#x7237;&#x65E9;&#x996D;&#x540E;&#x6CA1;&#x591A;&#x4E45;&#xFF0C;&#x533B;&#x751F;&#x63A8;&#x6765;&#x7C7B;&#x4F3C;VR&#x7684;&#x6CBB;&#x7597;&#x8BBE;&#x5907;&#xFF0C;&#x539F;&#x6211;&#x4EE5;&#x4E3A;&#x662F;&#x7528;&#x6765;&#x8BAD;&#x7EC3;&#x8001;&#x7237;&#x5B50;&#x667A;&#x529B;&#x53CD;&#x5E94;&#x6C34;&#x5E73;&#x7684;&#x8BBE;&#x5907;&#xFF0C;&#x7ED3;&#x679C;&#x4E00;&#x95EE;&#x624D;&#x77E5;&#x9053;&#x662F;&#x7528;&#x6765;&#x8BAD;&#x7EC3;&#x8A00;&#x8BED;&#x529F;&#x80FD;&#x7684;&#x5E8A;&#x7528;&#x663E;&#x793A;&#x5668;&#x3002;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x7C7B;&#x4F3C;&#x4E8E;&#x5C0F;&#x670B;&#x53CB;&#x5B66;&#x5B57;&#x8BF4;&#x5B57;&#xFF1A;&#x5148;&#x662F;&#x5728;&#x5589;&#x5499;&#x4E0A;&#x63D2;&#x4E0A;&#x7535;&#x6781;&#x7247;&#xFF0C;&#x7535;&#x51FB;&#x523A;&#x6FC0;&#x8A00;&#x8BED;&#x529F;&#x80FD;&#x76F8;&#x5173;&#x7684;&#x5927;&#x8111;&#x533A;&#x57DF;&#xFF1B;&#x540C;&#x65F6;VR&#x773C;&#x775B;&#x4E2D;&#x663E;&#x793A;&#x76F8;&#x5173;&#x8BCD;&#x8BED;&#x548C;&#x753B;&#x9762;&#xFF0C;&#x8033;&#x673A;&#x4E2D;&#x64AD;&#x653E;&#x5BF9;&#x5E94;&#x58F0;&#x97F3;&#x3002;&#x63A5;&#x5165;&#x8BBE;&#x5907;&#x540E;&#xFF0C;&#x4E4B;&#x524D;&#x7761;&#x5F97;&#x6DF1;&#x6C89;&#x7684;&#x7237;&#x7237;&#x51FA;&#x4E4E;&#x610F;&#x6599;&#x7684;&#x7CBE;&#x795E;&#x96C6;&#x4E2D;&#x8D77;&#x6765;&#xFF0C;&#x5634;&#x4E2D;&#x4E5F;&#x9690;&#x7EA6;&#x53D1;&#x51FA;&#x5B66;&#x7740;&#x8BB2;&#x8BDD;&#x7684;&#x58F0;&#x97F3;&#x3002;&#x867D;&#x7136;&#x4ED6;&#x8BF4;&#x7684;&#x6211;&#x57FA;&#x672C;&#x542C;&#x4E0D;&#x61C2;&#xFF0C;&#x4F46;&#x6211;&#x80FD;&#x611F;&#x89C9;&#x5230;&#x4ED6;&#x7684;&#x8BED;&#x97F3;&#x8BED;&#x8C03;&#x50CF;&#x662F;&#x5728;&#x8DDF;&#x8BFB;&#xFF0C;&#x770B;&#x6765;&#x7535;&#x523A;&#x6FC0;&#x8FD8;&#x662F;&#x5F88;&#x6709;&#x6548;&#x679C;&#x7684;&#x3002;</p>
<p>&#x4ECA;&#x5929;&#x5929;&#x6C14;&#x521A;&#x597D;&#x4E0D;&#x9519;&#xFF0C;&#x4E0B;&#x5348;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x6CBB;&#x7597;&#x9879;&#x76EE;&#xFF0C;&#x6211;&#x548C;&#x5976;&#x5976;&#x5C31;&#x6309;&#x7167;&#x4E4B;&#x524D;&#x6D3B;&#x52A8;&#x7684;&#x65F6;&#x95F4;&#x63A8;&#x7740;&#x8001;&#x7237;&#x5B50;&#x5230;&#x5927;&#x5385;&#x6709;&#x9633;&#x5149;&#x7684;&#x5730;&#x65B9;&#x6652;&#x6652;&#x592A;&#x9633;&#x3002;&#x7237;&#x7237;&#x4ECA;&#x5929;&#x72B6;&#x6001;&#x5C31;&#x548C;&#x5929;&#x6C14;&#x4E00;&#x6837;&#xFF0C;&#x663E;&#x5F97;&#x975E;&#x5E38;&#x300C;&#x6674;&#x6717;&#x300D;&#xFF1A;&#x4E0D;&#x4EC5;&#x5403;&#x996D;&#x5403;&#x7684;&#x5F88;&#x7ED9;&#x529B;&#xFF0C;&#x8BDD;&#x4E5F;&#x8BF4;&#x7684;&#x7279;&#x522B;&#x591A;&#xFF0C;&#x663E;&#x5F97;&#x5F88;&#x662F;&#x7CBE;&#x795E;&#x3002;&#x6652;&#x592A;&#x9633;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7237;&#x7237;&#x4E00;&#x76F4;&#x5728;&#x91CD;&#x590D;&#x8BF4;&#x4E9B;&#x53D1;&#x97F3;&#x542C;&#x8D77;&#x6765;&#x50CF;&#x300C;&#x4E09;&#x4E07;&#x5143;&#x94B1;&#x300D;&#x7684;&#x53EA;&#x8A00;&#x7247;&#x8BED;&#xFF0C;&#x6211;&#x548C;&#x5976;&#x5976;&#x731C;&#x6D4B;&#x7237;&#x7237;&#x5E94;&#x8BE5;&#x662F;&#x5728;&#x8BF4;&#x4ED6;&#x4E4B;&#x524D;&#x6454;&#x5012;&#x82B1;&#x8D39;&#x7684;&#x4E09;&#x4E07;&#x5143;&#x94B1;&#x6CBB;&#x7597;&#x8D39;&#x7528;&#x3002;&#x7237;&#x7237;&#x4ED6;&#x662F;&#x90A3;&#x79CD;&#x4E00;&#x8F88;&#x5B50;&#x5403;&#x4E86;&#x5F88;&#x591A;&#x82E6;&#xFF0C;&#x82B1;&#x94B1;&#x7279;&#x522B;&#x8282;&#x4FED;&#x7684;&#x4EBA;&#x3002;&#x6216;&#x8005;&#x66F4;&#x786E;&#x5207;&#x7684;&#x8BF4;&#x4ED6;&#x662F;&#x90A3;&#x79CD;&#x5BF9;&#x522B;&#x4EBA;&#x7279;&#x522B;&#x6177;&#x6168;&#xFF0C;&#x5374;&#x5BF9;&#x81EA;&#x5DF1;&#x7279;&#x522B;&#x541D;&#x556C;&#x7684;&#x4EBA;&#x3002;&#x6211;&#x5F53;&#x65F6;&#x5C31;&#x7B11;&#x7740;&#x544A;&#x8BC9;&#x7237;&#x7237;&#xFF1A;&#x300E;&#x7237;&#x7237;&#x4F60;&#x653E;&#x5FC3;&#xFF0C;&#x94B1;&#x90FD;&#x62A5;&#x9500;&#x4E86;&#xFF0C;&#x4E00;&#x5206;&#x4E0D;&#x5C11;&#x300F;&#xFF0C;&#x4ED6;&#x8C8C;&#x4F3C;&#x7406;&#x89E3;&#x4E86;&#x6211;&#x7684;&#x8BDD;&#x8BED;&#xFF0C;&#x56DE;&#x4E86;&#x4E00;&#x53E5;&#x300E;&#x771F;&#x5047;&#x7684;&#xFF1F;&#x300F;&#x3002;&#x6211;&#x7528;&#x66F4;&#x5927;&#x7684;&#x8BED;&#x8C03;&#x544A;&#x8BC9;&#x4ED6;&#xFF1A;&#x300E;&#x5F53;&#x7136;&#x771F;&#x7684;&#xFF0C;&#x94B1;&#x90FD;&#x5230;&#x6211;&#x5361;&#x4E0A;&#x4E86;&#xFF0C;&#x4F60;&#x653E;&#x5FC3;&#xFF0C;&#x90FD;&#x62A5;&#x9500;&#x4E86;&#x300F;&#x3002;&#x300E;&#x54C8;&#x54C8;&#x54C8;&#x300F;&#x7237;&#x7237;&#x975E;&#x5E38;&#x5927;&#x58F0;&#x7684;&#x7B11;&#x4E86;&#x51FA;&#x6765;&#xFF0C;&#x5976;&#x5976;&#x4E5F;&#x5E94;&#x58F0;&#x800C;&#x7B11;&#xFF0C;&#x8BF4;&#x4E86;&#x53E5;&#x300E;&#x4F60;&#x8FD9;&#x4E2A;&#x8001;&#x8D22;&#x8FF7;&#x300F;&#x3002;&#x7237;&#x7237;&#x7684;&#x8BA4;&#x77E5;&#x529F;&#x80FD;&#x611F;&#x89C9;&#x771F;&#x7684;&#x662F;&#x4E00;&#x5929;&#x6BD4;&#x4E00;&#x5929;&#x597D;&#xFF0C;&#x8FD9;&#x8BA9;&#x6211;&#x4EEC;&#x90FD;&#x975E;&#x5E38;&#x5F00;&#x5FC3;&#x3002;</p>
<p>&#x53C8;&#x53CA;&#xFF0C;&#x7237;&#x7237;&#x505A;&#x8A00;&#x8BED;&#x6CBB;&#x7597;&#xFF1A;</p>
<p><img src="http://static.zybuluo.com/whiledoing/5r3nab3vomqwtbnwno8qpvp5/image_1c1srrfgh1ncvbrgfoo1vuav4k9.png" alt="image_1c1srrfgh1ncvbrgfoo1vuav4k9.png-1224kB"></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://whiledoing.github.io/2017/12/21/diary/diary-2017-12-15-FRI/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="whiledoing">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/images/avatar.jpeg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="whiledoing">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="/2017/12/21/diary/diary-2017-12-15-FRI/" itemprop="url">diary-2017-12-15-FRI</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2017-12-21T23:41:03+08:00">
                2017-12-21
              </time>
            

            
              <span class="post-meta-divider">|</span>
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-check-o"></i>
              </span>
              
                <span class="post-meta-item-text">更新于&#58;</span>
              
              <time title="更新于" itemprop="dateModified" datetime="2017-12-21T23:41:41+08:00">
                2017-12-21
              </time>
            
          </span>

          

          
            
          

          
          

          

          
            <div class="post-wordcount">
              
                
                  <span class="post-meta-divider">|</span>
                
                <span class="post-meta-item-icon">
                  <i class="fa fa-file-word-o"></i>
                </span>
                
                  <span class="post-meta-item-text">字数统计&#58;</span>
                
                <span title="字数统计">
                  833
                </span>
              

              

              
            </div>
          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body han-init-context" itemprop="articleBody">

      
      

      
        
          
            <p>&#x4ECA;&#x5929;&#x662F;&#x7237;&#x7237;&#x751F;&#x75C5;&#x4F4F;&#x9662;&#x7684;&#x7B2C;31&#x5929;&#x3002;</p>
<p>&#x65E9;&#x4E0A;&#x672C;&#x8BF4;&#x597D;&#x59D1;&#x59D1;&#x9001;&#x6211;&#x53BB;&#x533B;&#x9662;&#xFF0C;&#x4F46;&#x59D1;&#x59D1;&#x8D77;&#x6765;&#x53EB;&#x6211;&#x65F6;&#x5019;&#xFF0C;&#x7740;&#x5B9E;&#x662F;&#x6709;&#x4E9B;&#x7D2F;&#xFF0C;&#x52A0;&#x4E4B;&#x6628;&#x5929;&#x56DE;&#x53BB;&#x76F4;&#x63A5;&#x7761;&#x89C9;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x6D17;&#x6FA1;&#xFF0C;&#x5168;&#x8EAB;&#x9ECF;&#x7CCA;&#xFF0C;&#x5C31;&#x544A;&#x8BC9;&#x59D1;&#x591A;&#x7761;&#x4F1A;&#xFF0C;&#x8FC7;&#x4F1A;&#x518D;&#x6D17;&#x4E2A;&#x6FA1;&#x51FA;&#x53D1;&#x3002;&#x5012;&#x4E5F;&#x6CA1;&#x591A;&#x7761;&#x591A;&#x4E45;&#xFF0C;&#x6D17;&#x4E86;&#x4E2A;&#x6FA1;&#xFF0C;&#x5403;&#x8FC7;&#x65E9;&#x70B9;&#xFF0C;&#x5C31;&#x51FA;&#x95E8;&#xFF0C;&#x53EA;&#x662F;&#x4E0D;&#x77E5;&#x9053;&#x65E9;&#x4E0A;&#x7ADF;&#x4E0B;&#x5927;&#x96E8;&#xFF0C;&#x597D;&#x4E0D;&#x5BB9;&#x6613;&#x53EB;&#x5230;&#x4E86;&#x8F66;&#xFF0C;&#x4E00;&#x8DEF;&#x4E0A;&#x53C8;&#x662F;&#x5404;&#x79CD;&#x62E5;&#x5835;&#xFF0C;&#x5230;&#x533B;&#x9662;&#x95E8;&#x53E3;&#x65F6;&#xFF0C;&#x5DF2;&#x7ECF;8&#x70B9;20&#x3002;&#x5C31;&#x5728;&#x8FD9;&#x65F6;&#xFF0C;&#x91D1;&#x5E08;&#x5085;&#x7ED9;&#x6211;&#x6253;&#x4E86;&#x7535;&#x8BDD;&#xFF0C;&#x8BF4;&#x8001;&#x7237;&#x5B50;&#x60C5;&#x7EEA;&#x5F88;&#x7126;&#x8E81;&#xFF0C;&#x7529;&#x6795;&#x5934;&#xFF0C;&#x4E0D;&#x76D6;&#x88AB;&#x5B50;&#xFF0C;&#x95EE;&#x6211;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x6211;&#x544A;&#x8BC9;&#x4ED6;&#x60F3;&#x529E;&#x6CD5;&#x5B89;&#x629A;&#x8001;&#x7237;&#x5B50;&#x60C5;&#x7EEA;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x76D6;&#x88AB;&#x5B50;&#x987A;&#x7740;&#x4ED6;&#x610F;&#x601D;&#x4E0D;&#x76D6;&#xFF0C;&#x8FC7;&#x4F1A;&#x518D;&#x5077;&#x5077;&#x634E;&#x4E0A;&#x3002;&#x6302;&#x4E86;&#x7535;&#x8BDD;&#xFF0C;&#x6211;&#x4E5F;&#x52A0;&#x5FEB;&#x4E86;&#x811A;&#x6B65;&#xFF0C;&#x5FC3;&#x91CC;&#x4E5F;&#x6709;&#x4E9B;&#x62C5;&#x5FC3;&#x8D77;&#x6765;&#x3002;&#x5E08;&#x5085;&#x544A;&#x8BC9;&#x6211;&#xFF0C;&#x4ED6;&#x662F;&#x62C5;&#x5FC3;&#x8001;&#x7237;&#x5B50;&#x4E00;&#x76F4;&#x4E0D;&#x76D6;&#x88AB;&#x5B50;&#x53D7;&#x51C9;&#xFF0C;&#x8FDB;&#x800C;&#x62C5;&#x5FC3;&#x6211;&#x4EEC;&#x8BF4;&#x4ED6;&#x6CA1;&#x6709;&#x7167;&#x987E;&#x597D;&#x3002;&#x60F3;&#x6765;&#xFF0C;&#x8FD9;&#x4E2A;&#x5E08;&#x5085;&#x771F;&#x5FC3;&#x4E0D;&#x9519;&#x3002;</p>
<p>&#x4E0B;&#x5348;2&#x70B9;&#x6709;&#x8A00;&#x8BED;&#x6CBB;&#x7597;&#x9879;&#x76EE;&#xFF0C;&#x4F46;&#x5FEB;&#x5230;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7237;&#x7237;&#x8FD8;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x8461;&#x8404;&#x7CD6;&#x6CA1;&#x6302;&#x5B8C;&#xFF0C;&#x8FD9;&#x74F6;500ml&#x7684;&#x8461;&#x8404;&#x7CD6;&#x662F;&#x4ECA;&#x5929;&#x521A;&#x52A0;&#x7684;&#xFF0C;&#x6709;&#x4E9B;&#x63AA;&#x4E0D;&#x53CA;&#x9632;&#xFF0C;&#x6302;&#x4E86;&#x4E00;&#x4E2A;&#x4E2D;&#x5348;&#x8FD8;&#x6CA1;&#x6709;&#x6302;&#x5B8C;&#x3002;&#x6CA1;&#x529E;&#x6CD5;&#xFF0C;&#x53EA;&#x80FD;&#x8BA9;&#x62A4;&#x58EB;&#x6682;&#x505C;&#x4E0B;&#xFF08;&#x7B2C;&#x4E00;&#x6B21;&#x77E5;&#x9053;&#x6302;&#x6C34;&#x771F;&#x7684;&#x53EF;&#x4EE5;&#x6682;&#x505C;&#xFF0C;&#x53EA;&#x662F;&#x836F;&#x6C34;&#x62C6;&#x5F00;&#x540E;&#x4E0D;&#x80FD;&#x95F4;&#x9694;&#x592A;&#x4E45;&#xFF0C;&#x5426;&#x5219;&#x4F1A;&#x5931;&#x6548;&#xFF09;&#x3002;&#x7ED9;&#x7237;&#x7237;&#x7A7F;&#x597D;&#x8863;&#x670D;&#xFF0C;&#x5E26;&#x597D;&#x80A9;&#x7AE0;&#x5E26;&#xFF0C;&#x51C6;&#x5907;&#x597D;&#x8A00;&#x8BED;&#x6CBB;&#x7597;&#x9700;&#x8981;&#x7684;&#x5404;&#x79CD;&#x6750;&#x6599;&#xFF0C;&#x4F34;&#x7740;&#x6CBB;&#x7597;&#x533B;&#x751F;&#x7684;&#x50AC;&#x4FC3;&#x58F0;&#xFF0C;&#x6211;&#x4EEC;&#x5306;&#x5FD9;&#x5730;&#x63A8;&#x7740;&#x7237;&#x7237;&#x8FDB;&#x5165;&#x4E86;&#x6CBB;&#x7597;&#x5BA4;&#x3002;&#x5728;&#x533B;&#x9662;&#x770B;&#x62A4;&#xFF0C;&#x7167;&#x987E;&#xFF0C;&#x5B89;&#x6392;&#x9879;&#x76EE;&#x5C31;&#x548C;&#x6253;&#x4ED7;&#x4E00;&#x6837;&#xFF0C;&#x6BCF;&#x5206;&#x949F;&#x90FD;&#x5728;&#x8BA1;&#x7B97;&#xFF0C;&#x9700;&#x8981;&#x63D0;&#x524D;&#x89C4;&#x5212;&#x548C;&#x534F;&#x8C03;&#xFF0C;&#x867D;&#x6709;&#x4E9B;&#x8F9B;&#x82E6;&#xFF0C;&#x4F46;&#x7EC6;&#x60F3;&#x6765;&#x4E5F;&#x633A;&#x6709;&#x610F;&#x601D;&#x3002;</p>
<p>&#x521A;&#x60F3;&#x8D81;&#x7740;&#x7237;&#x7237;&#x8FDB;&#x5165;&#x6CBB;&#x7597;&#x5BA4;&#x7684;&#x65F6;&#x5019;&#x4F11;&#x606F;&#x4F1A;&#xFF0C;&#x6CBB;&#x7597;&#x533B;&#x751F;&#x5C31;&#x548C;&#x62A4;&#x5DE5;&#x5E08;&#x5085;&#x4E00;&#x8D77;&#x63A8;&#x7740;&#x7237;&#x7237;&#x56DE;&#x6765;&#x4E86;&#x3002;&#x533B;&#x751F;&#x53CD;&#x9988;&#x7237;&#x7237;&#x8981;&#x5C0F;&#x4FBF;&#xFF0C;&#x795E;&#x60C5;&#x4E5F;&#x7565;&#x6FC0;&#x52A8;&#x3002;&#x4F46;&#x7237;&#x7237;&#x7528;&#x4E86;&#x5BFC;&#x5C3F;&#x7BA1;&#xFF0C;&#x600E;&#x4E48;&#x4F1A;&#x662F;&#x5C0F;&#x4FBF;&#x5462;&#xFF1F;&#x60F3;&#x6765;&#x4F1A;&#x4E0D;&#x4F1A;&#x662F;&#x5927;&#x4E8B;&#xFF1F;&#x4E4B;&#x524D;&#x7237;&#x7237;&#x90FD;&#x5728;&#x5E8A;&#x4E0A;&#x5904;&#x7406;&#x5927;&#x4E8B;&#xFF0C;&#x6211;&#x5FC3;&#x60F3;&#x53CD;&#x6B63;&#x8981;&#x4ECE;&#x8F6E;&#x6905;&#x4E00;&#x4E0A;&#x4E00;&#x4E0B;&#xFF0C;&#x7D22;&#x6027;&#x76F4;&#x63A5;&#x8BD5;&#x8BD5;&#x7528;&#x9A6C;&#x6876;&#x6765;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;&#x6211;&#x548C;&#x62A4;&#x5DE5;&#x5E08;&#x5085;&#x4E24;&#x4EBA;&#x63A8;&#x7740;&#x7237;&#x7237;&#x8FDB;&#x4E86;&#x536B;&#x751F;&#x95F4;&#xFF0C;&#x5BF9;&#x7740;&#x7237;&#x7237;&#x6307;&#x4E86;&#x6307;&#x9A6C;&#x6876;&#xFF0C;&#x4ED6;&#x9732;&#x51FA;&#x7B11;&#x5BB9;&#xFF0C;&#x770B;&#x6765;&#x731C;&#x5BF9;&#x4E86;&#xFF01;&#x5395;&#x6240;&#x7A7A;&#x95F4;&#x672C;&#x6765;&#x5C31;&#x4E0D;&#x5927;&#xFF0C;&#x4E00;&#x4E0B;&#x5B50;&#x53C8;&#x586B;&#x5145;&#x4E86;&#x4E00;&#x4E2A;&#x8F6E;&#x6905;&#x548C;&#x4E09;&#x4E2A;&#x4EBA;&#xFF0C;&#x987F;&#x663E;&#x7279;&#x522B;&#x62E5;&#x6324;&#x3002;&#x6211;&#x548C;&#x62A4;&#x5DE5;&#x5E08;&#x5085;&#x4E24;&#x4E2A;&#x4EBA;&#x5728;&#x5395;&#x6240;&#x91CC;&#x9762;&#x5404;&#x79CD;&#x817E;&#x632A;&#x8F6C;&#x79FB;&#xFF0C;&#x8D39;&#x4E86;&#x597D;&#x5927;&#x529B;&#x6C14;&#x5C06;&#x8001;&#x7237;&#x5B50;&#x7EC8;&#x4E8E;&#x653E;&#x5230;&#x9A6C;&#x6876;&#x4E0A;&#x5750;&#x597D;&#x3002;&#x6211;&#x7ED9;&#x8001;&#x7237;&#x5B50;&#x6309;&#x6469;&#x809A;&#x5B50;&#xFF0C;&#x523A;&#x6FC0;&#x4ED6;&#x6392;&#x4FBF;&#xFF0C;&#x4F46;&#x6309;&#x4E86;&#x5F88;&#x4E45;&#x65E0;&#x679C;&#xFF0C;&#x4F30;&#x8BA1;&#x9760;&#x4ED6;&#x81EA;&#x5DF1;&#x5E94;&#x662F;&#x89E3;&#x4E0D;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x4E8E;&#x662F;&#x7528;&#x4E86;&#x5F00;&#x585E;&#x9732;&#x8F85;&#x52A9;&#x6392;&#x4FBF;&#xFF0C;&#x6CA1;&#x8FC7;&#x591A;&#x4E45;&#xFF0C;&#x542C;&#x5230;&#x51E0;&#x9635;&#x7A00;&#x91CC;&#x54D7;&#x5566;&#x7684;&#x843D;&#x6C34;&#x58F0;&#x3002;&#x4E5F;&#x5C31;&#x5728;&#x8FD9;&#x79CD;&#x7565;&#x663E;&#x8BE1;&#x5F02;&#x548C;&#x6709;&#x8DA3;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x6211;&#x548C;&#x5E08;&#x5085;&#x4E24;&#x4EBA;&#x6EE1;&#x5934;&#x5927;&#x6C57;&#xFF0C;&#x5374;&#x53C8;&#x51E0;&#x4E4E;&#x5728;&#x540C;&#x65F6;&#x7B11;&#x7740;&#x8BF4;&#x4E86;&#x53E5;&#xFF1A;&#x300E;&#x7EC8;&#x4E8E;&#x51FA;&#x6765;&#x4E86;&#xFF01;&#x300F;&#x3002;</p>
<p>&#x53C8;&#x53CA;&#xFF0C;&#x7237;&#x7237;&#x7B2C;&#x4E00;&#x6B21;&#x505A;&#x7AD9;&#x5E8A;&#x9879;&#x76EE;&#xFF0C;&#x4E0A;&#x5347;&#x7684;&#x89D2;&#x5EA6;&#x5E76;&#x4E0D;&#x9AD8;&#xFF0C;&#x9700;&#x8981;&#x6162;&#x6162;&#x6765;&#xFF0C;&#x6D4B;&#x91CF;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E5F;&#x9700;&#x8981;&#x65F6;&#x523B;&#x76D1;&#x63A7;&#x8840;&#x538B;&#x60C5;&#x51B5;&#xFF0C;&#x6015;&#x4E00;&#x4E0B;&#x5B50;&#x4ED6;&#x53D7;&#x4E0D;&#x4E86;&#xFF1A;</p>
<p><img src="http://static.zybuluo.com/whiledoing/hhhbbsjizyjk7yr22zvhhvnh/image_1c1sropfv1v0p1a3jnpi2221ckc9.png" alt="image_1c1sropfv1v0p1a3jnpi2221ckc9.png-1148.6kB"></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://whiledoing.github.io/2017/12/19/diary/diary-2016-12-14-THU/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="whiledoing">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/images/avatar.jpeg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="whiledoing">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="/2017/12/19/diary/diary-2016-12-14-THU/" itemprop="url">diary-2016-12-14-THU</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2017-12-19T23:36:38+08:00">
                2017-12-19
              </time>
            

            
              <span class="post-meta-divider">|</span>
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-check-o"></i>
              </span>
              
                <span class="post-meta-item-text">更新于&#58;</span>
              
              <time title="更新于" itemprop="dateModified" datetime="2017-12-19T23:37:25+08:00">
                2017-12-19
              </time>
            
          </span>

          

          
            
          

          
          

          

          
            <div class="post-wordcount">
              
                
                  <span class="post-meta-divider">|</span>
                
                <span class="post-meta-item-icon">
                  <i class="fa fa-file-word-o"></i>
                </span>
                
                  <span class="post-meta-item-text">字数统计&#58;</span>
                
                <span title="字数统计">
                  931
                </span>
              

              

              
            </div>
          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body han-init-context" itemprop="articleBody">

      
      

      
        
          
            <p>&#x4ECA;&#x5929;&#x662F;&#x7237;&#x7237;&#x751F;&#x75C5;&#x4F4F;&#x9662;&#x7684;&#x7B2C;30&#x5929;&#x3002;</p>
<p>&#x65E9;&#x4E0A;7&#x70B9;&#x8DDF;&#x7740;&#x59D1;&#x59D1;&#x8F66;&#x5B50;&#x53BB;&#x533B;&#x9662;&#x3002;&#x5230;&#x4E86;&#x540E;&#x5148;&#x662F;&#x95EE;&#x6628;&#x591C;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x91D1;&#x5E08;&#x5085;&#x53CD;&#x9988;&#x8BF4;&#x8001;&#x7237;&#x5B50;&#x591C;&#x91CC;&#x8FD8;&#x597D;&#xFF0C;&#x5927;&#x6982;&#x5728;&#x665A;&#x4E0A;12&#x70B9;&#x5230;4&#x70B9;&#x4E4B;&#x95F4;&#x7279;&#x522B;&#x95F9;&#x817E;&#xFF0C;&#x4E4B;&#x540E;&#x5C31;&#x5F00;&#x59CB;&#x7761;&#x89C9;&#x3002;&#x7136;&#x540E;&#x4ED6;&#x7ED9;&#x6211;&#x770B;&#x4E86;&#x4E0B;&#x5582;&#x98DF;&#x8BB0;&#x5F55;&#x672C;&#xFF0C;&#x665A;&#x4E0A;&#x4ED6;&#x6DF7;&#x642D;&#x8FD9;&#x6C34;&#x548C;&#x8425;&#x517B;&#x6DB2;&#x5582;&#x4E86;&#x7237;&#x7237;600ml&#xFF08;&#x7EA6;&#x662F;3&#x5C0F;&#x65F6;&#x7684;&#x5582;&#x98DF;&#x5DE5;&#x4F5C;&#x91CF;&#xFF09;&#xFF0C;&#x770B;&#x6765;&#x8FD9;&#x4E2A;&#x62A4;&#x5DE5;&#x5E08;&#x5085;&#x662F;&#x7528;&#x5FC3;&#x4E14;&#x8D1F;&#x8D23;&#x4EFB;&#x7684;&#xFF0C;&#x8BA9;&#x6211;&#x6DF1;&#x611F;&#x6B23;&#x6170;&#x3002;</p>
<p>&#x8BF4;&#x6765;&#x4E5F;&#x795E;&#x5947;&#xFF0C;&#x6309;&#x7167;&#x4E4B;&#x524D;&#x7684;&#x72B6;&#x6001;&#xFF0C;9&#x70B9;&#x5E94;&#x8BE5;&#x662F;&#x7237;&#x7237;&#x6700;&#x56F0;&#xFF0C;&#x4E5F;&#x662F;&#x7761;&#x7684;&#x6700;&#x597D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F46;&#x4ECA;&#x5929;&#x5374;&#x663E;&#x5F97;&#x6BD4;&#x8F83;&#x7CBE;&#x795E;&#x3002;&#x8D81;&#x7740;&#x7CBE;&#x795E;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x6211;&#x4EEC;&#x80AF;&#x5B9A;&#x5C31;&#x80FD;&#x591A;&#x5582;&#x98DF;&#x5C31;&#x591A;&#x5582;&#x98DF;&#x3002;&#x4E0A;&#x5348;&#x62A4;&#x58EB;&#x67E5;&#x623F;&#x65F6;&#xFF0C;&#x62A4;&#x58EB;&#x957F;&#x8BF4;&#x8001;&#x7237;&#x5B50;&#x6628;&#x5929;&#x5403;&#x7684;&#x592A;&#x5C11;&#xFF0C;&#x8FD9;&#x80AF;&#x5B9A;&#x4E0D;&#x884C;&#xFF0C;&#x8BA9;&#x6211;&#x8003;&#x8651;&#x7528;&#x80C3;&#x7BA1;&#x4E4B;&#x7C7B;&#x7684;&#x4E1C;&#x897F;&#x5B9E;&#x65BD;&#x5582;&#x98DF;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x6211;&#x4EEC;&#x5185;&#x5FC3;&#x4E00;&#x76F4;&#x6BD4;&#x8F83;&#x72B9;&#x8C6B;&#xFF0C;&#x56E0;&#x4E3A;&#x8001;&#x7237;&#x5B50;&#x6309;&#x73B0;&#x5728;&#x7684;&#x8FDB;&#x98DF;&#x60C5;&#x51B5;&#x786E;&#x5B9E;&#x80FD;&#x91CF;&#x8425;&#x517B;&#x4E0D;&#x8FBE;&#x6807;&#xFF0C;&#x4F46;&#x63D2;&#x80C3;&#x7BA1;&#x80AF;&#x5B9A;&#x4F1A;&#x8BA9;&#x4ED6;&#x5F88;&#x96BE;&#x53D7;&#xFF0C;&#x6240;&#x4EE5;&#x5185;&#x5FC3;&#x4E00;&#x76F4;&#x7EA0;&#x7ED3;&#x3002;&#x6211;&#x548C;&#x62A4;&#x957F;&#x8BF4;&#xFF0C;&#x8001;&#x7237;&#x5B50;&#x5982;&#x679C;&#x63D2;&#x4E86;&#x80C3;&#x7BA1;&#xFF0C;&#x6309;&#x4ED6;&#x73B0;&#x5728;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x4F30;&#x8BA1;&#x4F1A;&#x53D7;&#x4E0D;&#x4E86;&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x4ED6;&#x4F1A;&#x4E00;&#x76F4;&#x60F3;&#x8981;&#x62D4;&#x6389;&#x5B83;&#x3002;&#x62A4;&#x957F;&#x544A;&#x77E5;&#x6211;&#x8BF4;&#x5979;&#x4EEC;&#x8FD9;&#x6709;&#x4E00;&#x79CD;&#x95F4;&#x6B47;&#x6027;&#x5582;&#x98DF;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x5C31;&#x662F;&#x7528;&#x7684;&#x65F6;&#x5019;&#x5C06;&#x80C3;&#x7BA1;&#x63D2;&#x8FDB;&#x53BB;&#xFF0C;&#x4E0D;&#x7528;&#x4E00;&#x76F4;&#x63D2;&#x7740;&#xFF0C;&#x4EBA;&#x7684;&#x96BE;&#x53D7;&#x7A0B;&#x5EA6;&#x80AF;&#x5B9A;&#x4F1A;&#x6709;&#x6240;&#x964D;&#x4F4E;&#x3002;&#x6211;&#x8D28;&#x7591;&#x5730;&#x95EE;&#x4E86;&#x53E5;&#x300E;&#x90A3;&#x63D2;&#x7684;&#x65F6;&#x5019;&#x4E0D;&#x4E5F;&#x4F1A;&#x5F88;&#x75DB;&#x82E6;&#x561B;&#xFF1F;&#x300F;&#xFF0C;&#x5979;&#x7B11;&#x7740;&#x56DE;&#x590D;&#x6211;&#x300E;&#x6211;&#x4E4B;&#x524D;&#x81EA;&#x5DF1;&#x7279;&#x5730;&#x8BD5;&#x9A8C;&#x4E86;&#x4E0B;&#xFF0C;&#x611F;&#x89C9;&#x8FD8;&#x53EF;&#x4EE5;&#xFF0C;&#x8981;&#x662F;&#x4E0D;&#x4FE1;&#x4F60;&#x81EA;&#x5DF1;&#x53EF;&#x4EE5;&#x8BD5;&#x8BD5;&#xFF1F;&#x300F;&#xFF0C;&#x6211;&#x5FC3;&#x60F3;&#x5982;&#x679C;&#x6211;&#x81EA;&#x5DF1;&#x4E5F;&#x89C9;&#x5F97;&#x4E0D;&#x662F;&#x5F88;&#x96BE;&#x53D7;&#xFF0C;&#x90A3;&#x5E94;&#x8BE5;&#x8FD8;&#x662F;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x7684;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x4E0B;&#x5348;3&#x70B9;&#x5DE6;&#x53F3;&#xFF0C;&#x62A4;&#x957F;&#x95EE;&#x6211;&#xFF1A;&#x8BD5;&#x9A8C;&#x7684;&#x5668;&#x6750;&#x62C6;&#x4E86;&#x5C31;&#x9700;&#x8981;&#x4E70;&#x5355;&#xFF0C;&#x800C;&#x4E14;&#x8FC7;&#x7A0B;&#x80AF;&#x5B9A;&#x6709;&#x6240;&#x96BE;&#x53D7;&#xFF0C;&#x95EE;&#x6211;&#x662F;&#x4E0D;&#x662F;&#x786E;&#x5B9A;&#x8981;&#x8BD5;&#x8BD5;&#xFF1F;&#x6211;&#x7B11;&#x7740;&#x544A;&#x8BC9;&#x5979;&#xFF0C;&#x82B1;&#x4E00;&#x767E;&#x591A;&#x5143;&#x5668;&#x6750;&#x8D39;&#x8BD5;&#x8BD5;&#x770B;&#x6548;&#x679C;&#x800C;&#x4E14;&#x8FD8;&#x662F;&#x62A4;&#x957F;&#x670D;&#x52A1;&#xFF0C;&#x4E00;&#x70B9;&#x4E0D;&#x4E8F;&#x3002;&#x4E8E;&#x662F;&#x5979;&#x5E26;&#x6211;&#x8FDB;&#x5165;&#x5230;&#x62A4;&#x58EB;&#x4E13;&#x7528;&#x7684;&#x623F;&#x95F4;&#xFF0C;&#x548C;&#x6211;&#x8BB2;&#x89E3;&#x63D2;&#x5165;&#x80C3;&#x7BA1;&#x76F8;&#x5173;&#x7684;&#x8BF4;&#x660E;&#x3002;&#x8BB2;&#x4E86;&#x4E4B;&#x540E;&#x6211;&#x624D;&#x53D1;&#x73B0;&#xFF0C;&#x6211;&#x8FD9;&#x5B9E;&#x9A8C;&#x7684;&#x8FC7;&#x7A0B;&#x4E5F;&#x662F;&#x62A4;&#x957F;&#x7ED9;&#x79D1;&#x5BA4;&#x62A4;&#x58EB;&#x8BB2;&#x89E3;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x62A4;&#x58EB;&#x96C6;&#x4F53;&#x56F4;&#x89C2;&#xFF0C;&#x8FD8;&#x6709;&#x62CD;&#x7167;&#x6444;&#x50CF;&#x7684;&#xFF0C;&#x8FD9;&#x7740;&#x5B9E;&#x8BA9;&#x6211;&#x6709;&#x4E9B;&#x5C34;&#x5C2C;&#x3002;&#x3002;&#x3002;&#x6211;&#x7B11;&#x7740;&#x548C;&#x62A4;&#x957F;&#x8BF4;&#xFF0C;&#x8FD9;&#x56F4;&#x89C2;&#x7684;&#x67B6;&#x52BF;&#x771F;&#x662F;&#x53D7;&#x5BA0;&#x82E5;&#x60CA;&#x3002;&#x62A4;&#x957F;&#x7A81;&#x7136;&#x6025;&#x8F6C;&#x95EE;&#x4E86;&#x6211;&#x53E5;&#xFF0C;&#x5C0F;&#x4F19;&#x5B50;&#x4F60;&#x6709;&#x5BF9;&#x8C61;&#x561B;&#xFF1F;&#x54C8;&#x54C8;&#xFF0C;&#x8FD8;&#x662F;&#x4E13;&#x5FC3;&#x542C;&#x8BB2;&#x63D2;&#x5165;&#x80C3;&#x7BA1;&#x76F8;&#x5173;&#x4E8B;&#x5B9C;&#x4E3A;&#x597D;&#x3002;&#x63D2;&#x5165;&#x80C3;&#x7BA1;&#x7684;&#x8FC7;&#x7A0B;&#x7C7B;&#x4F3C;&#x4E8E;&#x5403;&#x6839;&#x9762;&#x6761;&#xFF0C;&#x53EA;&#x662F;&#x8FD9;&#x4E2A;&#x9762;&#x6761;&#x662F;&#x4E0D;&#x65AD;&#x7684;&#xFF0C;&#x4FB5;&#x5165;&#x7684;&#xFF0C;&#x6A61;&#x80F6;&#x6750;&#x8D28;&#x7684;&#x800C;&#x5DF2;&#x3002;&#x6BCF;&#x63D2;&#x5165;&#x4E00;&#x70B9;&#x957F;&#x5EA6;&#x80C3;&#x548C;&#x5589;&#x5499;&#x5C31;&#x96BE;&#x53D7;&#x4E00;&#x5206;&#xFF0C;&#x5230;&#x4E00;&#x534A;&#x5DE6;&#x53F3;&#x957F;&#x5EA6;&#x65F6;&#xFF0C;&#x6211;&#x88AB;&#x545B;&#x7684;&#x5B9E;&#x5728;&#x53D7;&#x4E0D;&#x4E86;&#xFF0C;&#x773C;&#x6CEA;&#x9F3B;&#x6D95;&#x4E00;&#x5E76;&#x6D41;&#x51FA;&#xFF0C;&#x963B;&#x6B62;&#x4E86;&#x62A4;&#x957F;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x8BD5;&#x9A8C;&#x4EE5;&#x5931;&#x8D25;&#x544A;&#x7EC8;&#x3002;&#x7B2C;&#x4E8C;&#x6B21;&#x6211;&#x4E00;&#x76F4;&#x5FCD;&#x4F4F;&#xFF0C;&#x575A;&#x6301;&#x4E0B;&#x53BB;&#x611F;&#x89C9;&#x4E5F;&#x8FD8;&#x597D;&#xFF0C;&#x5176;&#x5B9E;&#x4E2D;&#x9014;&#x653E;&#x5F03;&#x4F1A;&#x8BA9;&#x4EBA;&#x66F4;&#x52A0;&#x96BE;&#x53D7;&#x3002;&#x62A4;&#x957F;&#x8BF4;&#x6211;&#x7684;&#x53CD;&#x5E94;&#x662F;&#x6BD4;&#x8F83;&#x6B63;&#x5E38;&#x4EBA;&#x7684;&#x53CD;&#x5E94;&#xFF0C;&#x75C5;&#x4EBA;&#x53CD;&#x5C04;&#x5F27;&#x4F1A;&#x76F8;&#x5BF9;&#x5F31;&#x4E00;&#x4E9B;&#xFF0C;&#x7237;&#x7237;&#x7684;&#x611F;&#x53D7;&#x5E94;&#x8BE5;&#x4F1A;&#x6BD4;&#x6211;&#x66F4;&#x8F7B;&#x3002;</p>
<p>&#x4ECA;&#x5929;&#x8001;&#x7237;&#x5B50;&#x72B6;&#x6001;&#x771F;&#x662F;&#x51FA;&#x5947;&#x7684;&#x4E0D;&#x9519;&#xFF0C;&#x665A;&#x4E0A;&#x4E5F;&#x633A;&#x6709;&#x7CBE;&#x795E;&#xFF0C;&#x5403;&#x996D;&#x5403;&#x7684;&#x4E5F;&#x9EBB;&#x6E9C;&#x3002;&#x60F3;&#x6765;&#x89C9;&#x5F97;&#x591C;&#x91CC;&#x771F;&#x8981;&#x597D;&#x4E9B;&#x4F3A;&#x5019;&#xFF0C;&#x591A;&#x559D;&#x4E9B;&#x6C34;&#xFF0C;&#x591A;&#x5B89;&#x629A;&#xFF0C;&#x4ED6;&#x665A;&#x4E0A;&#x5C31;&#x53EF;&#x4EE5;&#x7761;&#x5F97;&#x76F8;&#x5BF9;&#x5B89;&#x7A33;&#x4E9B;&#xFF0C;&#x7B2C;&#x4E8C;&#x5929;&#x7684;&#x7CBE;&#x795E;&#x4E5F;&#x5C31;&#x6BD4;&#x8F83;&#x597D;&#x3002;</p>
<p>&#x53C8;&#x53CA;&#xFF0C;&#x665A;&#x4E0A;&#x59D1;&#x59D1;&#x53D1;&#x7ED9;&#x6211;&#x5FAE;&#x4FE1;&#x56FE;&#x7247;&#xFF0C;&#x662F;&#x62A4;&#x957F;&#x7684;&#x670B;&#x53CB;&#x5708;&#xFF0C;&#x89C9;&#x5F97;&#x8FD9;&#x6CE2;&#x64CD;&#x4F5C;&#x4E5F;&#x662F;6&#x7684;&#x5F88;&#xFF1A;</p>
<p><img src="http://static.zybuluo.com/whiledoing/tse2s9kh8n7uh3wdtraiikq4/image_1c1nmo38u1nut1u912vl8r9mgcp.png" alt="image_1c1nmo38u1nut1u912vl8r9mgcp.png-578.7kB"></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://whiledoing.github.io/2017/12/16/diary/diary-2017-12-13-WED/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="whiledoing">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/images/avatar.jpeg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="whiledoing">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="/2017/12/16/diary/diary-2017-12-13-WED/" itemprop="url">diary-2017-12-13-WED</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2017-12-16T00:42:15+08:00">
                2017-12-16
              </time>
            

            
              <span class="post-meta-divider">|</span>
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-check-o"></i>
              </span>
              
                <span class="post-meta-item-text">更新于&#58;</span>
              
              <time title="更新于" itemprop="dateModified" datetime="2017-12-16T00:45:30+08:00">
                2017-12-16
              </time>
            
          </span>

          

          
            
          

          
          

          

          
            <div class="post-wordcount">
              
                
                  <span class="post-meta-divider">|</span>
                
                <span class="post-meta-item-icon">
                  <i class="fa fa-file-word-o"></i>
                </span>
                
                  <span class="post-meta-item-text">字数统计&#58;</span>
                
                <span title="字数统计">
                  1,332
                </span>
              

              

              
            </div>
          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body han-init-context" itemprop="articleBody">

      
      

      
        
          
            <p>&#x4ECA;&#x5929;&#x662F;&#x7237;&#x7237;&#x751F;&#x75C5;&#x4F4F;&#x9662;&#x7684;&#x7B2C;29&#x5929;&#x3002;</p>
<p>&#x65E9;&#x4E0A;&#x8FD8;&#x662F;&#x65E9;&#x65E9;&#x53BB;&#x4E86;&#x533B;&#x9662;&#xFF0C;&#x5230;&#x4E86;&#x540E;&#x674E;&#x5E08;&#x5085;&#x544A;&#x8BC9;&#x6211;&#x7237;&#x7237;&#x8FD8;&#x662F;&#x7761;&#x7684;&#x4E0D;&#x592A;&#x597D;&#xFF0C;&#x4F1A;&#x95F9;&#x817E;&#xFF0C;&#x5FC3;&#x91CC;&#x53C8;&#x662F;&#x4E00;&#x9635;&#x767E;&#x611F;&#x4EA4;&#x96C6;&#x3002;</p>
<p>&#x4E2D;&#x5348;&#x5403;&#x8FC7;&#x665A;&#x996D;&#x540E;&#x6CA1;&#x591A;&#x4E45;&#xFF0C;&#x4E4B;&#x524D;&#x795E;&#x7ECF;&#x5185;&#x79D1;&#x7167;&#x6599;&#x7684;&#x62A4;&#x5DE5;&#x90ED;&#x59D0;&#x8FC7;&#x6765;&#x770B;&#x671B;&#x8001;&#x7237;&#x5B50;&#x3002;&#x6211;&#x4EEC;&#x4E00;&#x5BB6;&#x4EBA;&#x90FD;&#x7279;&#x522B;&#x559C;&#x6B22;&#x90ED;&#x59D0;&#xFF0C;&#x4E4B;&#x524D;&#x4E5F;&#x662F;&#x5979;&#x4E00;&#x76F4;&#x7167;&#x6599;&#x8001;&#x7237;&#x5B50;&#x3002;&#x5979;&#x8BF4;&#x521A;&#x597D;&#x5230;&#x95E8;&#x8BCA;&#x5C31;&#x987A;&#x9053;&#x4E0A;&#x6765;&#x770B;&#x770B;&#x8001;&#x7237;&#x5B50;&#xFF0C;&#x6211;&#x4EEC;&#x5F53;&#x65F6;&#x6B63;&#x5728;&#x7ED9;&#x8001;&#x7237;&#x5B50;&#x5582;&#x98DF;&#x4E2D;&#x996D;&#xFF0C;&#x5979;&#x4E8C;&#x8BDD;&#x6CA1;&#x8BF4;&#xFF0C;&#x5C31;&#x804C;&#x4E1A;&#x6027;&#x7684;&#x63A5;&#x624B;&#x4E86;&#x8FD9;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;&#x53EA;&#x89C1;&#x5979;&#x5148;&#x8C03;&#x6574;&#x4E86;&#x5E8A;&#x7684;&#x9AD8;&#x5EA6;&#xFF0C;&#x5728;&#x6258;&#x8D77;&#x8001;&#x7237;&#x5B50;&#x7684;&#x540C;&#x65F6;&#x5F88;&#x8FC5;&#x901F;&#x5730;&#x7528;&#x53E6;&#x4E00;&#x53EA;&#x624B;&#x5C06;&#x5E73;&#x5934;&#x6795;&#x5934;&#x653E;&#x5728;&#x8170;&#x95F4;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x4FA7;&#x65B9;&#x4F4D;&#x8E2E;&#x8D77;&#x4E00;&#x4E2A;&#x4E09;&#x89D2;&#x6795;&#x5934;&#xFF0C;&#x7136;&#x540E;&#x653E;&#x4E0B;&#x8001;&#x7237;&#x5B50;&#xFF0C;&#x634B;&#x4E86;&#x634B;&#x57AB;&#x5934;&#x7684;&#x6795;&#x5934;&#xFF0C;&#x8001;&#x7237;&#x5B50;&#x5C31;&#x88AB;&#x56FA;&#x5B9A;&#x5728;&#x4E00;&#x4E2A;&#x76F4;&#x7ACB;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x800C;&#x4E14;&#x770B;&#x8D77;&#x6765;&#x4ED6;&#x5E94;&#x8BE5;&#x5750;&#x7684;&#x59FF;&#x52BF;&#x8FD8;&#x633A;&#x8212;&#x670D;&#x3002;&#x6211;&#x4E4B;&#x524D;&#x5728;&#x795E;&#x7ECF;&#x5185;&#x79D1;&#x90FD;&#x662F;&#x4E0A;&#x591C;&#x73ED;&#x591A;&#xFF0C;&#x8FD8;&#x771F;&#x4E0D;&#x77E5;&#x9053;&#x5979;&#x5582;&#x98DF;&#x8001;&#x7237;&#x5B50;&#x7ADF;&#x6709;&#x5982;&#x6B64;&#x9EBB;&#x6E9C;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x6211;&#x4EEC;&#x5E73;&#x5E38;&#x5582;&#x98DF;&#xFF0C;&#x8981;&#x8C03;&#x6574;&#x8001;&#x7237;&#x5B50;&#x7684;&#x59FF;&#x52BF;&#x90FD;&#x9700;&#x8981;&#x6298;&#x817E;&#x5F88;&#x4E45;&#x8FD8;&#x4E0D;&#x4E00;&#x5B9A;&#x8BA9;&#x4ED6;&#x6EE1;&#x610F;&#xFF0C;&#x800C;&#x90ED;&#x59D0;&#x64CD;&#x4F5C;&#x8D77;&#x6765;&#x5374;&#x662F;&#x5982;&#x6B64;&#x8F7B;&#x677E;&#x81EA;&#x5982;&#x3002;&#x770B;&#x6765;&#x771F;&#x662F;&#x300C;&#x4E16;&#x4E8B;&#x6D1E;&#x660E;&#x7686;&#x5B66;&#x95EE;&#x300D;&#xFF0C;&#x4E5F;&#x5370;&#x4E86;&#x90A3;&#x53E5;&#x8BDD;&#x300C;&#x4E09;&#x4EBA;&#x884C;&#x5FC5;&#x6709;&#x6211;&#x5E08;&#x7109;&#x300D;&#xFF0C;&#x53E4;&#x4EBA;&#x8BDA;&#x4E0D;&#x6B3A;&#x6211;&#x3002;</p>
<p>&#x5728;&#x533B;&#x9662;&#x7167;&#x6599;&#x7237;&#x7237;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6BCF;&#x65E5;&#x90FD;&#x548C;&#x62A4;&#x5DE5;&#x5E08;&#x5085;&#x4E00;&#x8D77;&#x5408;&#x4F5C;&#xFF0C;&#x5B66;&#x5230;&#x5F88;&#x591A;&#x6280;&#x5DE7;&#x548C;&#x64CD;&#x4F5C;&#x65B9;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;&#x5927;&#x81F4;&#x6709;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x4F55;&#x7528;&#x5DE7;&#x52B2;&#x7FFB;&#x8EAB;&#xFF0C;&#x8C03;&#x6574;&#x59FF;&#x52BF;</li>
<li>&#x5982;&#x4F55;&#x62CD;&#x80CC;&#xFF0C;&#x5904;&#x7406;&#x54B3;&#x75F0;</li>
<li>&#x5982;&#x4F55;&#x8C03;&#x6574;&#x7761;&#x89C9;&#x7684;&#x59FF;&#x52BF;&#x66F4;&#x8212;&#x9002;</li>
<li>&#x5982;&#x4F55;&#x5408;&#x7406;&#x5229;&#x7528;&#x4E0D;&#x540C;&#x5F62;&#x72B6;&#x6795;&#x5934;&#x56FA;&#x5B9A;&#x59FF;&#x52BF;</li>
<li>&#x5582;&#x6C34;&#xFF0C;&#x5582;&#x996D;&#xFF0C;&#x5582;&#x836F;&#x7684;&#x65B9;&#x6CD5;</li>
<li>&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x7684;&#x89D2;&#x5EA6;&#x66F4;&#x5408;&#x9002;&#x5582;&#x98DF;</li>
<li>&#x5982;&#x4F55;&#x5E2E;&#x52A9;&#x75C5;&#x4EBA;&#x5E8A;&#x4E0A;&#x89E3;&#x51B3;&#x5404;&#x79CD;&#x65B9;&#x4FBF;&#x95EE;&#x9898;</li>
<li>&#x5982;&#x4F55;&#x6E05;&#x7406;&#x53E3;&#x8154;&#xFF0C;&#x4E0B;&#x4F53;</li>
<li>&#x5982;&#x4F55;&#x62AC;&#x75C5;&#x4EBA;&#x4E0A;&#x4E0B;&#x8F6E;&#x6905;</li>
<li>&#x5982;&#x4F55;&#x5E8A;&#x4E0A;&#x7A7F;&#x8863;&#x670D;</li>
</ul>
<p>&#x5E94;&#x8BE5;&#x8BF4;&#x8FD9;&#x4E9B;&#x80FD;&#x529B;&#x662F;&#x5F53;&#x4E00;&#x4E2A;&#x62A4;&#x5DE5;&#x7684;&#x786C;&#x6280;&#x80FD;&#xFF0C;&#x8981;&#x60F3;&#x505A;&#x4E2A;&#x66F4;&#x597D;&#xFF0C;&#x66F4;&#x9AD8;&#x9636;&#x7684;&#x62A4;&#x5DE5;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x4F1A;&#x4E00;&#x4E9B;&#x8F6F;&#x6280;&#x80FD;&#xFF1A;&#x638C;&#x63E1;&#x57FA;&#x672C;&#x7684;&#x75C5;&#x7406;&#x548C;&#x836F;&#x7269;&#x77E5;&#x8BC6;&#xFF0C;&#x77E5;&#x9053;&#x5904;&#x65B9;&#x836F;&#x5982;&#x4F55;&#x5403;&#xFF0C;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5403;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x4F5C;&#x7528;&#xFF0C;&#x8FD9;&#x4F1A;&#x8BA9;&#x5BB6;&#x5C5E;&#x89C9;&#x5F97;&#x4F60;&#x7279;&#x522B;&#x4E13;&#x4E1A;&#xFF1B;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x5FC3;&#x7406;&#x5B66;&#x77E5;&#x8BC6;&#xFF0C;&#x8FD9;&#x6837;&#x5B50;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x7684;&#x5728;&#x5FC3;&#x7406;&#x4E0A;&#x5B89;&#x629A;&#x75C5;&#x4EBA;&#xFF1B;&#x6700;&#x540E;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x4F1A;&#x548C;&#x5BB6;&#x5C5E;&#x5904;&#x597D;&#x5173;&#x7CFB;&#xFF0C;&#x4E5F;&#x8BB8;&#x8FD9;&#x4F1A;&#x5E26;&#x6765;&#x66F4;&#x591A;&#x7684;&#x6D3D;&#x8C08;&#x5DE5;&#x8D44;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x503C;&#x8FD9;&#x4E2A;&#x670D;&#x52A1;&#x4EF7;&#x3002;&#x60F3;&#x6765;&#xFF0C;&#x6211;&#x771F;&#x7684;&#x53EF;&#x4EE5;&#x5F53;&#x804C;&#x4E1A;&#x62A4;&#x5DE5;&#x4E86;&#x3002;</p>
<p>&#x672C;&#x6765;&#x4E00;&#x5207;&#x611F;&#x89C9;&#x90FD;&#x8FDB;&#x5165;&#x6B63;&#x8F68;&#x4E86;&#xFF0C;&#x7ED3;&#x679C;&#x4E0B;&#x5348;&#x7ED9;&#x7237;&#x7237;&#x505A;&#x5B8C;&#x8A00;&#x8BED;&#x5EB7;&#x590D;&#x540E;&#xFF0C;&#x62A4;&#x5DE5;&#x674E;&#x5E08;&#x5085;&#x544A;&#x8BC9;&#x6211;&#xFF0C;&#x4ED6;&#x5BB6;&#x5C0F;&#x513F;&#x5B50;&#x90A3;&#x8FB9;&#x6709;&#x4E8B;&#x60C5;&#x8981;&#x4ED6;&#x8FC7;&#x53BB;&#x5E2E;&#x52A9;&#xFF0C;&#x4ED6;&#x6CA1;&#x6CD5;&#x62D2;&#x7EDD;&#x3002;&#x6211;&#x5F53;&#x65F6;&#x4E00;&#x542C;&#xFF0C;&#x89C9;&#x5F97;&#x662F;&#x4E0D;&#x662F;&#x94B1;&#x65B9;&#x9762;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x5957;&#x8BDD;&#x95EE;&#x95EE;&#xFF0C;&#x4ED6;&#x8BF4;&#x4E0D;&#x662F;&#xFF0C;&#x786E;&#x5B9E;&#x662F;&#x4ED6;&#x5BB6;&#x6709;&#x4E8B;&#x60C5;&#xFF0C;&#x60F3;&#x6765;&#x6211;&#x4EEC;&#x867D;&#x7136;&#x5F88;&#x5E0C;&#x671B;&#x674E;&#x5E08;&#x5085;&#x7559;&#x4E0B;&#x6765;&#xFF0C;&#x56E0;&#x4E3A;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x5408;&#x9002;&#x7684;&#x62A4;&#x5DE5;&#x662F;&#x771F;&#x7684;&#x5F88;&#x4E0D;&#x5BB9;&#x6613;&#xFF0C;&#x4F46;&#x4E5F;&#x4E0D;&#x80FD;&#x56E0;&#x6B64;&#x727A;&#x7272;&#x522B;&#x4EBA;&#x7684;&#x5229;&#x76CA;&#xFF0C;&#x4E5F;&#x5C31;&#x7B54;&#x5E94;&#x4E86;&#x3002;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x548C;&#x4ED6;&#x4EEC;&#x7684;&#x8D1F;&#x8D23;&#x4EBA;&#x6C9F;&#x901A;&#x4E86;&#x4E8B;&#x5B9C;&#xFF0C;&#x4ED6;&#x4EEC;&#x7ED9;&#x6211;&#x8C03;&#x6765;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x5E08;&#x5085;&#xFF0C;&#x901F;&#x5EA6;&#x4E4B;&#x5FEB;&#x4E5F;&#x662F;&#x51FA;&#x4E4E;&#x610F;&#x6599;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x672C;&#x6765;&#x60F3;&#x8BA9;&#x674E;&#x5E08;&#x5085;&#x4ECA;&#x5929;&#x665A;&#x4E0A;&#x518D;&#x9876;&#x4E00;&#x665A;&#xFF0C;&#x6CA1;&#x60F3;&#x5230;&#x4EBA;&#x5F88;&#x5FEB;&#x5C31;&#x8C03;&#x6765;&#x4E86;&#xFF0C;&#x65E2;&#x7136;&#x6765;&#x4E86;&#xFF0C;&#x5C31;&#x76F4;&#x63A5;&#x63A5;&#x624B;&#x597D;&#x4E86;&#x3002;&#x674E;&#x5E08;&#x5085;&#x5E26;&#x7740;&#x65B0;&#x6765;&#x7684;&#x91D1;&#x5E08;&#x5085;&#x4E86;&#x89E3;&#x4E86;&#x4E0B;&#x76F8;&#x5173;&#x60C5;&#x51B5;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x548C;&#x674E;&#x5E08;&#x5085;&#x7ED3;&#x4E86;&#x51E0;&#x5929;&#x7684;&#x5DE5;&#x8D44;&#x94B1;&#xFF0C;&#x4ED6;&#x5C31;&#x79BB;&#x5F00;&#x4E86;&#x3002;</p>
<p>&#x5403;&#x665A;&#x996D;&#x65F6;&#x5019;&#x6211;&#x4E00;&#x76F4;&#x5C31;&#x5728;&#x60F3;&#xFF0C;&#x4E0B;&#x5348;&#x540C;&#x610F;&#x8BA9;&#x674E;&#x5E08;&#x5085;&#x79BB;&#x5F00;&#x8FD9;&#x4E2A;&#x51B3;&#x5B9A;&#x662F;&#x4E0D;&#x662F;&#x592A;&#x8349;&#x7387;&#x4E86;&#xFF1F;&#x4E00;&#x6765;&#x627E;&#x4E00;&#x4E2A;&#x5408;&#x9002;&#xFF0C;&#x9760;&#x8C31;&#xFF0C;&#x4E5F;&#x80FD;&#x7167;&#x987E;&#x597D;&#x7237;&#x7237;&#x7684;&#x62A4;&#x5DE5;&#x662F;&#x771F;&#x7684;&#x5F88;&#x96BE;&#xFF0C;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x5C31;&#x4E3A;&#x4E86;&#x8FD9;&#x4E2A;&#x4E8B;&#x60C5;&#x7279;&#x522B;&#x5934;&#x75BC;&#xFF0C;&#x6298;&#x817E;&#x4E86;&#x597D;&#x51E0;&#x5929;&#x624D;&#x627E;&#x6765;&#x4E86;&#x674E;&#x5E08;&#x5085;&#x3002;&#x4E8C;&#x6765;&#x662F;&#x4E0A;&#x624B;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6BCF;&#x6362;&#x4E00;&#x4E2A;&#x62A4;&#x5DE5;&#xFF0C;&#x6211;&#x90FD;&#x8981;&#x91CD;&#x65B0;&#x6C9F;&#x901A;&#x4E00;&#x904D;&#x7167;&#x987E;&#x7237;&#x7237;&#x7684;&#x6CE8;&#x610F;&#x7EC6;&#x8282;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#x4E0D;&#x662F;&#x8BF4;&#x5C31;&#x53EF;&#x4EE5;&#x8BF4;&#x7684;&#x6E05;&#x695A;&#x7684;&#xFF0C;&#x603B;&#x662F;&#x9700;&#x8981;&#x4E0A;&#x624B;&#x4E00;&#x4E24;&#x4E2A;&#x665A;&#x4E0A;&#x624D;&#x53EF;&#x4EE5;&#x638C;&#x63E1;&#x3002;&#x5982;&#x679C;&#x7167;&#x987E;&#x4E0D;&#x597D;&#xFF0C;&#x7237;&#x7237;&#x665A;&#x4E0A;&#x7761;&#x4E0D;&#x597D;&#xFF0C;&#x522B;&#x7684;&#x5E8A;&#x75C5;&#x4EBA;&#x4E5F;&#x7761;&#x4E0D;&#x597D;&#xFF0C;&#x7B2C;&#x4E8C;&#x5929;&#x5C31;&#x662F;&#x6076;&#x5FC3;&#x5FAA;&#x73AF;&#x548C;&#x5404;&#x79CD;&#x68D8;&#x624B;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x548C;&#x65B0;&#x6765;&#x7684;&#x91D1;&#x5E08;&#x5085;&#x8BB2;&#x4E86;&#x5F88;&#x4E45;&#x7167;&#x987E;&#x7237;&#x7237;&#x7684;&#x6CE8;&#x610F;&#x4E8B;&#x60C5;&#xFF0C;&#x5374;&#x4E5F;&#x6DF1;&#x77E5;&#x4ECA;&#x5929;&#x665A;&#x4E0A;&#x80AF;&#x5B9A;&#x662F;&#x5934;&#x75BC;&#x7684;&#x4E00;&#x591C;&#x3002;&#x4E5F;&#x8BB8;&#x5F53;&#x65F6;&#x5E94;&#x8BE5;&#x548C;&#x674E;&#x5E08;&#x5085;&#x518D;&#x591A;&#x804A;&#x804A;&#x591A;&#x63A2;&#x63A2;&#x5E95;&#xFF0C;&#x770B;&#x662F;&#x4E0D;&#x662F;&#x94B1;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4EA6;&#x6216;&#x662F;&#x522B;&#x7684;&#x4EC0;&#x4E48;&#x65B9;&#x9762;&#x6709;&#x56F0;&#x96BE;&#xFF1F;&#x4E5F;&#x8BB8;&#x591A;&#x62D6;&#x62D6;&#xFF0C;&#x8BA9;&#x4ED6;&#x4ECA;&#x5929;&#x665A;&#x4E0A;&#x7EE7;&#x7EED;&#x503C;&#x4E00;&#x591C;&#xFF0C;&#x53EF;&#x4EE5;&#x518D;&#x597D;&#x597D;&#x804A;&#x804A;&#xFF0C;&#x8FD9;&#x6837;&#x5B50;&#x5904;&#x7406;&#x4F1A;&#x4E0D;&#x4F1A;&#x66F4;&#x597D;&#xFF1F;&#x4E0D;&#x8FC7;&#x540E;&#x60F3;&#x65E2;&#x5DF2;&#x5982;&#x6B64;&#xFF0C;&#x4E5F;&#x5E94;&#x8BE5;&#x7ED9;&#x65B0;&#x6765;&#x7684;&#x5E08;&#x5085;&#x4E00;&#x4E2A;&#x8868;&#x73B0;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x4EBA;&#x603B;&#x8981;&#x6709;&#x4E0A;&#x624B;&#x548C;&#x719F;&#x6089;&#x7684;&#x8FC7;&#x7A0B;&#x4E0D;&#x662F;&#x3002;&#x8FD8;&#x597D;&#xFF0C;&#x665A;&#x4E0A;&#x91D1;&#x5E08;&#x5085;&#x62FF;&#x7740;&#x6211;&#x5199;&#x7684;&#x7167;&#x987E;&#x7237;&#x7237;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#x7684;&#x6750;&#x6599;&#x8BA4;&#x771F;&#x7684;&#x770B;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x6DF1;&#x611F;&#x6B23;&#x6170;&#x3002;</p>
<p>&#x53C8;&#x53CA;&#xFF0C;&#x4ECA;&#x5929;&#x79BB;&#x5F00;&#x533B;&#x9662;&#x5750;&#x7535;&#x68AF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53D1;&#x73B0;&#x706F;&#x5149;&#x548C;&#x73AF;&#x5883;&#x975E;&#x5E38;&#x8BE1;&#x5F02;&#xFF0C;&#x7528;&#x6545;&#x610F;&#x8DD1;&#x7126;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x62CD;&#x6444;&#xFF0C;&#x663E;&#x7684;&#x66F4;&#x52A0;&#x8FF7;&#x79BB;&#x548C;&#x8BE1;&#x5F02;&#x3002;</p>
<p><img src="http://static.zybuluo.com/whiledoing/9umpiiois5pmudbccuuy8jse/image_1c1dgsksi109n1hd7dsn99fgo9.png" alt="image_1c1dgsksi109n1hd7dsn99fgo9.png-999.4kB"></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://whiledoing.github.io/2017/12/16/diary/diary-2017-12-12-TUE/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="whiledoing">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/images/avatar.jpeg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="whiledoing">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="/2017/12/16/diary/diary-2017-12-12-TUE/" itemprop="url">diary-2017-12-12-TUE</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2017-12-16T00:35:39+08:00">
                2017-12-16
              </time>
            

            
              <span class="post-meta-divider">|</span>
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-check-o"></i>
              </span>
              
                <span class="post-meta-item-text">更新于&#58;</span>
              
              <time title="更新于" itemprop="dateModified" datetime="2017-12-16T00:40:46+08:00">
                2017-12-16
              </time>
            
          </span>

          

          
            
          

          
          

          

          
            <div class="post-wordcount">
              
                
                  <span class="post-meta-divider">|</span>
                
                <span class="post-meta-item-icon">
                  <i class="fa fa-file-word-o"></i>
                </span>
                
                  <span class="post-meta-item-text">字数统计&#58;</span>
                
                <span title="字数统计">
                  1,463
                </span>
              

              

              
            </div>
          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body han-init-context" itemprop="articleBody">

      
      

      
        
          
            <p>&#x4ECA;&#x5929;&#x662F;&#x7237;&#x7237;&#x751F;&#x75C5;&#x4F4F;&#x9662;&#x7684;&#x7B2C;28&#x5929;&#x3002;</p>
<p>&#x4ECA;&#x5929;&#x4E09;&#x5A76;&#x65E9;&#x4E0A;&#x53BB;&#x533B;&#x9662;&#x770B;&#x62A4;&#x7237;&#x7237;&#xFF0C;&#x6211;&#x5C31;&#x65E9;&#x4E0A;&#x591A;&#x4F11;&#x606F;&#x4E86;&#x4E00;&#x4F1A;&#x3002;&#x4E09;&#x5A76;&#x8FC7;&#x4E86;&#x4F1A;&#xFF0C;&#x6253;&#x7535;&#x8BDD;&#x8FC7;&#x6765;&#x8BF4;&#xFF1A;&#x7237;&#x7237;&#x6628;&#x5929;&#x8FD8;&#x662F;&#x7761;&#x5F97;&#x5F88;&#x4E0D;&#x597D;&#xFF0C;&#x591C;&#x91CC;&#x6BD4;&#x8F83;&#x7126;&#x8E81;&#xFF0C;&#x73B0;&#x5728;&#x65E9;&#x4E0A;&#x975E;&#x5E38;&#x56F0;&#xFF0C;&#x5BFC;&#x81F4;&#x4E0D;&#x80FD;&#x5582;&#x996D;&#xFF0C;&#x57FA;&#x672C;&#x5582;&#x4E86;&#x4E00;&#x70B9;&#x5C31;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x5582;&#x4E86;&#xFF0C;&#x53EA;&#x80FD;&#x8BA9;&#x4ED6;&#x7761;&#x89C9;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4E0D;&#x653E;&#x5FC3;&#x8FD8;&#x662F;&#x5F88;&#x65E9;&#x5C31;&#x53BB;&#x4E86;&#x533B;&#x9662;&#x3002;</p>
<p>&#x533B;&#x751F;&#x4E00;&#x76F4;&#x8BF4;&#x8001;&#x7237;&#x5B50;&#x5403;&#x7684;&#x592A;&#x5C11;&#x592A;&#x5C11;&#xFF0C;&#x8425;&#x517B;&#xFF0C;&#x70ED;&#x91CF;&#xFF0C;&#x80FD;&#x91CF;&#x66F4;&#x4E0D;&#x4E0A;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x6CA1;&#x6709;&#x529B;&#x6C14;&#xFF0C;&#x66F4;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x597D;&#x597D;&#x7684;&#x5EB7;&#x590D;&#x6CBB;&#x7597;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x4E00;&#x76F4;&#x662F;&#x6211;&#x8FD1;&#x6BB5;&#x65F6;&#x95F4;&#x7684;&#x5FC3;&#x75C5;&#x3002;&#x4ECA;&#x5929;&#x4E5F;&#x662F;&#x4E00;&#x6837;&#x72B6;&#x51B5;&#xFF0C;&#x767D;&#x5929;&#x6211;&#x65E9;&#x4E0A;&#x8FC7;&#x53BB;&#xFF0C;&#x7237;&#x7237;&#x5C31;&#x662F;&#x7761;&#x89C9;&#xFF0C;&#x96F7;&#x6253;&#x4E0D;&#x52A8;&#x7684;&#x7761;&#x89C9;&#xFF0C;&#x60F3;&#x8981;&#x53EB;&#x9192;&#x4ED6;&#xFF0C;&#x786E;&#x662F;&#x4E8E;&#x5FC3;&#x4E0D;&#x5FCD;&#x3002;&#x8FD8;&#x597D;&#x73B0;&#x5728;&#x5EB7;&#x590D;&#x9879;&#x76EE;&#x8C03;&#x6574;&#x5230;&#x4E0B;&#x5348;&#x5DE8;&#x591A;&#xFF0C;&#x6240;&#x4EE5;&#x65E9;&#x4E0A;&#x771F;&#x8981;&#x662F;&#x53EB;&#x4E0D;&#x9192;&#x5C31;&#x8BA9;&#x8001;&#x7237;&#x5B50;&#x591A;&#x7761;&#x4F1A;&#x3002;</p>
<p>&#x4E2D;&#x5348;&#x7EC8;&#x4E8E;&#x9192;&#x4E86;&#x4F1A;&#xFF0C;&#x4F46;&#x4E5F;&#x5582;&#x98DF;&#x7684;&#x4E0D;&#x591A;&#xFF1A;&#x4E00;&#x6765;&#x5230;&#x4E86;&#x4E2D;&#x5348;&#x8001;&#x7237;&#x5B50;&#x53C8;&#x8FDB;&#x5165;&#x5230;&#x65B0;&#x7684;&#x56F0;&#x610F;&#x9636;&#x6BB5;&#xFF0C;&#x4E8C;&#x6765;&#x5230;&#x4E86;&#x4E2D;&#x5348;&#x522B;&#x4EBA;&#x5E8A;&#x4F11;&#x606F;&#x6211;&#x4EEC;&#x4E5F;&#x4E0D;&#x597D;&#x53D1;&#x51FA;&#x592A;&#x591A;&#x58F0;&#x54CD;&#x3002;&#x52A0;&#x4E4B;&#x8001;&#x7237;&#x5B50;&#x8981;&#x662F;&#x5FC3;&#x60C5;&#x4E0D;&#x597D;&#xFF0C;&#x6025;&#x8E81;&#x4E86;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x5403;&#x996D;&#xFF0C;&#x7740;&#x5B9E;&#x662F;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x4E0B;&#x5348;&#x8981;&#x7ED9;&#x7237;&#x7237;&#x53BB;&#x62CD;&#x4E2A;&#x5F69;&#x8D85;&#xFF0C;&#x5438;&#x53D6;&#x4E4B;&#x524D;&#x62CD;&#x6444;CT&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x6211;&#x5148;&#x53BB;&#x6392;&#x961F;&#xFF0C;&#x7136;&#x540E;&#x7B97;&#x597D;&#x65F6;&#x95F4;&#x8FC7;&#x53BB;&#xFF0C;&#x4E0D;&#x7136;&#x548C;&#x4E0A;&#x6B21;CT&#x62CD;&#x6444;&#x4F3C;&#x7684;&#xFF0C;&#x6309;&#x7167;&#x65F6;&#x95F4;&#x8FC7;&#x53BB;&#xFF0C;&#x7ED3;&#x679C;&#x5230;&#x4E86;&#x540E;&#x8FD8;&#x662F;&#x6392;&#x4E86;&#x5F88;&#x4E45;&#x624D;&#x6392;&#x5230;&#xFF0C;&#x8001;&#x7237;&#x5B50;&#x7126;&#x8E81;&#x5750;&#x4E0D;&#x4F4F;&#x4E5F;&#x6CA1;&#x6CD5;&#x542C;&#x61C2;&#x8A00;&#x8BED;&#xFF0C;&#x95F9;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x68D8;&#x624B;&#x3002;&#x4E0E;&#x5176;&#x8BF4;&#x662F;&#x7B97;&#x597D;&#x65F6;&#x95F4;&#x8FC7;&#x53BB;&#xFF0C;&#x66F4;&#x4E0D;&#x5982;&#x8BF4;&#x662F;&#x534F;&#x8C03;&#x597D;&#x65F6;&#x95F4;&#x8FC7;&#x53BB;&#xFF0C;&#x5728;&#x533B;&#x9662;&#x7528;&#x7EDD;&#x5BF9;&#x7406;&#x6027;&#x7684;&#x601D;&#x7EF4;&#x53BB;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x5F80;&#x5F80;&#x662F;&#x884C;&#x4E0D;&#x901A;&#x7684;&#x3002;</p>
<p>&#x6211;&#x8BA4;&#x4E3A;&#x533B;&#x9662;&#x7EC4;&#x7EC7;&#x79E9;&#x5E8F;&#x7684;&#x903B;&#x8F91;&#x662F;&#x300C;&#x534A;&#x89C4;&#x77E9;&#x534A;&#x62A2;&#x300D;&#x3002;&#x6211;&#x8FD9;&#x4E48;&#x7406;&#x89E3;&#x8BE5;&#x903B;&#x8F91;&#xFF1A;&#x533B;&#x7597;&#x8D44;&#x6E90;&#x662F;&#x6709;&#x9650;&#x7684;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x5E0C;&#x671B;&#x6700;&#x5FEB;&#x7684;&#x65F6;&#x95F4;&#x5F97;&#x5230;&#x6700;&#x597D;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x4E5F;&#x8BB8;&#x5728;&#x666E;&#x901A;&#x60C5;&#x5883;&#x4E0B;&#x8F83;&#x597D;&#x89E3;&#x51B3;&#x2014;&#x2014;&#x5927;&#x5BB6;&#x9884;&#x7EA6;&#xFF0C;&#x6309;&#x7167;&#x65F6;&#x95F4;&#x6709;&#x5E8F;&#x8FDB;&#x884C;&#x3002;&#x4F46;&#x5728;&#x533B;&#x9662;&#xFF0C;&#x7EDD;&#x5BF9;&#x6709;&#x5E8F;&#x72B6;&#x6001;&#x4E0D;&#x6613;&#x5B58;&#x5728;&#x2014;&#x2014;&#x5728;&#x75BE;&#x75C5;&#x3001;&#x96BE;&#x53D7;&#x3001;&#x75DB;&#x82E6;&#x9762;&#x524D;&#xFF0C;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x5E0C;&#x671B;&#x300C;&#x7ACB;&#x523B;&#x300D;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x5373;&#x4F7F;&#x6709;&#x89C4;&#x5219;&#x5236;&#x7EA6;&#xFF0C;&#x4E5F;&#x4F1A;&#x672C;&#x80FD;&#x6027;&#x7684;&#x7126;&#x8E81;&#x4E8E;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x6253;&#x7834;&#x89C4;&#x5219;&#xFF0C;&#x53D8;&#x6210;&#x300C;&#x7279;&#x4F8B;&#x300D;&#xFF0C;&#x540E;&#x8005;&#x53D8;&#x6210;&#x300C;&#x4F18;&#x5F85;&#x300D;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x533B;&#x9662;&#x751F;&#x5B58;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5728;&#x7406;&#x89E3;&#x6E38;&#x620F;&#x89C4;&#x5219;&#x7684;&#x57FA;&#x7840;&#x4E0B;&#xFF0C;&#x6D3B;&#x5B66;&#x6D3B;&#x7528;&#x4E9B;&#x300C;&#x65C1;&#x95E8;&#x5DE6;&#x9053;&#x300D;&#x6765;&#x63D0;&#x9AD8;&#x81EA;&#x5DF1;&#x83B7;&#x53D6;&#x533B;&#x7597;&#x8D44;&#x6E90;&#x7684;&#x6548;&#x7387;&#x3002;</p>
<p>&#x5728;&#x62CD;&#x5B8C;&#x5F69;&#x8D85;&#x63A8;&#x7237;&#x7237;&#x56DE;&#x53BB;&#x7684;&#x8DEF;&#x4E0A;&#xFF0C;&#x6211;&#x8BF4;&#x7ED9;&#x8001;&#x7237;&#x5B50;&#x62CD;&#x4E2A;&#x7167;&#x7247;&#xFF0C;&#x7ED3;&#x679C;&#x4E0D;&#x77E5;&#x9053;&#x4E3A;&#x4EC0;&#x4E48;&#x7237;&#x7237;&#x7A81;&#x7136;&#x60C5;&#x7EEA;&#x6FC0;&#x52A8;&#x7684;&#x54ED;&#x4E86;&#x8D77;&#x6765;&#x3002;&#x4E4B;&#x524D;&#x7237;&#x7237;&#x4E0D;&#x592A;&#x4F1A;&#x54ED;&#xFF0C;&#x8FD9;&#x51E0;&#x5929;&#x54ED;&#x4E86;&#x597D;&#x51E0;&#x6B21;&#xFF0C;&#x770B;&#x5230;&#x4ED6;&#x54ED;&#x5176;&#x5B9E;&#x6211;&#x5185;&#x5FC3;&#x5F88;&#x96BE;&#x53D7;&#xFF0C;&#x4F46;&#x662F;&#x8F6C;&#x8FC7;&#x6765;&#x60F3;&#xFF0C;&#x8FD9;&#x4E5F;&#x8BF4;&#x660E;&#x7237;&#x7237;&#x7684;&#x610F;&#x8BC6;&#x72B6;&#x6001;&#x66F4;&#x597D;&#x4E86;&#xFF0C;&#x6709;&#x60C5;&#x7EEA;&#x7684;&#x8868;&#x8FBE;&#x624D;&#x66F4;&#x50CF;&#x4E00;&#x4E2A;&#x5065;&#x5EB7;&#x7684;&#x4EBA;&#xFF0C;&#x8FD9;&#x6837;&#x5B50;&#x60F3;&#x6765;&#x89C9;&#x5F97;&#x662F;&#x597D;&#x4E8B;&#x60C5;&#x3002;</p>
<p><img src="http://static.zybuluo.com/whiledoing/vybl6qye1w3zy6wyslbkutff/image_1c1dghu1e6mr18v81p8i1ja0dni9.png" alt="image_1c1dghu1e6mr18v81p8i1ja0dni9.png-873.3kB"></p>
<p>&#x665A;&#x4E0A;&#xFF0C;&#x59D1;&#x59D1;&#x5582;&#x4E86;&#x7237;&#x7237;&#x5403;&#x4E86;&#x7EA6;&#x534A;&#x7897;&#x665A;&#x996D;&#x540E;&#xFF0C;&#x8001;&#x7237;&#x5B50;&#x5C31;&#x4E0D;&#x5403;&#x4E86;&#xFF0C;&#x8981;&#x7761;&#x89C9;&#x3002;&#x6211;&#x8BA9;&#x59D1;&#x59D1;&#x56DE;&#x53BB;&#xFF0C; &#x6211;&#x6765;&#x503C;&#x5B88;&#xFF0C;&#x8D81;&#x4ED6;&#x7761;&#x89C9;&#x8FD9;&#x4F1A;&#xFF0C;&#x6211;&#x5C31;&#x5F00;&#x59CB;&#x7422;&#x78E8;&#x300C;&#x5982;&#x4F55;&#x8BA9;&#x7237;&#x7237;&#x66F4;&#x5FEB;&#x66F4;&#x6709;&#x6548;&#x5730;&#x5403;&#x66F4;&#x591A;&#x7684;&#x996D;&#xFF1F;&#x300D;&#x3002;&#x505A;&#x4E3A;&#x4E00;&#x4E2A;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x7406;&#x5DE5;&#x7537;&#xFF0C;&#x6700;&#x559C;&#x6B22;&#x7684;&#x5C31;&#x662F;&#x9010;&#x4E00;&#x5217;&#x51FA;&#xFF0C;&#x7EFC;&#x5408;&#x8003;&#x8651;&#xFF0C;&#x6743;&#x8861;&#x5229;&#x5F0A;&#x540E;&#x5236;&#x5B9A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x5148;&#x5206;&#x6790;&#x95EE;&#x9898;&#xFF1A;</p>
<ul>
<li>&#x5403;&#x996D;&#x5403;&#x5403;&#x5C31;&#x4F1A;&#x72AF;&#x56F0;&#xFF0C;&#x56F0;&#x4E86;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x5582;&#x996D;&#x3002;</li>
<li>&#x60C5;&#x7EEA;&#x6FC0;&#x52A8;&#x7684;&#x65F6;&#x5019;&#x6CA1;&#x6CD5;&#x5582;&#x996D;&#x3002;</li>
<li>&#x5750;&#x7684;&#x65F6;&#x95F4;&#x4E45;&#x4E86;&#xFF0C;&#x7237;&#x7237;&#x9700;&#x8981;&#x7FFB;&#x8EAB;&#x8C03;&#x6574;&#x4F53;&#x4F4D;&#xFF0C;&#x4E00;&#x65E6;&#x4FA7;&#x8EAB;&#x8EBA;&#x7740;&#x5C31;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x5582;&#x996D;&#x3002;</li>
<li>&#x5403;&#x996D;&#x9700;&#x8981;&#x5582;&#x6D41;&#x98DF;&#xFF0C;&#x51C6;&#x5907;&#x5DE5;&#x4F5C;&#x8F83;&#x957F;&#xFF0C;&#x800C;&#x5582;&#x98DF;&#x65F6;&#x95F4;&#x8D8A;&#x4E45;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x4E0D;&#x505C;&#x7684;&#x70ED;&#x996D;&#xFF0C;&#x5EF6;&#x957F;&#x4E86;&#x5582;&#x98DF;&#x65F6;&#x95F4;&#x3002;</li>
<li>&#x5403;&#x996D;&#x8981;&#x4E00;&#x52FA;&#x4E00;&#x52FA;&#x5C0F;&#x8BA1;&#x91CF;&#x7684;&#x5582;&#xFF0C;&#x56E0;&#x4E3A;&#x7237;&#x7237;&#x73B0;&#x5728;&#x541E;&#x54BD;&#x529F;&#x80FD;&#x5B58;&#x5728;&#x969C;&#x788D;&#xFF0C;&#x8981;&#x975E;&#x5E38;&#x5C0F;&#x5FC3;&#x8BEF;&#x5438;&#xFF0C;&#x5582;&#x6C34;&#x4E5F;&#x9700;&#x8981;&#x52A0;&#x987A;&#x54BD;&#x5242;&#x3002;</li>
<li>&#x7531;&#x4E8E;&#x5FC3;&#x810F;&#x5B58;&#x5728;&#x623F;&#x98A4;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x5403;&#x4E00;&#x4F1A;&#x5C31;&#x4F1A;&#x5598;&#xFF0C;&#x9700;&#x8981;&#x5B9A;&#x671F;&#x4F11;&#x606F;&#x3002;</li>
</ul>
<p>&#x9274;&#x4E8E;&#x4E0A;&#x9762;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x60F3;&#x4E86;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x6267;&#x884C;&#x65B9;&#x6848;&#xFF1A;</p>
<ul>
<li>&#x63D0;&#x524D;&#x505A;&#x597D;&#x51C6;&#x5907;&#x5DE5;&#x4F5C;&#xFF1A;&#x51C6;&#x5907;&#x4E09;&#x4E2A;&#x7897;&#xFF0C;&#x4E00;&#x4E2A;&#x88C5;&#x6C34;&#xFF0C;&#x4E00;&#x4E2A;&#x88C5;&#x8425;&#x517B;&#x6DB2;&#xFF0C;&#x4E00;&#x4E2A;&#x88C5;&#x996D;&#x83DC;&#xFF1B;&#x7528;&#x996D;&#x76D2;&#x88C5;&#x70ED;&#x6C34;&#xFF0C;&#x7528;&#x6765;&#x52A0;&#x70ED;&#x5582;&#x98DF;&#x8FC7;&#x7A0B;&#x4E2D;&#x51B7;&#x6389;&#x7684;&#x996D;&#x83DC;&#xFF1B;&#x8138;&#x76C6;&#x4E2D;&#x88C5;&#x6EE1;&#x70ED;&#x6C34;&#x548C;&#x6BDB;&#x5DFE;&#xFF1B;&#x996D;&#x83DC;&#x6253;&#x6210;&#x7CCA;&#x72B6;&#x3002;</li>
<li>&#x5148;&#x5582;&#x6C34;&#x987A;&#x80C3;&#xFF0C;&#x7136;&#x540E;&#x4E3B;&#x5582;&#x996D;&#xFF0C;&#x5403;&#x7684;&#x7D2F;&#x4E86;&#x7528;&#x8425;&#x517B;&#x6DB2;&#x5F53;&#x6C34;&#x8C03;&#x8C03;&#x53E3;&#xFF0C;&#x5B9E;&#x5728;&#x5403;&#x4E0D;&#x4E0B;&#x518D;&#x5582;&#x70B9;&#x6C34;&#xFF0C;&#x5207;&#x6362;&#x4E0A;&#x4E0B;&#x6587;&#x8BA9;&#x4ED6;&#x89C9;&#x5F97;&#x4E0D;&#x662F;&#x53EA;&#x5728;&#x5403;&#x5355;&#x4E00;&#x7684;&#x98DF;&#x7269;&#xFF0C;&#x8FDB;&#x800C;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x7126;&#x8E81;&#x3002;</li>
<li>&#x5C06;&#x6362;&#x4E0B;&#x6765;&#x4E0D;&#x5582;&#x7684;&#x7897;&#x653E;&#x5728;&#x996D;&#x76D2;&#x7684;&#x70ED;&#x6C34;&#x4E2D;&#x4FDD;&#x6E29;&#x3002;</li>
<li>&#x5982;&#x679C;&#x5403;&#x7684;&#x6709;&#x4E9B;&#x70E6;&#x8E81;&#x4E86;&#xFF0C;&#x6216;&#x8005;&#x56F0;&#x4E86;&#xFF0C;&#x5C31;&#x7528;&#x70ED;&#x6BDB;&#x5DFE;&#x7ED9;&#x4ED6;&#x64E6;&#x8138;&#xFF0C;&#x64E6;&#x8116;&#x5B50;&#xFF0C;&#x8FD9;&#x6837;&#x5B50;&#x65E2;&#x53EF;&#x4EE5;&#x5B89;&#x629A;&#x4ED6;&#x7684;&#x60C5;&#x7EEA;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x53BB;&#x6389;&#x56F0;&#x610F;&#xFF0C;&#x662F;&#x4E2A;&#x597D;&#x529E;&#x6CD5;&#x3002;</li>
<li>&#x5982;&#x679C;&#x8981;&#x4FA7;&#x8EAB;&#xFF0C;&#x5C31;&#x54C4;&#x4ED6;&#x8BF4;&#x6CA1;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x5269;&#x4E00;&#x70B9;&#x70B9;&#x996D;&#x83DC;&#x4E86;&#xFF0C;&#x5403;&#x5B8C;&#x5C31;&#x7FFB;&#x8EAB;&#xFF0C;&#x5F80;&#x5F80;&#x4ED6;&#x4E5F;&#x80FD;&#x77E5;&#x9053;&#x6709;&#x6761;&#x4EF6;&#x4EA4;&#x6362;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x80FD;&#x8D77;&#x5230;&#x5B89;&#x629A;&#x4F5C;&#x7528;&#x3002;</li>
<li>&#x80FD;&#x5403;&#x5C31;&#x5C3D;&#x91CF;&#x8BA9;&#x4ED6;&#x5403;&#xFF0C;&#x4E0D;&#x505C;&#x6B47;&#x3002;</li>
<li>&#x5403;&#x7D2F;&#x7684;&#x65F6;&#x5019;&#x8BA9;&#x4ED6;&#x4F11;&#x606F;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x53BB;&#x505A;&#x76F8;&#x5173;&#x51C6;&#x5907;&#x5DE5;&#x4F5C;&#xFF1A;&#x6BD4;&#x5982;&#x8C03;&#x6574;&#x6C34;&#x6E29;&#xFF0C;&#x52A0;&#x6C34;&#xFF0C;&#x52A0;&#x996D;&#x83DC;&#xFF0C;&#x6D17;&#x6BDB;&#x5DFE;&#x7B49;&#x3002;</li>
<li>&#x5404;&#x79CD;&#x78E8;&#x3002;</li>
</ul>
<p>&#x6309;&#x7167;&#x8FD9;&#x4E2A;&#x65B9;&#x9488;&#xFF0C;&#x665A;&#x4E0A;&#x6211;&#x4ECE;7&#x70B9;&#x5F00;&#x59CB;&#x5582;&#xFF0C;&#x76F4;&#x5230;10&#x70B9;&#xFF0C;&#x521B;&#x7EAA;&#x5F55;&#x7684;&#x5582;&#x4E86;&#x4ED6;650ml&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x6B63;&#x5E38;&#x4EBA;&#x53EF;&#x80FD;&#x4E0D;&#x7B97;&#x4EC0;&#x4E48;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x7237;&#x7237;&#x73B0;&#x5728;&#x7684;&#x8EAB;&#x4F53;&#x72B6;&#x51B5;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x7740;&#x5B9E;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x5927;&#x4E0D;&#x5C0F;&#x7684;&#x6210;&#x5C31;&#x3002;&#x4F46;&#x53CD;&#x8FC7;&#x6765;&#x770B;&#xFF0C;&#x8FD9;&#x57FA;&#x672C;&#x7B97;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x770B;&#x62A4;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x6781;&#x9650;&#x64CD;&#x4F5C;&#x4E86;&#xFF0C;&#x4F46;&#x8FD9;&#x53EA;&#x662F;&#x8BA9;&#x4ED6;&#x8FD9;&#x987F;&#x996D;&#x6B21;&#x7684;&#x4EFB;&#x52A1;&#x8FBE;&#x6807;&#xFF0C;&#x770B;&#x6765;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x7EC8;&#x7A76;&#x8FD8;&#x662F;&#x4EFB;&#x91CD;&#x800C;&#x9053;&#x8FDC;&#x7684;&#x3002;</p>
<p>&#x53C8;&#x53CA;&#xFF0C;&#x665A;&#x4E0A;&#x5582;&#x7237;&#x7237;&#x521B;&#x9020;&#x7EAA;&#x5F55;&#x7684;&#x8BB0;&#x5F55;&#x8868;&#xFF1A;</p>
<p><img src="http://static.zybuluo.com/whiledoing/87r160gxqop9ec7yyvkdurpn/image_1c1dgj0e3r0n308u9dol418hrm.png" alt="image_1c1dgj0e3r0n308u9dol418hrm.png-1362.3kB"></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://whiledoing.github.io/2017/12/12/diary/diary-2017-12-11-MON/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="whiledoing">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/images/avatar.jpeg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="whiledoing">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="/2017/12/12/diary/diary-2017-12-11-MON/" itemprop="url">diary-2017-12-11-MON</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2017-12-12T11:10:25+08:00">
                2017-12-12
              </time>
            

            
              <span class="post-meta-divider">|</span>
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-check-o"></i>
              </span>
              
                <span class="post-meta-item-text">更新于&#58;</span>
              
              <time title="更新于" itemprop="dateModified" datetime="2017-12-12T11:11:07+08:00">
                2017-12-12
              </time>
            
          </span>

          

          
            
          

          
          

          

          
            <div class="post-wordcount">
              
                
                  <span class="post-meta-divider">|</span>
                
                <span class="post-meta-item-icon">
                  <i class="fa fa-file-word-o"></i>
                </span>
                
                  <span class="post-meta-item-text">字数统计&#58;</span>
                
                <span title="字数统计">
                  686
                </span>
              

              

              
            </div>
          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body han-init-context" itemprop="articleBody">

      
      

      
        
          
            <p>&#x4ECA;&#x5929;&#x662F;&#x7237;&#x7237;&#x751F;&#x75C5;&#x4F4F;&#x9662;&#x7684;&#x7B2C;27&#x5929;&#x3002;</p>
<p>&#x65E9;&#x4E0A;&#x6211;6&#x70B9;&#x591A;&#x9192;&#x6765;&#xFF0C;&#x7ED3;&#x679C;&#x59D1;&#x59D1;&#x544A;&#x8BC9;&#x6211;&#x6628;&#x5929;&#x4ED6;&#x4EEC;&#x5B89;&#x6392;&#x5976;&#x5976;&#x548C;&#x4E09;&#x5A76;&#x65E9;&#x70B9;&#x8FC7;&#x53BB;&#x4E0A;&#x767D;&#x73ED;&#xFF0C;&#x6211;&#x4E2D;&#x5348;&#x8FC7;&#x53BB;&#x5C31;&#x53EF;&#x4EE5;&#xFF0C;&#x4F46;&#x662F;&#x4ED6;&#x4EEC;&#x5FD8;&#x8BB0;&#x544A;&#x8BC9;&#x6211;&#x8FD9;&#x4E2A;&#x5B89;&#x6392;&#x3002;&#x6211;&#x60F3;&#x4E86;&#x4E0B;&#xFF0C;&#x4ECA;&#x5929;&#x5468;&#x4E00;&#xFF0C;&#x7237;&#x7237;&#x7684;&#x5EB7;&#x590D;&#x6CBB;&#x7597;&#x8BA1;&#x5212;&#x8FD8;&#x9700;&#x8981;&#x8FDB;&#x4E00;&#x6B65;&#x8C03;&#x6574;&#xFF0C;&#x56E0;&#x4E3A;&#x4E4B;&#x524D;&#x7684;&#x9884;&#x7EA6;&#x5B89;&#x6392;&#x5B9E;&#x5728;&#x662F;&#x5728;&#x96BE;&#x4EE5;&#x8FDB;&#x884C;&#xFF0C;&#x6240;&#x4EE5;&#x8FD8;&#x662F;&#x6211;&#x53BB;&#x534F;&#x8C03;&#x5B89;&#x6392;&#x4E0B;&#x6BD4;&#x8F83;&#x597D;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x544A;&#x8BC9;&#x59D1;&#x59D1;&#xFF0C;&#x8FD8;&#x662F;&#x6211;&#x53BB;&#x3002;</p>
<p>&#x65E9;&#x4E0A;&#x8FC7;&#x6765;&#xFF0C;&#x7B2C;&#x4E00;&#x4EF6;&#x4E8B;&#x5C31;&#x662F;&#x95EE;&#x4E0B;&#x6628;&#x5929;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x7237;&#x7237;&#x8FD8;&#x662F;&#x57FA;&#x672C;&#x4E00;&#x591C;&#x6CA1;&#x7761;&#xFF0C;&#x6211;&#x8BA9;&#x62A4;&#x5DE5;&#x5E08;&#x5085;&#x80FD;&#x62BD;&#x7A7A;&#x8DB4;&#x4F1A;&#x5C31;&#x8DB4;&#x4F1A;&#x3002;&#x6211;&#x7ED9;&#x7237;&#x7237;&#x5582;&#x4E86;&#x65E9;&#x996D;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x7422;&#x78E8;&#x5982;&#x4F55;&#x8C03;&#x6574;&#x5EB7;&#x590D;&#x6CBB;&#x7597;&#x8BA1;&#x5212;&#xFF0C;&#x627E;&#x4E86;&#x5BF9;&#x5E94;&#x7684;&#x8D1F;&#x8D23;&#x533B;&#x751F;&#x534F;&#x8C03;&#xFF0C;&#x8FD8;&#x597D;&#x4E8B;&#x60C5;&#x6BD4;&#x6211;&#x60F3;&#x8C61;&#x4E2D;&#x8FDB;&#x884C;&#x7684;&#x8981;&#x987A;&#x5229;&#x3002;&#x8FC7;&#x4E86;&#x4F1A;&#xFF0C;&#x79D1;&#x4E3B;&#x4EFB;&#x6765;&#x67E5;&#x623F;&#xFF0C;&#x8BE2;&#x95EE;&#x4E86;&#x76F8;&#x5173;&#x60C5;&#x51B5;&#xFF0C;&#x8C03;&#x6574;&#x4E86;&#x4E00;&#x4E9B;&#x6CBB;&#x7597;&#x8BA1;&#x5212;&#x548C;&#x5B89;&#x6392;&#xFF0C;&#x5E76;&#x544A;&#x8BC9;&#x6211;&#x665A;&#x4E0A;&#x4F1A;&#x8C03;&#x6574;&#x7528;&#x836F;&#xFF0C;&#x6765;&#x8C03;&#x8282;&#x7237;&#x7237;&#x767D;&#x591C;&#x98A0;&#x5012;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x4E2D;&#x5348;&#x4E09;&#x5A76;&#x548C;&#x5976;&#x5976;&#x6765;&#x5230;&#x533B;&#x9662;&#xFF0C;&#x7ED9;&#x7237;&#x7237;&#x5E26;&#x4E86;&#x5BB6;&#x91CC;&#x716E;&#x7684;&#x767D;&#x83DC;&#x7CA5;&#xFF0C;&#x5C06;&#x5176;&#x548C;&#x98DF;&#x5802;&#x8C03;&#x914D;&#x7684;&#x8425;&#x517B;&#x6DB2;&#x642D;&#x8D77;&#x6765;&#x7ED9;&#x7237;&#x7237;&#x5403;&#x3002;&#x7ED9;&#x7237;&#x7237;&#x5582;&#x98DF;&#x662F;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#x6D3B;&#xFF0C;&#x66F4;&#x662F;&#x4E00;&#x4E2A;&#x8010;&#x5FC3;&#x6D3B;&#x3002;&#x56E0;&#x4E3A;&#x7237;&#x7237;&#x57FA;&#x672C;&#x5403;&#x4E00;&#x70B9;&#x5C31;&#x4E0D;&#x592A;&#x60F3;&#x5403;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4E0D;&#x505C;&#x7684;&#x548C;&#x4ED6;&#x300C;&#x7EA0;&#x7F20;&#x300D;&#xFF0C;&#x7528;&#x300C;&#x65F6;&#x95F4;&#x300D;&#x6765;&#x586B;&#x6EE1;&#x7237;&#x7237;&#x7684;&#x300C;&#x80C3;&#x300D;&#x3002;</p>
<p>&#x4E0B;&#x5348;&#x7237;&#x7237;&#x53BB;&#x8FDB;&#x884C;&#x300C;&#x8A00;&#x8BED;&#x5EB7;&#x590D;&#x6CBB;&#x7597;&#x300D;&#xFF0C;&#x4E09;&#x5A76;&#x966A;&#x540C;&#xFF0C;&#x5979;&#x544A;&#x8BC9;&#x6211;&#x8BF4;&#xFF0C;&#x7237;&#x7237;&#x4ECA;&#x5929;&#x7CBE;&#x795E;&#x8FD8;&#x4E0D;&#x9519;&#xFF0C;&#x5728;&#x7535;&#x6781;&#x7247;&#x7684;&#x523A;&#x6FC0;&#x4E0B;&#x53EF;&#x4EE5;&#x6A21;&#x7CCA;&#x7684;&#x5B66;&#x7740;&#x8BF4;&#x4E9B;&#x5B57;&#x51FA;&#x6765;&#xFF0C;&#x8FD9;&#x8BA9;&#x5976;&#x5976;&#x5F88;&#x5F00;&#x5FC3;&#x3002;&#x4E4B;&#x540E;&#x6211;&#x53C8;&#x63A8;&#x7740;&#x7237;&#x7237;&#x53BB;&#x62CD;&#x6444;&#x80F8;&#x8154;CT&#xFF0C;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#x624D;&#x8BA9;&#x7237;&#x7237;&#x4ECE;&#x8F6E;&#x6905;&#x4E0A;&#x4E0B;&#x6765;&#x56DE;&#x5230;&#x5E8A;&#x4E0A;&#x4F11;&#x606F;&#x3002;&#x7B97;&#x4E86;&#x4E0B;&#xFF0C;&#x7237;&#x7237;&#x4ECA;&#x5929;&#x4E00;&#x5171;&#x5728;&#x8F6E;&#x6905;&#x4E0A;&#x5750;&#x4E86;&#x6709;&#x8FD1;3&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;&#x8FD9;&#x7B97;&#x662F;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x8BB0;&#x5F55;&#x4E86;&#xFF01;&#x867D;&#x7136;&#x5728;&#x7B49;&#x5019;&#x62CD;&#x6444;CT&#x7684;&#x65F6;&#x5019;&#x7237;&#x7237;&#x663E;&#x5F97;&#x6709;&#x4E9B;&#x7126;&#x8E81;&#xFF0C;&#x4F46;&#x5728;&#x6211;&#x548C;&#x62A4;&#x5DE5;&#x7684;&#x5B89;&#x629A;&#x4E0B;&#x4ED6;&#x4E5F;&#x80FD;&#x4FDD;&#x6301;&#x5FC3;&#x60C5;&#xFF0C;&#x6700;&#x540E;&#x4E5F;&#x987A;&#x5229;&#x5730;&#x5B8C;&#x6210;&#x4E86;CT&#x7684;&#x62CD;&#x6444;&#x3002;&#x800C;&#x5C31;&#x5728;&#x6628;&#x5929;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x6BB5;&#xFF0C;&#x7237;&#x7237;&#x57FA;&#x672C;&#x4E0A;&#x5750;&#x4E86;2&#x4E2A;&#x5C0F;&#x65F6;&#x5C31;&#x5F00;&#x59CB;&#x5404;&#x79CD;&#x7126;&#x8E81;&#x7684;&#x56B7;&#x56B7;&#xFF0C;&#x6211;&#x4EEC;&#x8BA9;&#x4ED6;&#x56DE;&#x53BB;&#x4E0A;&#x5E8A;&#x4F11;&#x606F;&#x624D;&#x5E73;&#x590D;&#x4E86;&#x4ED6;&#x7684;&#x5FC3;&#x60C5;&#x3002;&#x665A;&#x4E0A;&#x5A9B;&#x5A9B;&#x59B9;&#x59B9;&#x7ED9;&#x7237;&#x7237;&#x5582;&#x4E86;&#x665A;&#x996D;&#xFF0C;&#x5168;&#x8FC7;&#x7A0B;&#x8FD1;&#x4E00;&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;&#x7237;&#x7237;&#x90FD;&#x6BD4;&#x8F83;&#x5E73;&#x9759;&#xFF0C;&#x6CA1;&#x6709;&#x600E;&#x4E48;&#x5435;&#x95F9;&#xFF0C;&#x8FD9;&#x8BA9;&#x6211;&#x548C;&#x5A9B;&#x5A9B;&#x90FD;&#x89C9;&#x5F97;&#x975E;&#x5E38;&#x7684;&#x4E0D;&#x53EF;&#x601D;&#x8BAE;&#xFF0C;&#x60F3;&#x7740;&#x662F;&#x4E0D;&#x662F;&#x533B;&#x751F;&#x767D;&#x5929;&#x8C03;&#x4E86;&#x4EC0;&#x4E48;&#x836F;&#x8BA9;&#x4ED6;&#x5982;&#x6B64;&#x5E73;&#x9759;&#xFF0C;&#x4E0D;&#x8FC7;&#x600E;&#x4E48;&#x770B;&#x6765;&#x8FD9;&#x90FD;&#x662F;&#x4E00;&#x4EF6;&#x597D;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x53C8;&#x53CA;&#xFF0C;&#x8C03;&#x6574;&#x540E;&#x7237;&#x7237;&#x7684;&#x6CBB;&#x7597;&#x65F6;&#x95F4;&#x8868;&#xFF1A;</p>
<p><img src="http://static.zybuluo.com/whiledoing/493ea06s2rpib4ota27mlhsb/image_1c14b8hik1igs1fr617ur39g1tkq9.png" alt="image_1c14b8hik1igs1fr617ur39g1tkq9.png-1155.2kB"></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://whiledoing.github.io/2017/12/12/diary/diary-2017-12-10-SUN/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="whiledoing">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/images/avatar.jpeg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="whiledoing">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="/2017/12/12/diary/diary-2017-12-10-SUN/" itemprop="url">diary-2017-12-10-SUN</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2017-12-12T11:01:27+08:00">
                2017-12-12
              </time>
            

            
              <span class="post-meta-divider">|</span>
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-check-o"></i>
              </span>
              
                <span class="post-meta-item-text">更新于&#58;</span>
              
              <time title="更新于" itemprop="dateModified" datetime="2017-12-12T11:09:46+08:00">
                2017-12-12
              </time>
            
          </span>

          

          
            
          

          
          

          

          
            <div class="post-wordcount">
              
                
                  <span class="post-meta-divider">|</span>
                
                <span class="post-meta-item-icon">
                  <i class="fa fa-file-word-o"></i>
                </span>
                
                  <span class="post-meta-item-text">字数统计&#58;</span>
                
                <span title="字数统计">
                  1,641
                </span>
              

              

              
            </div>
          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body han-init-context" itemprop="articleBody">

      
      

      
        
          
            <p>&#x4ECA;&#x5929;&#x662F;&#x7237;&#x7237;&#x751F;&#x75C5;&#x4F4F;&#x9662;&#x7684;&#x7B2C;26&#x5929;&#x3002;</p>
<p>&#x65E9;&#x4E0A;&#x5976;&#x5976;&#x8FC7;&#x53BB;&#x4E86;&#xFF0C;&#x8BF4;&#x8BA9;&#x6211;&#x597D;&#x597D;&#x4F11;&#x606F;&#xFF0C;&#x4E0B;&#x5348;&#x548C;&#x4E09;&#x5A76;&#x4E00;&#x8D77;&#x8FC7;&#x53BB;&#x3002;&#x6240;&#x4EE5;&#x65E9;&#x4E0A;&#x6211;&#x96BE;&#x5F97;&#x7761;&#x4E86;&#x4E00;&#x4E2A;&#x61D2;&#x89C9;&#xFF0C;&#x7B97;&#x662F;&#x5077;&#x5F97;&#x6D6E;&#x751F;&#x534A;&#x65E5;&#x95F2;&#x4E86;&#x3002;&#x672C;&#x6765;&#x60F3;&#x5403;&#x8FC7;&#x5348;&#x996D;&#x8FC7;&#x53BB;&#xFF0C;&#x4F46;&#x662F;&#x4E2D;&#x5348;&#x5976;&#x5976;&#x7ED9;&#x6211;&#x6253;&#x7535;&#x8BDD;&#xFF0C;&#x8BF4;&#x4E2D;&#x5348;&#x62A4;&#x5DE5;&#x5E08;&#x5085;&#x56DE;&#x5BB6;&#x5403;&#x996D;&#x4F11;&#x606F;&#xFF0C;&#x7237;&#x7237;&#x8981;&#x7FFB;&#x8EAB;&#x5C31;&#x4E00;&#x76F4;&#x95F9;&#xFF0C;&#x5976;&#x5976;&#x627E;&#x4E86;&#x9694;&#x58C1;&#x5E8A;&#x7684;&#x5E08;&#x5085;&#x5E2E;&#x5FD9;&#x7FFB;&#x4E86;&#x4E2A;&#x8EAB;&#x3002;&#x770B;&#x6765;&#x7237;&#x7237;&#x95F9;&#x5F97;&#x6709;&#x4E9B;&#x5389;&#x5BB3;&#xFF0C;&#x5976;&#x5976;&#x6709;&#x4E9B;&#x5FC3;&#x6025;&#xFF0C;&#x6211;&#x4E5F;&#x62C5;&#x5FC3;&#x7237;&#x7237;&#x4E2D;&#x5348;&#x8981;&#x662F;&#x4E00;&#x76F4;&#x95F9;&#xFF0C;&#x9694;&#x58C1;&#x53D7;&#x4E0D;&#x4E86;&#x518D;&#x6709;&#x5565;&#x51B2;&#x7A81;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x548C;&#x4E09;&#x5A76;&#x4E09;&#x4E0B;&#x4E94;&#x9664;&#x4E8C;&#x7684;&#x5403;&#x4E86;&#x5348;&#x996D;&#x5C31;&#x53BB;&#x4E86;&#x533B;&#x9662;&#x3002;</p>
<p>&#x7237;&#x7237;&#x6628;&#x5929;&#x665A;&#x4E0A;&#x8FD8;&#x662F;&#x6CA1;&#x6709;&#x600E;&#x4E48;&#x7761;&#xFF0C;&#x6298;&#x817E;&#x7684;&#x5389;&#x5BB3;&#xFF0C;&#x770B;&#x62A4;&#x5DE5;&#x5E08;&#x5085;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x7684;&#x75B2;&#x5026;&#xFF0C;&#x60F3;&#x6765;&#x5E94;&#x8BE5;&#x5982;&#x6B64;&#xFF0C;&#x4E5F;&#x8BF4;&#x660E;&#x62A4;&#x5DE5;&#x5E08;&#x5085;&#x5E94;&#x8BE5;&#x8FD8;&#x662F;&#x7528;&#x5FC3;&#x7167;&#x6599;&#x7684;&#x3002;&#x540E;&#x6765;&#xFF0C;&#x6211;&#x53C8;&#x62BD;&#x7A7A;&#x8D81;&#x62A4;&#x5DE5;&#x5E08;&#x5085;&#x4E0D;&#x6CE8;&#x610F;&#x7684;&#x65F6;&#x5019;&#x95EE;&#x4E86;&#x4E0B;&#x65C1;&#x8FB9;&#x5E8A;&#x7684;&#x5E08;&#x5085;&#x6628;&#x5929;&#x665A;&#x4E0A;&#x60C5;&#x51B5;&#x5982;&#x4F55;&#xFF0C;&#x4ED6;&#x8BF4;&#x62A4;&#x5DE5;&#x7167;&#x6599;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x7528;&#x5FC3;&#x7684;&#xFF0C;&#x81F3;&#x5C11;&#x7237;&#x7237;&#x6709;&#x5565;&#x53EB;&#x5524;&#x90FD;&#x4F1A;&#x6BD4;&#x8F83;&#x7ACB;&#x523B;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x62A4;&#x5DE5;&#x7684;&#x4E8B;&#x60C5;&#x7EC8;&#x4E8E;&#x7B97;&#x662F;&#x5FC3;&#x91CC;&#x8E0F;&#x5B9E;&#x4E86;&#x3002;</p>
<p>&#x4ECA;&#x5929;&#x6211;&#x544A;&#x8BC9;&#x62A4;&#x5DE5;&#x674E;&#x5E08;&#x5085;&#xFF0C;&#x6211;&#x4EEC;&#x591C;&#x73ED;&#x4E0A;&#x4E0B;&#x534A;&#x573A;&#xFF0C;&#x6211;&#x4E0A;&#x534A;&#x573A;&#x503C;&#x73ED;&#x5230;10&#x70B9;&#x5DE6;&#x53F3;&#xFF0C;&#x4ED6;&#x4F11;&#x606F;&#xFF0C;&#x540E;&#x9762;&#x4ED6;&#x9876;&#x6211;&#x73ED;&#xFF0C;&#x8FD9;&#x6837;&#x5B50;&#x6211;&#x53EF;&#x4EE5;&#x56DE;&#x53BB;&#x4F11;&#x606F;&#xFF0C;&#x767D;&#x5929;&#x8FD8;&#x53EF;&#x4EE5;&#x6709;&#x7CBE;&#x795E;&#x6765;&#x966A;&#x62A4;&#x53C2;&#x4E0E;&#x5EB7;&#x590D;&#x8BAD;&#x7EC3;&#x3002;&#x5176;&#x5B9E;&#x867D;&#x7136;&#x662F;&#x662F;&#x5206;&#x4E24;&#x4E2A;&#x534A;&#x573A;&#xFF0C;&#x4F46;&#x5176;&#x5B9E;&#x538B;&#x529B;&#x5B8C;&#x5168;&#x4E0D;&#x4E00;&#x6837;&#x3002;&#x7237;&#x7237;&#x665A;&#x4E0A;&#x5403;&#x8FC7;&#x4E4B;&#x540E;&#x5230;11&#x70B9;&#x5DE6;&#x53F3;&#x5176;&#x5B9E;&#x7761;&#x5F97;&#x90FD;&#x8FD8;&#x53EF;&#x4EE5;&#xFF0C;&#x4E00;&#x822C;&#x5230;&#x540E;&#x534A;&#x591C;&#x624D;&#x7279;&#x522B;&#x7684;&#x4EA2;&#x594B;&#x4E0D;&#x60F3;&#x7761;&#x89C9;&#x3002;&#x6240;&#x4EE5;&#x540E;&#x534A;&#x591C;&#x7684;&#x538B;&#x529B;&#x548C;&#x524D;&#x534A;&#x591C;&#x5B8C;&#x5168;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x91CF;&#x7EA7;&#x7684;&#x3002;&#x665A;&#x4E0A;&#x6211;&#x5728;&#x7237;&#x7237;&#x7761;&#x5F97;&#x6BD4;&#x8F83;&#x5B89;&#x9038;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6574;&#x7406;&#x4E86;&#x4E00;&#x4E0B;&#x7167;&#x987E;&#x7237;&#x7237;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x5730;&#x65B9;&#xFF1A;</p>
<ul>
<li>&#x7237;&#x7237;&#x7684;&#x9700;&#x6C42;&#x4E3B;&#x8981;&#x6709;&#x51E0;&#x4E2A;&#x70B9;&#xFF1A;&#x559D;&#x6C34;&#x3001;&#x7FFB;&#x8EAB;&#x3001;&#x8C03;&#x6574;&#x5E8A;&#x5934;&#x9AD8;&#x5EA6;&#x3001;&#x6709;&#x4EBA;&#x300C;&#x8010;&#x5FC3;&#x300D;&#x5730;&#x542C;&#x4ED6;&#x8BF4;&#x8BDD;&#x3001;&#x6C42;&#x62B1;&#x62B1;&#x3002;</li>
<li>&#x5C3D;&#x91CF;&#x4E0D;&#x8981;&#x548C;&#x7237;&#x7237;&#x505A;&#x5177;&#x4F53;&#x5185;&#x5BB9;&#x7684;&#x5BF9;&#x8BDD;&#xFF0C;&#x800C;&#x53EA;&#x662F;&#x548C;&#x4ED6;&#x8BF4;&#x300C;&#x597D;&#x300D;&#x300C;&#x6CA1;&#x95EE;&#x9898;&#x300D;&#x4E4B;&#x7C7B;&#x80AF;&#x5B9A;&#x8BDD;&#x8BED;&#xFF0C;&#x800C;&#x4E14;&#x8981;&#x9762;&#x5E26;&#x7B11;&#x5BB9;&#xFF0C;&#x4EE5;&#x5E73;&#x548C;&#x7684;&#x8BED;&#x6C14;&#x548C;&#x4ED6;&#x8BF4;&#xFF1B;&#x540C;&#x65F6;&#x63E1;&#x63E1;&#x4ED6;&#x7684;&#x624B;&#xFF0C;&#x6478;&#x6478;&#x4ED6;&#x7684;&#x8138;&#xFF0C;&#x987A;&#x7740;&#x5FC3;&#x53E3;&#xFF0C;&#x540E;&#x80CC;&#x5411;&#x4E0B;&#x629A;&#x6478;&#xFF0C;&#x5B89;&#x629A;&#x60C5;&#x7EEA;&#x3002;&#xFF08;&#x56E0;&#x4E3A;&#x4ED6;&#x8BF4;&#x8BDD;&#x591A;&#x6570;&#x65F6;&#x5019;&#x662F;&#x903B;&#x8F91;&#x4E0D;&#x6E05;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x8BF4;&#x7684;&#x8BDD;&#x4ED6;&#x4EA6;&#x542C;&#x4E0D;&#x61C2;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x6709;&#x6548;&#x7684;&#x5BF9;&#x8BDD;&#x5728;&#x4ED6;&#x8111;&#x5B50;&#x91CC;&#x300C;&#x53CD;&#x800C;&#x53EF;&#x80FD;&#x662F;&#x4E0D;&#x597D;&#x7684;&#x56DE;&#x590D;&#x300D;&#x3002;&#x56E0;&#x6B64;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x4E0D;&#x8981;&#x5BF9;&#x8BDD;&#xFF0C;&#x4EE5;&#x5B89;&#x629A;&#x4E3A;&#x4E3B;&#xFF0C;&#x4ED6;&#x662F;&#x53EF;&#x4EE5;&#x611F;&#x53D7;&#x5230;&#x6211;&#x4EEC;&#x8BF4;&#x8BDD;&#x65F6;&#x7684;&#x8868;&#x60C5;&#x548C;&#x60C5;&#x7EEA;&#xFF0C;&#x6240;&#x4EE5;&#x7B11;&#x5BB9;&#xFF0C;&#x80AF;&#x5B9A;&#x7684;&#x8BED;&#x6C14;&#xFF0C;&#x548C;&#x9002;&#x5F53;&#x7684;&#x80A2;&#x4F53;&#x5B89;&#x629A;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#xFF01;&#xFF09;</li>
<li>&#x5982;&#x679C;&#x611F;&#x53D7;&#x5230;&#x300C;&#x4ED6;&#x8BF4;&#x8BDD;&#x5F00;&#x59CB;&#x6FC0;&#x52A8;&#x300D;&#xFF0C;&#x4F3C;&#x6709;&#x6240;&#x9700;&#x6C42;&#xFF0C;&#x76F4;&#x63A5;&#x731C;&#x6D4B;&#x53EF;&#x80FD;&#x7684;&#x9700;&#x6C42;&#x5E76;&#x884C;&#x52A8;&#x53EF;&#x80FD;&#x6BD4;&#x8BE2;&#x95EE;&#x5F0F;&#x7684;&#x5BF9;&#x8BDD;&#x66F4;&#x6709;&#x6548;&#x3002;&#xFF08;&#x7565;&#x540C;&#x4E0A;&#x4E00;&#x6761;&#x7684;&#x903B;&#x8F91;&#x3002;&#x6BD4;&#x5982;&#x7237;&#x7237;&#x6709;&#x65F6;&#x5019;&#x53EF;&#x80FD;&#x8BF4;&#x597D;&#x591A;&#x5185;&#x5BB9;&#xFF0C;&#x8BF4;&#x4EC0;&#x4E48;3&#x4E2A;&#x6708;&#xFF0C;3&#x5E74;&#x4E86;&#xFF0C;&#x4F60;&#x4EEC;&#x90FD;&#x505A;&#x4E0D;&#x5230;&#xFF1B;&#x6216;&#x8005;&#x60C5;&#x7EEA;&#x300C;&#x6709;&#x4E9B;&#x6FC0;&#x52A8;&#x300D;&#x5730;&#x8BF4;&#x4E9B;&#x80E1;&#x4E71;&#x7684;&#x8BDD;&#x8BED;&#x7B49;&#x3002;&#x53EF;&#x80FD;&#x5B9E;&#x9645;&#x7684;&#x60C5;&#x51B5;&#x5C31;&#x662F;&#x4ED6;&#x8981;&#x559D;&#x6C34;&#x4E86;&#xFF0C;&#x76F4;&#x63A5;&#x628A;&#x624B;&#x653E;&#x5230;&#x4ED6;&#x5634;&#x8FB9;&#x78B0;&#x4E00;&#x78B0;&#xFF0C;&#x6216;&#x8005;&#x8200;&#x4E00;&#x52FA;&#x5B50;&#x6C34;&#x5230;&#x4ED6;&#x5634;&#x8FB9;&#x770B;&#x770B;&#x4ED6;&#x7684;&#x53CD;&#x9988;&#xFF0C;&#x5982;&#x679C;&#x4ED6;&#x5F20;&#x5927;&#x5634;&#xFF0C;&#x57FA;&#x672C;&#x5C31;&#x731C;&#x5BF9;&#x4E86;&#x9700;&#x6C42;&#xFF0C;&#x4ED6;&#x4E5F;&#x5C31;&#x4E0D;&#x518D;&#x60C5;&#x7EEA;&#x6FC0;&#x52A8;&#x7684;&#x8BF4;&#x8BDD;&#x4E86;&#xFF09;</li>
<li>&#x5982;&#x679C;&#x4ED6;&#x6BD4;&#x8F83;&#x5E73;&#x548C;&#x7684;&#x5F00;&#x59CB;&#x8BF4;&#x4E0D;&#x5C11;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#x9700;&#x8981;&#x6709;&#x4EBA;&#x300C;&#x8010;&#x5FC3;&#x542C;&#x4ED6;&#x8BF4;&#x8BDD;&#x300D;&#xFF0C;&#x4E00;&#x8FB9;&#x5B89;&#x629A;&#x4E00;&#x8FB9;&#x7ED9;&#x4ED6;&#x80AF;&#x5B9A;&#x7684;&#x56DE;&#x590D;&#xFF0C;&#x5E76;&#x542C;&#x4ED6;&#x8BF4;&#x8BDD;&#x5373;&#x53EF;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4ED6;&#x624B;&#x653E;&#x5230;&#x5634;&#x91CC;&#xFF0C;&#x6216;&#x8005;&#x78B0;&#x78B0;&#x7259;&#x9F7F;&#xFF08;&#x50CF;&#x662F;&#x8BF4;&#x7259;&#x75BC;&#xFF09;&#xFF0C;&#x5176;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x9700;&#x6C42;&#x662F;&#x8981;&#x300C;&#x559D;&#x6C34;&#x300D;&#x3002;</li>
<li>&#x8EBA;&#x5E8A;&#x4E0A;&#x559D;&#x6C34;&#x8981;&#x7565;&#x5FAE;&#x5C06;&#x5E8A;&#x5934;&#x6447;&#x8D77;&#x6765;&#xFF0C;&#x5E76;&#x5C0F;&#x5242;&#x91CF;&#x5582;&#x6C34;&#x3002;&#xFF08;&#x533B;&#x751F;&#x8BF4;&#x7237;&#x7237;&#x6709;&#x300C;&#x8BEF;&#x5438;&#x300D;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x8FD8;&#x662F;&#x8981;&#x7559;&#x610F;&#xFF09;</li>
<li>&#x4ED6;&#x559D;&#x6C34;&#x4E4B;&#x540E;&#x4F1A;&#x6447;&#x6447;&#x624B;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x662F;&#x8981;&#x544A;&#x8BC9;&#x4F60;&#x4ED6;&#x4E0D;&#x559D;&#x4E86;&#xFF0C;&#x800C;&#x662F;&#x544A;&#x8BC9;&#x4F60;&#x300C;&#x7A0D;&#x7B49;&#x4E00;&#x4E0B;&#xFF0C;&#x6211;&#x8FD8;&#x6CA1;&#x6709;&#x559D;&#x5B8C;&#xFF0C;&#x4F11;&#x606F;&#x4E00;&#x4E0B;&#x518D;&#x559D;&#x300D;&#xFF08;&#x53EF;&#x4EE5;&#x8FC7;&#x4E00;&#x4F1A;&#x518D;&#x5582;&#x5582;&#xFF0C;&#x591A;&#x8BD5;&#x4E00;&#x4E24;&#x6B21;&#xFF0C;&#x5982;&#x679C;&#x4ED6;&#x8FD8;&#x662F;&#x62D2;&#x7EDD;&#x90A3;&#x624D;&#x662F;&#x771F;&#x7684;&#x4E0D;&#x559D;&#x3002;&#x5403;&#x996D;&#x4EA6;&#x540C;&#x7406;&#xFF0C;&#x8981;&#x591A;&#x8BD5;&#x51E0;&#x6B21;&#x3002;&#xFF09;</li>
<li>&#x5982;&#x679C;&#x4ED6;&#x8EAB;&#x4F53;&#x6709;&#x5DE6;&#x53F3;&#x6447;&#x6643;&#x503E;&#x5411;&#xFF0C;&#x6216;&#x8005;&#x624B;&#x4E0D;&#x505C;&#x7684;&#x4FA7;&#x5411;&#x4E00;&#x8FB9;&#x53D1;&#x529B;&#xFF0C;&#x591A;&#x6570;&#x662F;&#x8981;&#x7FFB;&#x8EAB;&#x3002;&#xFF08;&#x53EF;&#x4EE5;&#x8BD5;&#x7740;&#x5C06;&#x5176;&#x8EAB;&#x4F53;&#x62B1;&#x4F4F;&#xFF0C;&#x5F80;&#x5BF9;&#x5E94;&#x65B9;&#x5411;&#x6447;&#x6446;&#xFF0C;&#x4ED6;&#x4F1A;&#x7ED9;&#x51FA;&#x597D;&#x7684;&#x53CD;&#x9988;&#xFF0C;&#x90A3;&#x57FA;&#x672C;&#x5C31;&#x77E5;&#x9053;&#x4ED6;&#x662F;&#x8981;&#x7FFB;&#x8EAB;&#x4E5F;&#x77E5;&#x9053;&#x4ED6;&#x7FFB;&#x8EAB;&#x7684;&#x65B9;&#x5411;&#x4E86;&#xFF09;</li>
<li>&#x5E73;&#x7761;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8981;&#x6CE8;&#x610F;&#x4F53;&#x4F4D;&#xFF1A;&#x53F3;&#x4FA7;&#x624B;&#x81C2;&#xFF08;&#x4E0D;&#x80FD;&#x52A8;&#x7684;&#x65B9;&#x5411;&#xFF09;&#x4E0B;&#x65B9;&#x8981;&#x57AB;&#x4E00;&#x4E2A;&#x5E73;&#x6795;&#x5934;&#xFF0C;&#x7F13;&#x89E3;&#x53F3;&#x4FA7;&#x624B;&#x81C2;&#x7684;&#x538B;&#x529B;&#xFF1B;&#x53F3;&#x4FA7;&#x624B;&#x81C2;&#x9700;&#x8981;&#x653E;&#x5E73;&#xFF0C;&#x6BD4;&#x8F83;&#x81EA;&#x7136;&#x7684;&#x4F53;&#x4F4D;&#xFF0C;&#x4E14;&#x624B;&#x638C;&#x5FC3;&#x5411;&#x4E0A;&#xFF1B;&#x53F3;&#x4FA7;&#x5927;&#x817F;&#x9700;&#x8981;&#x5782;&#x76F4;&#x653E;&#x5E73;&#xFF1B;&#x53F3;&#x4FA7;&#x811A;&#x8DBE;&#x5782;&#x76F4;&#x5411;&#x4E0A;&#xFF0C;&#x811A;&#x5E95;&#x5782;&#x76F4;&#x5411;&#x4E0A;&#xFF08;&#x7528;&#x6BDB;&#x5DFE;&#x5305;&#x88F9;&#x56FA;&#x5B9A;&#xFF09;</li>
<li>&#x5E73;&#x7761;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7237;&#x7237;&#x559C;&#x6B22;&#x5C06;&#x4E24;&#x53EA;&#x624B;&#x76F8;&#x4E92;&#x63E1;&#x4F4F;&#x653E;&#x5728;&#x5934;&#x9876;&#x3002;&#xFF08;&#x5982;&#x679C;&#x4ED6;&#x6709;&#x5DE6;&#x624B;&#x62C9;&#x53F3;&#x624B;&#x81C2;&#x5E76;&#x63D0;&#x4E3E;&#x7684;&#x52A8;&#x4F5C;&#xFF0C;&#x9700;&#x8981;&#x8F85;&#x52A9;&#x4ED6;&#x4E00;&#x4E0B;&#xFF0C;&#x5C06;&#x53F3;&#x4FA7;&#x624B;&#x81C2;&#x653E;&#x5728;&#x5934;&#x9876;&#x3002;&#xFF09;</li>
<li>&#x53F3;&#x4FA7;&#x7761;&#xFF08;&#x53F3;&#x4FA7;&#x5927;&#x817F;&#x5728;&#x4E0B;&#xFF09;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8981;&#x6CE8;&#x610F;&#x4F53;&#x4F4D;&#xFF1A;&#x5DE6;&#x4FA7;&#x5927;&#x817F;&#x548C;&#x53F3;&#x4FA7;&#x5927;&#x817F;&#x9519;&#x5F00;&#xFF0C;&#x5C3D;&#x91CF;&#x4E0D;&#x8981;&#x538B;&#x7740;&#x53F3;&#x4FA7;&#x5927;&#x817F;&#xFF1B;&#x5DE6;&#x4FA7;&#x5927;&#x817F;&#x4E0B;&#x65B9;&#x653E;&#x4E00;&#x4E2A;&#x6795;&#x5934;&#xFF0C;&#x7F13;&#x89E3;&#x53F3;&#x4FA7;&#x5927;&#x817F;&#x7684;&#x538B;&#x529B;&#xFF1B;&#x540E;&#x80CC;&#x653E;&#x4E00;&#x4E2A;&#x4E09;&#x89D2;&#x9760;&#x6795;&#xFF0C;&#x7F13;&#x89E3;&#x540E;&#x80CC;&#x4FA7;&#x5012;&#x4E0B;&#x6765;&#x7684;&#x538B;&#x529B;&#xFF1B;&#x53F3;&#x4FA7;&#x624B;&#x81C2;&#x4E0B;&#x65B9;&#x653E;&#x4E00;&#x4E2A;&#x5E73;&#x6795;&#x5934;&#xFF0C;&#x5E76;&#x5C3D;&#x91CF;&#x5E73;&#x653E;&#x3002;</li>
<li>&#x5DE6;&#x4FA7;&#x7761;&#xFF08;&#x5DE6;&#x4FA7;&#x5927;&#x817F;&#x5728;&#x4E0B;&#xFF09;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8981;&#x6CE8;&#x610F;&#x4F53;&#x4F4D;&#xFF1A;&#x53F3;&#x4FA7;&#x624B;&#x81C2;&#xFF08;&#x4E0D;&#x80FD;&#x52A8;&#x7684;&#x4E00;&#x4FA7;&#xFF09;&#x4E0B;&#x65B9;&#x57AB;&#x4E00;&#x4E2A;&#x5E73;&#x6795;&#x5934;&#x3002;&#x540E;&#x80CC;&#x653E;&#x4E00;&#x4E2A;&#x4E09;&#x89D2;&#x6795;&#x3002;</li>
<li>&#x653E;&#x6795;&#x5934;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9700;&#x8981;&#x7279;&#x522B;&#x7559;&#x610F;&#x300C;&#x4E0D;&#x8981;&#x538B;&#x5012;&#x5BFC;&#x5C3F;&#x7BA1;&#x300D;&#xFF0C;&#x4E0D;&#x7136;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x4E0D;&#x80FD;&#x6B63;&#x5E38;&#x7684;&#x5C0F;&#x4FBF;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4E0D;&#x7ED9;&#x76D6;&#x88AB;&#x5B50;&#xFF0C;&#x5C31;&#x60F3;&#x529E;&#x6CD5;&#x5438;&#x5F15;&#x4ED6;&#x7684;&#x6CE8;&#x610F;&#x529B;&#xFF0C;&#x300C;&#x54C4;&#x9A97;&#x300D;&#x7684;&#x540C;&#x65F6;&#x76D6;&#x4E0A;&#x88AB;&#x5B50;&#x3002;&#x5982;&#x679C;&#x8FD8;&#x662F;&#x4E0D;&#x884C;&#xFF0C;&#x5C31;&#x8FC7;&#x4F1A;&#x518D;&#x8BD5;&#x3002;&#x5982;&#x679C;&#x8FD8;&#x662F;&#x4E0D;&#x884C;&#xFF0C;&#x5C31;&#x518D;&#x8FC7;&#x4E00;&#x4F1A;&#x3002;&#x5982;&#x679C;&#x8FD8;&#x662F;&#x4E0D;&#x884C;&#xFF0C;&#x5C31;&#x7761;&#x7740;&#x4E86;&#x4E00;&#x4F1A;&#x518D;&#x8BD5;&#x3002;</li>
<li>&#x8981;&#x5C06;&#x7237;&#x7237;&#x770B;&#x6210;&#x300C;&#x6BD4;&#x5C0F;&#x670B;&#x53CB;&#x8FD8;&#x5C0F;&#x670B;&#x53CB;&#x7684;&#x5C0F;&#x670B;&#x53CB;&#x300D;&#xFF0C;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x8010;&#x5FC3;&#xFF0C;&#x7EC6;&#x8282;&#xFF0C;&#x5B89;&#x629A;&#xFF0C;&#x4E0D;&#x8BBA;&#x5FC3;&#x91CC;&#x591A;&#x7740;&#x6025;&#xFF0C;&#x90FD;&#x5E26;&#x7740;&#x5E73;&#x548C;&#x7684;&#x60C5;&#x7EEA;&#xFF0C;&#x6302;&#x7740;&#x7B11;&#x5BB9;&#x3002;</li>
</ul>
<p>&#x6253;&#x5B8C;&#x4E86;&#x6240;&#x6709;&#x8981;&#x70B9;&#x4E4B;&#x540E;&#x60F3;&#x8D77;&#x6765;&#x4E4B;&#x524D;&#x4E66;&#x4E2D;&#x770B;&#x5230;&#x7684;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x5927;&#x81F4;&#x610F;&#x601D;&#x5982;&#x4E0B;&#xFF1A;</p>
<blockquote>
<p>&#x4E0D;&#x81EA;&#x5F8B;&#x7684;&#x4EBA;&#x6C38;&#x8FDC;&#x4E0D;&#x77E5;&#x9053;&#x7CBE;&#x795E;&#x6298;&#x78E8;&#x80CC;&#x540E;&#x7684;&#x6210;&#x5C31;&#x611F;&#xFF0C;&#x5C31;&#x5982;&#x540C;&#x4F3C;&#x662F;&#x800C;&#x975E;&#x7684;&#x4EBA;&#x6C38;&#x8FDC;&#x4E0D;&#x77E5;&#x9053;&#x4E8B;&#x65E0;&#x5DE8;&#x7EC6;&#x7684;&#x91CD;&#x8981;&#x6027;&#x4E00;&#x6837;&#x3002;</p>
</blockquote>
<p>&#x53C8;&#x53CA;&#xFF0C;&#x719F;&#x7761;&#x7684;&#x7237;&#x7237;&#xFF1A;</p>
<p><img src="http://static.zybuluo.com/whiledoing/sj919w8teuxwgcxup5hd9f9x/image_1c14b6131f3r63gc6414nh5no25.png" alt="image_1c14b6131f3r63gc6414nh5no25.png-1637.4kB"></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://whiledoing.github.io/2017/12/12/diary/diary-2017-12-09-SAT/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="whiledoing">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/images/avatar.jpeg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="whiledoing">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="/2017/12/12/diary/diary-2017-12-09-SAT/" itemprop="url">diary-2017-12-09-SAT</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2017-12-12T11:00:17+08:00">
                2017-12-12
              </time>
            

            
              <span class="post-meta-divider">|</span>
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-check-o"></i>
              </span>
              
                <span class="post-meta-item-text">更新于&#58;</span>
              
              <time title="更新于" itemprop="dateModified" datetime="2017-12-12T11:00:47+08:00">
                2017-12-12
              </time>
            
          </span>

          

          
            
          

          
          

          

          
            <div class="post-wordcount">
              
                
                  <span class="post-meta-divider">|</span>
                
                <span class="post-meta-item-icon">
                  <i class="fa fa-file-word-o"></i>
                </span>
                
                  <span class="post-meta-item-text">字数统计&#58;</span>
                
                <span title="字数统计">
                  628
                </span>
              

              

              
            </div>
          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body han-init-context" itemprop="articleBody">

      
      

      
        
          
            <p>&#x4ECA;&#x5929;&#x662F;&#x7237;&#x7237;&#x751F;&#x75C5;&#x4F4F;&#x9662;&#x7684;&#x7B2C;25&#x5929;&#x3002;</p>
<p>&#x6628;&#x5929;&#x591C;&#x91CC;&#x6211;4&#x70B9;&#x591A;&#x5DE6;&#x53F3;&#x7761;&#xFF0C;&#x5927;&#x6982;&#x65E9;&#x4E0A;6&#x70B9;&#x591A;&#x8D77;&#x6765;&#x3002;&#x4E4B;&#x524D;&#x5728;&#x795E;&#x7ECF;&#x5185;&#x79D1;&#x770B;&#x62A4;&#x7684;&#x65F6;&#x5019;&#x5927;&#x53EF;&#x7761;&#x5230;8&#x70B9;&#xFF0C;&#x90A3;&#x4F1A;&#x533B;&#x751F;&#x624D;&#x67E5;&#x623F;&#x3002;&#x800C;&#x73B0;&#x5728;&#x5230;&#x4E86;&#x5EB7;&#x590D;&#x79D1;&#xFF0C;&#x56E0;&#x5176;&#x5728;&#x7701;&#x4EBA;&#x6C11;&#x533B;&#x9662;&#x65B0;&#x5927;&#x697C;&#x2014;&#x2014;&#x73AF;&#x5883;&#x4E0A;&#x4E86;&#x4E00;&#x4E2A;&#x53F0;&#x9636;&#xFF0C;&#x4F46;&#x5BF9;&#x5E94;&#x7684;&#x8981;&#x6C42;&#x4E5F;&#x4E0A;&#x4E86;&#x4E00;&#x4E2A;&#x53F0;&#x9636;&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x591A;&#x5230;7&#x70B9;&#x5C31;&#x8981;&#x8D77;&#x6765;&#xFF0C;&#x4E0D;&#x7136;&#x603B;&#x6709;&#x70B9;&#x300C;&#x5F71;&#x54CD;&#x5E02;&#x5BB9;&#x7684;&#x5373;&#x89C6;&#x611F;&#x300D;&#x3002;&#x7EC6;&#x60F3;&#x6765;&#x9AD8;&#x5927;&#x4E0A;&#x4E5F;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x597D;&#x4E8B;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x4EBA;&#x53CD;&#x800C;&#x4F1A;&#x559C;&#x6B22;&#x810F;&#x4E71;&#x5DEE;&#x6216;&#x8005;&#x66F4;&#x6587;&#x660E;&#x4E00;&#x70B9;&#x8BF4;&#x662F;&#xFF1A;&#x66F4;&#x559C;&#x6B22;&#x65E0;&#x5E8F;&#x7684;&#x72B6;&#x6001;&#x3002;&#x8FD9;&#x5C31;&#x50CF;&#x4F60;&#x5230;&#x4E86;&#x6210;&#x90FD;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x4F1A;&#x63A8;&#x8350;&#x53BB;&#x300C;&#x82CD;&#x8747;&#x9986;&#x5B50;&#x300D;&#x9986;&#x5B50;&#x800C;&#x4E0D;&#x662F;&#x5927;&#x996D;&#x5E97;&#x5403;&#x996D;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x6536;&#x62FE;&#x597D;&#x5E8A;&#x94FA;&#xFF0C;&#x62A4;&#x5DE5;&#x963F;&#x59E8;&#x4E5F;&#x8FC7;&#x6765;&#x4E86;&#xFF0C;&#x5582;&#x4E86;&#x7237;&#x7237;&#x4E00;&#x4E9B;&#x8425;&#x517B;&#x6DB2;&#x3002;&#x8FC7;&#x4E86;&#x4F1A;&#xFF0C;&#x59D1;&#x59D1;&#x548C;&#x5976;&#x5976;&#x4E5F;&#x4E00;&#x8D77;&#x6765;&#x4E86;&#x3002;&#x672C;&#x6765;&#x6211;&#x6253;&#x7B97;&#x65E9;&#x4E0A;&#x548C;&#x62A4;&#x5DE5;&#x5934;&#x5934;&#x4E07;&#x5E08;&#x5085;&#x8BF4;&#x4E0B;&#x6362;&#x62A4;&#x5DE5;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x59D1;&#x59D1;&#x6765;&#x4E86;&#x76F4;&#x63A5;&#x627E;&#x4E86;&#x4E07;&#x5E08;&#x5085;&#x8BF4;&#x4E86;&#x60C5;&#x51B5;&#xFF0C;&#x76F4;&#x63A5;&#x6362;&#xFF0C;&#x4E5F;&#x6CA1;&#x5565;&#x53EF;&#x8BF4;&#x7684;&#x3002;&#x8FC7;&#x4E86;&#x4F1A;&#xFF0C;&#x62A4;&#x5DE5;&#x5F20;&#x963F;&#x59E8;&#x6765;&#x5230;&#x6211;&#x4EEC;&#x5E8A;&#x8FB9;&#xFF0C;&#x6211;&#x4EEC;&#x62C5;&#x5FC3;&#x5979;&#x6709;&#x6240;&#x5FC3;&#x7406;&#x8D1F;&#x62C5;&#xFF0C;&#x5C31;&#x544A;&#x8BC9;&#x5979;&#xFF1A;&#x5176;&#x5B9E;&#x6211;&#x4EEC;&#x662F;&#x5BF9;&#x4E8B;&#x4E0D;&#x5BF9;&#x4EBA;&#xFF0C;&#x5C31;&#x8981;&#x6C42;&#x505A;&#x4E8B;&#x60C5;&#x7528;&#x70B9;&#x5FC3;&#xFF0C;&#x56E0;&#x4E3A;&#x8001;&#x7237;&#x5B50;&#x7684;&#x60C5;&#x51B5;&#x786E;&#x5B9E;&#x9700;&#x8981;&#x66F4;&#x52A0;&#x7EC6;&#x81F4;&#x7684;&#x7167;&#x6599;&#x3002;</p>
<p>&#x5976;&#x5976;&#x8BA9;&#x6211;&#x56DE;&#x53BB;&#x4F11;&#x606F;&#xFF0C;&#x8BF4;&#x662F;&#x4E0B;&#x5348;&#x4E09;&#x5A76;&#x8FC7;&#x6765;&#x966A;&#x62A4;&#xFF0C;&#x665A;&#x4E0A;&#x5A9B;&#x5A9B;&#x59B9;&#x59B9;&#x6765;&#x4E0A;&#x591C;&#x73ED;&#xFF0C;&#x52A0;&#x4E4B;&#x4ECA;&#x5929;&#x5468;&#x516D;&#xFF0C;&#x4E0B;&#x5348;&#x57FA;&#x672C;&#x6CA1;&#x5565;&#x5EB7;&#x590D;&#x9879;&#x76EE;&#xFF0C;&#x6211;&#x4E5F;&#x5C31;&#x56DE;&#x53BB;&#x4F11;&#x606F;&#x4E86;&#x3002;&#x4E2D;&#x5348;&#x6211;&#x8BF7;&#x5A9B;&#x5A9B;&#x5403;&#x4E2D;&#x996D;&#xFF0C;&#x544A;&#x8BC9;&#x4E86;&#x5979;&#x4E9B;&#x7167;&#x987E;&#x7237;&#x7237;&#x7684;&#x7EC6;&#x8282;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x56DE;&#x5BB6;&#x4E86;&#x3002;</p>
<p>&#x665A;&#x4E0A;&#x5976;&#x5976;&#x56DE;&#x6765;&#x540E;&#x544A;&#x8BC9;&#x6211;&#x8BF4;&#x4E0B;&#x5348;&#x53C8;&#x6362;&#x4E86;&#x4E00;&#x4E2A;&#x7537;&#x62A4;&#x5DE5;&#xFF0C;&#x7279;&#x522B;&#x50CF;&#x5C0F;&#x6587;&#x8D85;&#x53D4;&#x53D4;&#xFF0C;&#x4EBA;&#x770B;&#x8D77;&#x6765;&#x4E5F;&#x6BD4;&#x8F83;&#x9762;&#x5584;&#x8001;&#x5B9E;&#x3002;&#x665A;&#x4E0A;&#x59D1;&#x59D1;&#x575A;&#x6301;&#x8981;&#x591C;&#x73ED;&#x770B;&#x62A4;&#x7237;&#x7237;&#xFF0C;&#x6CA1;&#x6709;&#x8BA9;&#x5A9B;&#x5A9B;&#x966A;&#x62A4;&#x3002;&#x6211;&#x5F88;&#x7406;&#x89E3;&#xFF0C;&#x56E0;&#x4E3A;&#x6362;&#x4E86;&#x4E00;&#x4E2A;&#x62A4;&#x5DE5;&#xFF0C;&#x665A;&#x4E0A;&#x7684;&#x60C5;&#x51B5;&#x4E5F;&#x4E0D;&#x592A;&#x660E;&#x6717;&#xFF0C;&#x6240;&#x4EE5;&#x5979;&#x4E5F;&#x4E0D;&#x592A;&#x653E;&#x5FC3;&#xFF0C;&#x6240;&#x4EE5;&#x8981;&#x5148;&#x9876;&#x4E00;&#x4E0B;&#x770B;&#x770B;&#x5177;&#x4F53;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x542C;&#x5230;&#x8FD9;&#x4E2A;&#x72B6;&#x51B5;&#xFF0C;&#x6211;&#x4E5F;&#x5C31;&#x89C9;&#x5F97;&#x653E;&#x5FC3;&#x4E86;&#xFF0C;&#x81F3;&#x5C11;&#x4ECE;&#x5927;&#x5BB6;&#x7684;&#x53CD;&#x9988;&#x6765;&#x770B;&#x65B0;&#x62A4;&#x5DE5;&#x5927;&#x53D4;&#x8FD8;&#x662F;&#x4E0D;&#x9519;&#x7684;&#xFF0C;&#x5E0C;&#x671B;&#x7237;&#x7237;&#x4ECA;&#x5929;&#x665A;&#x4E0A;&#x80FD;&#x5B89;&#x9759;&#x4E0D;&#x6298;&#x817E;&#xFF0C;&#x80FD;&#x7761;&#x4E2A;&#x597D;&#x89C9;&#x3002;</p>
<p>&#x53C8;&#x53CA;&#xFF0C;&#x7237;&#x7237;&#x5230;&#x5EB7;&#x590D;&#x5BA4;&#x505A;&#x6CBB;&#x7597;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7237;&#x7237;&#x4E0D;&#x80AF;&#x6234;&#x5E3D;&#x5B50;&#xFF0C;&#x5976;&#x5976;&#x62C5;&#x5FC3;&#x7237;&#x7237;&#x53D7;&#x51C9;&#x7528;&#x6211;&#x7684;&#x56F4;&#x5DFE;&#x5C06;&#x7237;&#x7237;&#x88F9;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x5927;&#x59D1;&#x5A18;&#x6A21;&#x6837;&#xFF1A;</p>
<p><img src="http://static.zybuluo.com/whiledoing/j3uu2a9uj6c2fzi986b3gbt2/image_1c14allbmh6ecid1fg31isdvqa9.png" alt="image_1c14allbmh6ecid1fg31isdvqa9.png-1077.3kB"></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://whiledoing.github.io/2017/12/11/diary/diary-2017-12-08-FRI/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="whiledoing">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/images/avatar.jpeg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="whiledoing">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
                
                <a class="post-title-link" href="/2017/12/11/diary/diary-2017-12-08-FRI/" itemprop="url">diary-2017-12-08-FRI</a></h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2017-12-11T01:53:14+08:00">
                2017-12-11
              </time>
            

            
              <span class="post-meta-divider">|</span>
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-check-o"></i>
              </span>
              
                <span class="post-meta-item-text">更新于&#58;</span>
              
              <time title="更新于" itemprop="dateModified" datetime="2017-12-11T01:55:29+08:00">
                2017-12-11
              </time>
            
          </span>

          

          
            
          

          
          

          

          
            <div class="post-wordcount">
              
                
                  <span class="post-meta-divider">|</span>
                
                <span class="post-meta-item-icon">
                  <i class="fa fa-file-word-o"></i>
                </span>
                
                  <span class="post-meta-item-text">字数统计&#58;</span>
                
                <span title="字数统计">
                  2,301
                </span>
              

              

              
            </div>
          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body han-init-context" itemprop="articleBody">

      
      

      
        
          
            <p>&#x4ECA;&#x5929;&#x662F;&#x7237;&#x7237;&#x751F;&#x75C5;&#x4F4F;&#x9662;&#x7684;&#x7B2C;24&#x5929;&#x3002;</p>
<p>&#x65E9;&#x4E0A;7&#x70B9;&#x8D77;&#x5E8A;&#x53BB;&#x533B;&#x9662;&#xFF0C;&#x5230;&#x4E86;&#x7B2C;&#x4E00;&#x4EF6;&#x4E8B;&#x8FD8;&#x662F;&#x8BE2;&#x95EE;&#x7237;&#x7237;&#x6628;&#x591C;&#x7761;&#x89C9;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x548C;&#x6628;&#x5929;&#x4E00;&#x6837;&#xFF0C;&#x62A4;&#x5DE5;&#x53CD;&#x5E94;&#x7237;&#x7237;&#x8FD8;&#x662F;&#x4E00;&#x591C;&#x672A;&#x7761;&#x3002;&#x9694;&#x58C1;&#x5E8A;&#x7684;&#x76F4;&#x63A5;&#x4E0A;&#x6765;&#x5C31;&#x5BF9;&#x6211;&#x4EEC;&#x8FD9;&#x8FB9;&#x6709;&#x8BF4;&#x5600;&#x5495;&#xFF0C;&#x6211;&#x5FC3;&#x91CC;&#x77E5;&#x9053;&#x7406;&#x4E8F;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x53CD;&#x9A73;&#xFF0C;&#x800C;&#x662F;&#x7B49;&#x5582;&#x597D;&#x7237;&#x7237;&#x65E9;&#x996D;&#x540E;&#xFF0C;&#x624D;&#x8FC7;&#x53BB;&#x548C;&#x9694;&#x58C1;&#x9053;&#x6B49;&#x548C;&#x8BF4;&#x660E;&#x60C5;&#x51B5;&#xFF0C;&#x4F46;&#x662F;&#x4ED6;&#x4EEC;&#x66F4;&#x4E0D;&#x7406;&#x6E05;&#xFF0C;&#x8D28;&#x95EE;&#x6211;&#x9053;&#x6B49;&#x4E5F;&#x89E3;&#x51B3;&#x4E0D;&#x4E86;&#x4ED6;&#x4EEC;&#x7761;&#x89C9;&#x7684;&#x95EE;&#x9898;&#x3002;&#x6211;&#x5F53;&#x65F6;&#x5C31;&#x5FC3;&#x60F3;&#xFF0C;&#x8FD9;&#x6837;&#x5B50;&#x4E0D;&#x884C;&#xFF0C;&#x786E;&#x5B9E;&#x8981;&#x60F3;&#x4E2A;&#x529E;&#x6CD5;&#xFF0C;&#x800C;&#x4E14;&#x6211;&#x4F30;&#x8BA1;&#x7237;&#x7237;&#x665A;&#x4E0A;&#x4E5F;&#x6CA1;&#x6709;&#x7761;&#x597D;&#xFF0C;&#x5FC3;&#x91CC;&#x4E5F;&#x96BE;&#x53D7;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x544A;&#x8BC9;&#x5BF9;&#x65B9;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x60F3;&#x529E;&#x6CD5;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4ECA;&#x5929;&#x665A;&#x4E0A;&#x6211;&#x6765;&#x966A;&#x62A4;&#xFF0C;&#x800C;&#x4E14;&#x4E5F;&#x4F1A;&#x60F3;&#x529E;&#x6CD5;&#x6162;&#x6162;&#x8C03;&#x6574;&#x7237;&#x7237;&#x7684;&#x4F5C;&#x606F;&#x65F6;&#x95F4;&#xFF0C;&#x4E0D;&#x518D;&#x8BA9;&#x4ED6;&#x665A;&#x4E0A;&#x4E0D;&#x7761;&#x800C;&#x767D;&#x5929;&#x7761;&#x89C9;&#x3002;</p>
<p>&#x4E2D;&#x5348;&#x5348;&#x4F11;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7237;&#x7237;&#x53C8;&#x5927;&#x53EB;&#x4E86;&#x51E0;&#x4E0B;&#xFF0C;&#x6B63;&#x5F53;&#x6211;&#x8981;&#x53BB;&#x5B89;&#x629A;&#x7237;&#x7237;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6B63;&#x5728;&#x7761;&#x5348;&#x89C9;&#x9694;&#x58C1;&#x5E8A;&#x7684;&#x4E00;&#x4E2A;&#x5E74;&#x8F7B;&#x4EBA;&#xFF08;&#x53EF;&#x80FD;&#x662F;&#x75C5;&#x4EBA;&#x7684;&#x54E5;&#x54E5;&#xFF09;&#x6012;&#x4E0D;&#x53EF;&#x89E3;&#x7684;&#x6380;&#x5F00;&#x7A97;&#x5E18;&#x51B2;&#x6211;&#x4EEC;&#x8FD9;&#x8FB9;&#x543C;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x8BF4;&#x6211;&#x4EEC;&#x6BEB;&#x65E0;&#x826F;&#x77E5;&#xFF0C;&#x665A;&#x4E0A;&#x4E0D;&#x8BA9;&#x7761;&#xFF0C;&#x767D;&#x5929;&#x4E5F;&#x4E0D;&#x7761;&#x3002;&#x5976;&#x5976;&#x5F53;&#x65F6;&#x5C31;&#x548C;&#x5BF9;&#x9762;&#x543C;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x8BF4;&#x7237;&#x7237;&#x5979;&#x4E0D;&#x662F;&#x6B63;&#x5E38;&#x4EBA;&#xFF0C;&#x4EBA;&#x8981;&#x662F;&#x597D;&#x597D;&#x7684;&#x6765;&#x8FD9;&#x4E2A;&#x5730;&#x65B9;&#x5E72;&#x561B;&#xFF1F;&#x5BF9;&#x9762;&#x543C;&#x4E86;&#x5976;&#x5976;&#x4E00;&#x53E5;&#x501A;&#x8001;&#x5356;&#x8001;&#xFF0C;&#x76F4;&#x63A5;&#x5C06;&#x5976;&#x5976;&#x8BF4;&#x54ED;&#x3002;&#x6211;&#x5F53;&#x65F6;&#x672C;&#x6765;&#x662F;&#x60F3;&#x548C;&#x5BF9;&#x9762;&#x9053;&#x6B49;&#x5E76;&#x548C;&#x6C14;&#x8BF4;&#x4E0B;&#x60C5;&#x51B5;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x77E5;&#x9053;&#x6211;&#x4EEC;&#x7406;&#x4E8F;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x5979;&#x51B2;&#x6211;&#x5976;&#x5976;&#x543C;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x76F4;&#x63A5;&#x543C;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x4F60;tmd&#x6709;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#x51B2;&#x6211;&#x6765;&#xFF0C;&#x4F60;&#x51B2;&#x4E00;&#x4E2A;&#x8001;&#x4EBA;&#x5BB6;&#x53D1;&#x6211;&#x7B97;&#x4E2A;&#x5565;&#x3002;&#x5976;&#x5976;&#x54ED;&#x4E86;&#x4E4B;&#x540E;&#x5C31;&#x8DD1;&#x5230;&#x4E86;&#x75C5;&#x623F;&#x5916;&#x9762;&#xFF0C;&#x6211;&#x51FA;&#x53BB;&#x62B1;&#x4F4F;&#x5976;&#x5976;&#x544A;&#x8BC9;&#x5979;&#x4E0D;&#x8981;&#x54ED;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#x6211;&#x6765;&#x89E3;&#x51B3;&#xFF0C;&#x8BA9;&#x5979;&#x4E0D;&#x8981;&#x518D;&#x96BE;&#x53D7;&#x548C;&#x4F24;&#x5FC3;&#x3002;&#x521A;&#x597D;&#x5A9B;&#x5A9B;&#x7684;&#x7238;&#x7238;&#x90A3;&#x4F1A;&#x5728;&#x5916;&#x9762;&#xFF0C;&#x770B;&#x5230;&#x60C5;&#x51B5;&#x4E5F;&#x8FDB;&#x6765;&#x548C;&#x9694;&#x58C1;&#x7684;&#x5C0F;&#x4F19;&#x5B50;&#x7406;&#x8BBA;&#x3002;&#x7B49;&#x6211;&#x5B89;&#x629A;&#x597D;&#x5976;&#x5976;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x627E;&#x4E86;&#x9694;&#x58C1;&#x5C0F;&#x4F19;&#x5B50;&#x79C1;&#x4E0B;&#x8BF4;&#x9053;&#xFF1A;&#x300E;&#x6211;&#x77E5;&#x9053;&#x665A;&#x4E0A;&#x5435;&#x5F97;&#x4F60;&#x4EEC;&#x6CA1;&#x6709;&#x7761;&#x597D;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5728;&#x60F3;&#x529E;&#x6CD5;&#x89E3;&#x51B3;&#x4E2D;&#xFF0C;&#x524D;&#x4E24;&#x5929;&#x786E;&#x5B9E;&#x5F88;&#x4E0D;&#x597D;&#x610F;&#x601D;&#x3002;&#x6211;&#x5976;&#x5976;&#x516B;&#x5341;&#x591A;&#x5C81;&#xFF0C;&#x6211;&#x7237;&#x7237;&#x73B0;&#x5728;&#x8FD9;&#x4E2A;&#x72B6;&#x51B5;&#xFF0C;&#x5979;&#x5FC3;&#x91CC;&#x6BD4;&#x8C01;&#x90FD;&#x7740;&#x6025;&#xFF0C;&#x5C31;&#x7B97;&#x8001;&#x4EBA;&#x5BB6;&#x8BF4;&#x4F60;&#x51E0;&#x53E5;&#xFF0C;&#x9A82;&#x4F60;&#x51E0;&#x53E5;&#xFF0C;&#x4F60;&#x4E5F;&#x8981;&#x8BA9;&#x5979;&#xFF0C;&#x4F60;&#x6709;&#x4EC0;&#x4E48;&#x59D4;&#x5C48;&#x95EE;&#x9898;&#x4E0B;&#x6765;&#x548C;&#x6211;&#x8BF4;&#x548C;&#x6211;&#x543C;&#xFF0C;&#x6211;&#x4E5F;&#x662F;&#x8BB2;&#x9053;&#x7406;&#x7684;&#x4EBA;&#xFF0C;&#x5982;&#x679C;&#x771F;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x80AF;&#x5B9A;&#x7ED9;&#x4F60;&#x8BF4;&#x6CD5;&#x300F;&#x3002;&#x8FD8;&#x597D;&#x8FD9;&#x54E5;&#x4EEC;&#x4E5F;&#x4E0D;&#x662F;&#x65E0;&#x7406;&#x7684;&#x4EBA;&#xFF0C;&#x6211;&#x8FD9;&#x6837;&#x548C;&#x4ED6;&#x8BF4;&#xFF0C;&#x4ED6;&#x4E5F;&#x7B97;&#x540C;&#x610F;&#x4E86;&#x6211;&#x7684;&#x8BF4;&#x6CD5;&#x3002;&#x4F46;&#x4ED6;&#x4E5F;&#x6CA1;&#x6709;&#x548C;&#x6211;&#x8FC7;&#x591A;&#x8A00;&#x8BED;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#x786E;&#x5B9E;&#x8BB2;&#x518D;&#x591A;&#x4E5F;&#x8FD8;&#x662F;&#x6211;&#x4EEC;&#x8FC7;&#x5931;&#x7684;&#x591A;&#x4E9B;&#xFF0C;&#x4ED6;&#x5BB6;&#x7684;&#x75C5;&#x4EBA;&#x5E74;&#x7EAA;&#x8F7B;&#x8F7B;&#xFF0C;&#x5374;&#x4E5F;&#x5927;&#x6982;&#x534A;&#x8EAB;&#x4E0D;&#x9042;&#xFF0C;&#x60F3;&#x6765;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x7740;&#x6025;&#xFF0C;&#x7ED3;&#x679C;&#x665A;&#x4E0A;&#x8FD8;&#x7761;&#x4E0D;&#x597D;&#xFF0C;&#x80AF;&#x5B9A;&#x767D;&#x5929;&#x5EB7;&#x590D;&#x7684;&#x6548;&#x679C;&#x8981;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#x3002;&#x5728;&#x533B;&#x9662;&#x5F85;&#x4E00;&#x5929;&#x90FD;&#x662F;&#x5404;&#x79CD;&#x94B1;&#x548C;&#x5404;&#x79CD;&#x95F9;&#x5FC3;&#x7CDF;&#x5FC3;&#x554A;&#xFF0C;&#x5C06;&#x5FC3;&#x6BD4;&#x5FC3;&#xFF0C;&#x5176;&#x5B9E;&#x5927;&#x5BB6;&#x90FD;&#x4E0D;&#x5BB9;&#x6613;&#x3002;&#x533B;&#x9662;&#x771F;&#x662F;&#x770B;&#x5C3D;&#x4EBA;&#x751F;&#x51B7;&#x6696;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x4E0B;&#x5348;&#x7237;&#x7237;&#x53BB;&#x505A;&#x4E86;&#x4E00;&#x4E2A;&#x53EB;&#x505A;ROB&#x7684;&#x5EB7;&#x590D;&#x9879;&#x76EE;&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x8F85;&#x52A9;&#x52A8;&#x529B;&#x6E38;&#x620F;&#x9879;&#x76EE;&#x3002;&#x5728;&#x75C5;&#x4EBA;&#x4E0D;&#x80FD;&#x52A8;&#x7684;&#x624B;&#x81C2;&#x4E0A;&#x6346;&#x7ED1;&#x52A8;&#x529B;&#x8F85;&#x52A9;&#x673A;&#x68B0;&#x81C2;&#xFF0C;&#x7136;&#x540E;&#x5C4F;&#x5E55;&#x4E0A;&#x5F00;&#x59CB;&#x6E38;&#x620F;&#xFF0C;&#x89C4;&#x5219;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x64CD;&#x4F5C;&#x673A;&#x68B0;&#x81C2;&#x6765;&#x63A7;&#x5236;&#x6E38;&#x620F;&#x4E2D;&#x4E00;&#x4E2A;&#x5C0F;&#x7403;&#x7684;&#x79FB;&#x52A8;&#x65B9;&#x5411;&#xFF0C;&#x5982;&#x679C;&#x51FB;&#x4E2D;&#x76EE;&#x6807;&#x5C31;&#x5F97;&#x5206;&#x3002;&#x673A;&#x68B0;&#x81C2;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x662F;&#x4F7F;&#x7528;&#x4E3B;&#x52A8;&#x8FD8;&#x662F;&#x88AB;&#x52A8;&#x53D7;&#x529B;&#x6A21;&#x5F0F;&#xFF0C;&#x4E3B;&#x52A8;&#x6A21;&#x5F0F;&#x5C31;&#x662F;&#x75C5;&#x4EBA;&#x81EA;&#x5DF1;&#x64CD;&#x4F5C;&#x624B;&#x81C2;&#xFF0C;&#x800C;&#x88AB;&#x52A8;&#x5C31;&#x662F;&#x673A;&#x68B0;&#x8F85;&#x52A9;&#x79FB;&#x52A8;&#xFF0C;&#x5E26;&#x52A8;&#x75C5;&#x4EBA;&#x7684;&#x624B;&#x81C2;&#x8FDB;&#x884C;&#x79FB;&#x52A8;&#xFF0C;&#x523A;&#x6FC0;&#x808C;&#x8089;&#xFF0C;&#x5BFB;&#x627E;&#x624B;&#x81C2;&#x79FB;&#x52A8;&#x7684;&#x611F;&#x89C9;&#x3002;&#x7ED3;&#x679C;&#x4E4B;&#x524D;&#x660F;&#x660F;&#x6C89;&#x6C89;&#x7761;&#x610F;&#x7684;&#x7237;&#x7237;&#x5C45;&#x7136;&#x4E00;&#x4E0B;&#x5B50;&#x96C6;&#x4E2D;&#x8D77;&#x4E86;&#x6CE8;&#x610F;&#x529B;&#xFF0C;&#x76EF;&#x7740;&#x5C4F;&#x5E55;&#x7684;&#x5C0F;&#x7403;&#x770B;&#xFF0C;&#x8BA9;&#x6211;&#x548C;&#x5976;&#x5976;&#x90FD;&#x5F00;&#x5FC3;&#x574F;&#x4E86;&#x3002;&#x867D;&#x7136;&#x73A9;&#x5230;&#x540E;&#x9762;&#x65F6;&#x95F4;&#x7237;&#x7237;&#x5C31;&#x6CE8;&#x610F;&#x529B;&#x4E0D;&#x592A;&#x96C6;&#x4E2D;&#xFF0C;&#x4E0D;&#x600E;&#x4E48;&#x770B;&#x5C4F;&#x5E55;&#x60F3;&#x7761;&#x89C9;&#xFF0C;&#x4F46;&#x4E2D;&#x95F4;&#x6709;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x7237;&#x7237;&#x8FD8;&#x662F;&#x5F88;&#x914D;&#x5408;&#x7684;&#x770B;&#x7740;&#x5C4F;&#x5E55;&#x300C;&#x73A9;&#x4E86;&#x300D;&#x8D77;&#x6765;&#xFF0C;&#x8FD9;&#x8BA9;&#x6211;&#x4EEC;&#x90FD;&#x5F88;&#x5F00;&#x5FC3;&#xFF0C;&#x4E5F;&#x7A81;&#x7136;&#x8BA9;&#x6211;&#x89C9;&#x5F97;&#x6211;&#x4E4B;&#x524D;&#x505A;&#x7684;&#x6E38;&#x620F;&#x884C;&#x4E1A;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x6709;&#x793E;&#x4F1A;&#x4EF7;&#x503C;&#x7684;&#x3002;</p>
<p>&#x665A;&#x4E0A;&#xFF0C;&#x62A4;&#x5DE5;&#x5582;&#x7237;&#x7237;&#x5403;&#x996D;&#xFF0C;&#x5582;&#x5B8C;&#x7237;&#x7237;&#x4E00;&#x52FA;&#x996D;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x770B;&#x4E00;&#x4F1A;&#x7535;&#x89C6;&#xFF0C;&#x5982;&#x6B64;&#x597D;&#x51E0;&#x6B21;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x975E;&#x5E38;&#x4E0D;&#x5F00;&#x5FC3;&#x5730;&#x8BF4;&#x4E86;&#x53E5;&#x300E;&#x4F60;&#x5582;&#x996D;&#x80FD;&#x4E0D;&#x80FD;&#x4E13;&#x5FC3;&#x70B9;&#xFF1F;&#x300F;&#xFF0C;&#x800C;&#x5979;&#x89E3;&#x91CA;&#x9053;&#x300E;&#x8001;&#x7237;&#x5B50;&#x56BC;&#x996D;&#x9700;&#x8981;&#x82B1;&#x65F6;&#x95F4;&#x7684;&#x300F;&#xFF0C;&#x6211;&#x9887;&#x751F;&#x6C14;&#x5F97;&#x56DE;&#x5979;&#x4E00;&#x53E5;&#x300E;&#x8001;&#x7237;&#x5B50;&#x5403;&#x996D;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x80FD;&#x545B;&#x5230;&#x6216;&#x8005;&#x5410;&#x4E1C;&#x897F;&#x51FA;&#x6765;&#xFF0C;&#x4F60;&#x4E0D;&#x770B;&#x8FD9;&#x70B9;&#xFF0C;&#x53D1;&#x751F;&#x95EE;&#x9898;&#x600E;&#x4E48;&#x641E;&#xFF1F;&#x300F;&#x3002;&#x5979;&#x88AB;&#x545B;&#x5F97;&#x6CA1;&#x8BDD;&#x8BF4;&#xFF0C;&#x4E5F;&#x5C31;&#x4E13;&#x5FC3;&#x4E86;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x540E;&#x6765;&#x59D1;&#x59D1;&#x6765;&#x4E86;&#x7535;&#x8BDD;&#xFF0C;&#x8BE2;&#x95EE;&#x4E86;&#x4ECA;&#x5929;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x5C31;&#x548C;&#x5979;&#x8BF4;&#x660E;&#x4E86;&#x4E00;&#x4E0B;&#x72B6;&#x51B5;&#xFF0C;&#x4E5F;&#x4E00;&#x5E76;&#x544A;&#x8BC9;&#x5979;&#x6211;&#x665A;&#x4E0A;&#x7559;&#x4E0B;&#x6765;&#x770B;&#x62A4;&#x7237;&#x7237;&#x7684;&#x51B3;&#x5B9A;&#x3002;&#x5979;&#x5F53;&#x65F6;&#x6709;&#x4E9B;&#x751F;&#x6C14;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x786E;&#x5B9E;&#x6CA1;&#x6709;&#x63D0;&#x524D;&#x548C;&#x5979;&#x8BF4;&#x660E;&#x8FD9;&#x4E2A;&#x51B3;&#x5B9A;&#xFF0C;&#x800C;&#x6211;&#x4E5F;&#x5FD9;&#x7684;&#x6CA1;&#x6709;&#x7EC6;&#x60F3;&#x7559;&#x4E0B;&#x6765;&#x5176;&#x5B9E;&#x8FD8;&#x662F;&#x5F88;&#x591A;&#x5B89;&#x6392;&#x8981;&#x5904;&#x7406;&#xFF1A;&#x6BD4;&#x5982;&#x665A;&#x4E0A;&#x7559;&#x4E0B;&#x6765;&#x7761;&#x5F97;&#x88AB;&#x5B50;&#x8FD8;&#x6CA1;&#x6709;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x5904;&#x7406;&#x597D;&#x548C;&#x8FD9;&#x4E2A;&#x4E00;&#x5BF9;&#x4E00;&#x62A4;&#x5DE5;&#x7684;&#x770B;&#x62A4;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x540E;&#x6765;&#x59D1;&#x59D1;&#x4E0B;&#x4E86;&#x73ED;&#x4E4B;&#x540E;&#xFF0C;&#x6298;&#x817E;&#x4E86;&#x4E00;&#x5708;&#xFF0C;&#x53C8;&#x56DE;&#x5BB6;&#x7ED9;&#x6211;&#x9001;&#x88AB;&#x5B50;&#x8FC7;&#x6765;&#x3002;&#x5F53;&#x65F6;&#x5927;&#x6982;&#x665A;&#x4E0A;10&#x70B9;&#x591A;&#xFF0C;&#x6211;&#x548C;&#x62A4;&#x5DE5;&#x5F20;&#x963F;&#x59E8;&#x8BF4;&#xFF0C;&#x665A;&#x4E0A;&#x6211;&#x6765;&#x770B;&#x62A4;&#xFF0C;&#x4F60;&#x627E;&#x5730;&#x65B9;&#x7761;&#x89C9;&#xFF0C;&#x6211;&#x6709;&#x4E8B;&#x60C5;&#x6253;&#x7535;&#x8BDD;&#x53EB;&#x4F60;&#x3002;&#x4E0D;&#x8FC7;&#x4F60;&#x73B0;&#x5728;&#x7A0D;&#x5FAE;&#x8FDF;&#x4E9B;&#x65F6;&#x5019;&#x7761;&#x89C9;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x59D1;&#x59D1;&#x7ED9;&#x6211;&#x62FF;&#x88AB;&#x5B50;&#x53BB;&#x4E86;&#xFF0C;&#x6211;&#x4E00;&#x4F1A;&#x53EF;&#x80FD;&#x4E0B;&#x6765;&#x53BB;&#x53D6;&#xFF0C;&#x5979;&#x4F30;&#x8BA1;&#x534A;&#x5C0F;&#x65F6;&#x5DE6;&#x53F3;&#x8FC7;&#x6765;&#xFF0C;&#x5230;&#x65F6;&#x5019;&#x6211;&#x7ED9;&#x4F60;&#x7535;&#x8BDD;&#xFF0C;&#x4F60;&#x5E2E;&#x6211;&#x8FC7;&#x6765;&#x770B;&#x7740;&#x4E00;&#x4F1A;&#x7237;&#x7237;&#x3002;&#x8FC7;&#x4E86;&#x534A;&#x5C0F;&#x65F6;&#xFF0C;&#x6211;&#x59D1;&#x59D1;&#x8FD8;&#x6CA1;&#x6709;&#x5230;&#xFF0C;&#x5979;&#x4E3B;&#x52A8;&#x8FC7;&#x6765;&#x770B;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x95EE;&#x4E86;&#x6211;&#x59D1;&#x59D1;&#x662F;&#x5426;&#x6765;&#x4E86;&#xFF0C;&#x6211;&#x8BF4;&#x8FD8;&#x6CA1;&#x6709;&#xFF0C;&#x6765;&#x4E86;&#x7ED9;&#x5979;&#x6253;&#x7535;&#x8BDD;&#x3002;&#x5979;&#x8BF4;&#xFF1A;&#x300E;&#x4F60;&#x7237;&#x7237;&#x73B0;&#x5728;&#x7761;&#x5F97;&#x633A;&#x597D;&#x7684;&#xFF0C;&#x4E00;&#x4F1A;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x600E;&#x4E48;&#x770B;&#x62A4;&#xFF0C;&#x6CA1;&#x5565;&#x592A;&#x5927;&#x95EE;&#x9898;&#x3002;&#x300F;&#xFF0C;&#x6211;&#x4E00;&#x542C;&#x8FD9;&#x8BDD;&#x6709;&#x4E9B;&#x70B8;&#xFF0C;&#x6211;&#x7565;&#x5927;&#x58F0;&#x8BF4;&#xFF1A;&#x300E;&#x6211;&#x4EEC;&#x8BF7;&#x4F60;&#x6765;&#x7167;&#x987E;&#x5C31;&#x662F;&#x8981;&#x4F60;&#x6765;&#x770B;&#x7740;&#x8001;&#x7237;&#x5B50;&#x7684;&#xFF0C;&#x4ED6;&#x7761;&#x7740;&#x4E86;&#x4E0D;&#x4EE3;&#x8868;&#x4E0D;&#x4F1A;&#x9192;&#x6765;&#xFF0C;&#x4E0D;&#x4EE3;&#x8868;&#x6CA1;&#x6709;&#x9700;&#x6C42;&#x9700;&#x8981;&#x5904;&#x7406;&#x3002;&#x300F;&#xFF0C;&#x7ED3;&#x679C;&#x8FD9;&#x963F;&#x59E8;&#x968F;&#x53E3;&#x8BF4;&#x4E86;&#x51E0;&#x53E5;&#xFF0C;&#x5927;&#x610F;&#x662F;&#xFF1A;&#x300E;&#x8001;&#x7237;&#x5B50;&#x6709;&#x95EE;&#x9898;&#x53EB;&#x51E0;&#x58F0;&#xFF0C;&#x6162;&#x6162;&#x4E5F;&#x5C31;&#x7761;&#x7740;&#x4E0D;&#x53EB;&#x4E86;&#x3002;&#x300F;&#x3002;&#x6211;tmd&#x76F4;&#x63A5;&#x70B8;&#x88C2;&#xFF0C;&#x7EC8;&#x4E8E;&#x77E5;&#x9053;&#x5979;&#x665A;&#x4E0A;&#x662F;&#x5982;&#x4F55;&#x966A;&#x62A4;&#x7684;&#xFF0C;&#x4E5F;&#x7EC8;&#x4E8E;&#x7406;&#x89E3;&#x9694;&#x58C1;&#x5E8A;&#x7684;&#x4EBA;&#x5982;&#x6B64;&#x751F;&#x6C14;&#x7684;&#x539F;&#x56E0;&#x3002;&#x6211;&#x5F53;&#x65F6;&#x6C14;&#x4E0D;&#x6253;&#x4E00;&#x5904;&#x6765;&#xFF0C;&#x5C06;&#x5B83;&#x53EB;&#x5979;&#x95E8;&#x53E3;&#xFF0C;&#x8BAD;&#x65A5;&#x4E86;&#x4E00;&#x901A;&#x3002;&#x6211;&#x672C;&#x6765;&#x60F3;&#x597D;&#x597D;&#x7684;&#x548C;&#x5979;&#x8BF4;&#x8BF4;&#x6211;&#x5FC3;&#x91CC;&#x5404;&#x79CD;&#x4E0D;&#x6EE1;&#x548C;&#x751F;&#x6C14;&#x7684;&#x4E8B;&#x60C5;&#x4EE5;&#x53CA;&#x544A;&#x8BC9;&#x5979;&#x6211;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x4E0D;&#x8FC7;&#x8BAD;&#x65A5;&#x4E86;&#x5979;&#x51E0;&#x4E0B;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x60F3;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x6709;&#x4E9B;&#x4EBA;&#x8BAD;&#x65A5;&#x4E5F;&#x6CA1;&#x7528;&#xFF0C;&#x5979;&#x8FD9;&#x79CD;&#x4EBA;&#x672C;&#x6765;&#x5C31;&#x662F;&#x81EA;&#x79C1;&#x548C;&#x80FD;&#x5077;&#x61D2;&#x5C31;&#x5077;&#x61D2;&#x672C;&#x6027;&#x7684;&#x4EBA;&#xFF0C;&#x4E0D;&#x662F;&#x4F60;&#x8BAD;&#x65A5;&#x540E;&#x5C31;&#x80FD;&#x6539;&#x6389;&#x7684;&#x3002;&#x6211;&#x867D;&#x7136;&#x80FD;&#x611F;&#x89C9;&#x5230;&#x8BAD;&#x65A5;&#x540E;&#x5979;&#x6001;&#x5EA6;&#x6709;&#x4E9B;&#x8F6F;&#x4E0B;&#x6765;&#xFF0C;&#x4E5F;&#x4F30;&#x8BA1;&#x5230;&#x5979;&#x6001;&#x5EA6;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x6240;&#x8F6C;&#x53D8;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x6211;&#x4EEC;&#x4E0D;&#x5728;&#x7684;&#x591C;&#x91CC;&#xFF0C;&#x5979;&#x8FD9;&#x6837;&#x5B50;&#x54C1;&#x884C;&#x7684;&#x4EBA;&#x4E00;&#x5B9A;&#x8FD8;&#x4F1A;&#x7EE7;&#x7EED;&#x300E;&#x4E0D;&#x8BA4;&#x771F;&#x300F;&#x4E0B;&#x53BB;&#xFF0C;&#x90A3;&#x8981;&#x4F60;&#x4F55;&#x7528;&#xFF1F;&#x6211;&#x5FC3;&#x91CC;&#x90A3;&#x65F6;&#x5DF2;&#x7ECF;&#x4E0B;&#x5B9A;&#x51B3;&#x5FC3;&#xFF0C;&#x7B2C;&#x4E8C;&#x5929;&#x627E;&#x4ED6;&#x4EEC;&#x8D1F;&#x8D23;&#x4EBA;&#x8BF4;&#xFF0C;&#x6362;&#x4EBA;&#x3002;&#x4F46;&#x73B0;&#x5728;&#x8FD8;&#x4E0D;&#x80FD;&#x5173;&#x7CFB;&#x76F4;&#x63A5;&#x6311;&#x7834;&#x95F9;&#x50F5;&#xFF0C;&#x4E0D;&#x7136;&#x7237;&#x7237;&#x591C;&#x91CC;&#x5982;&#x679C;&#x8981;&#x662F;&#x5927;&#x4FBF;&#x4E4B;&#x7C7B;&#x95EE;&#x9898;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x62A4;&#x5DE5;&#x6765;&#x89E3;&#x51B3;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x8BAD;&#x65A5;&#x4E86;&#x51E0;&#x53E5;&#x4E4B;&#x540E;&#x4E5F;&#x5C31;&#x8BA9;&#x5979;&#x56DE;&#x53BB;&#x7761;&#x89C9;&#x5427;&#xFF0C;&#x665A;&#x4E0A;&#x6211;&#x6765;&#x770B;&#x62A4;&#x3002;</p>
<p>&#x540E;&#x6765;&#x59D1;&#x59D1;&#x548C;&#x59D1;&#x7237;&#x4E00;&#x8D77;&#x8FC7;&#x6765;&#x4E86;&#xFF0C;&#x76F4;&#x63A5;&#x5C06;&#x88AB;&#x5B50;&#x9001;&#x5230;&#x4E86;&#x75C5;&#x623F;&#x3002;&#x59D1;&#x59D1;&#x4E0A;&#x6765;&#x5C31;&#x548C;&#x6211;&#x9053;&#x6B49;&#x8BF4;&#x665A;&#x4E0A;&#x4E0D;&#x5E94;&#x8BE5;&#x751F;&#x6C14;&#xFF0C;&#x6211;&#x62B1;&#x7740;&#x59D1;&#x59D1;&#x8BF4;&#xFF0C;&#x6211;&#x90FD;&#x7406;&#x89E3;&#x3002;&#x672C;&#x6765;&#x59D1;&#x59D1;&#x4E0A;&#x73ED;&#x5C31;&#x5F88;&#x8F9B;&#x82E6;&#xFF0C;&#x538B;&#x529B;&#x5F88;&#x5927;&#xFF0C;&#x7237;&#x7237;&#x7684;&#x4E8B;&#x60C5;&#x4E5F;&#x662F;&#x4E00;&#x5806;&#x95EE;&#x9898;&#x8981;&#x5979;&#x534F;&#x8C03;&#x5904;&#x7406;&#x3002;&#x6211;&#x8BF4;&#x5176;&#x5B9E;&#x5927;&#x5BB6;&#x5FC3;&#x91CC;&#x90FD;&#x96BE;&#x53D7;&#x548C;&#x7740;&#x6025;&#xFF0C;&#x6211;&#x90FD;&#x80FD;&#x7406;&#x89E3;&#x3002;&#x6211;&#x73B0;&#x5728;&#x662F;&#x770B;&#x62A4;&#x7237;&#x7237;&#x7684;&#x6392;&#x5934;&#x5175;&#xFF0C;&#x4E0D;&#x8BBA;&#x5FC3;&#x91CC;&#x600E;&#x4E48;&#x7740;&#x6025;&#xFF0C;&#x6211;&#x90FD;&#x4F1A;&#x7A33;&#x4F4F;&#x3002;&#x4E4B;&#x540E;&#x6211;&#x5C31;&#x548C;&#x59D1;&#x59D1;&#x8BF4;&#x4E86;&#x62A4;&#x5DE5;&#x7684;&#x4E8B;&#x60C5;&#x4EE5;&#x53CA;&#x6211;&#x4E3A;&#x5565;&#x6CA1;&#x600E;&#x4E48;&#x8003;&#x8651;&#x6E05;&#x695A;&#x5C31;&#x8FD9;&#x4E48;&#x51B3;&#x5B9A;&#x8BF4;&#x665A;&#x4E0A;&#x7559;&#x4E0B;&#x6765;&#x3002;&#x5C31;&#x5728;&#x6211;&#x4EEC;&#x804A;&#x7740;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9694;&#x58C1;&#x5E8A;&#x7684;&#x770B;&#x62A4;&#x75C5;&#x4EBA;&#x7684;&#x53D4;&#x53D4;&#x8FC7;&#x6765;&#x548C;&#x6211;&#x8BF4;&#xFF0C;&#x4F60;&#x4EEC;&#x5BB6;&#x5C5E;&#x770B;&#x62A4;&#x6BD4;&#x90A3;&#x4E2A;&#x62A4;&#x5DE5;&#x8981;&#x597D;&#x4E00;&#x767E;&#x500D;&#x3002;&#x90A3;&#x4E2A;&#x62A4;&#x5DE5;&#x665A;&#x4E0A;&#x770B;&#x62A4;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x7237;&#x7237;&#x5404;&#x79CD;&#x53EB;&#xFF0C;&#x5979;&#x5404;&#x79CD;&#x7761;&#x5F97;&#x6DF1;&#xFF0C;&#x6211;&#x7237;&#x7237;&#x53EB;&#x7684;&#x5927;&#x58F0;&#x4E86;&#xFF0C;&#x5979;&#x53CD;&#x800C;&#x5C06;&#x88AB;&#x5B50;&#x628A;&#x5934;&#x4E00;&#x8499;&#xFF0C;&#x8FD9;&#x4E00;&#x8BF4;&#x6C14;&#x5F97;&#x6211;&#x4EEC;&#x76F4;&#x7259;&#x75D2;&#x75D2;&#x3002;</p>
<p>&#x665A;&#x4E0A;&#x7237;&#x7237;&#x786E;&#x5B9E;&#x8FD8;&#x662F;&#x4E09;&#x73ED;&#x5012;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x4E0B;&#x534A;&#x591C;1&#x70B9;&#x5230;4&#x70B9;&#x5DE6;&#x53F3;&#x4E0D;&#x592A;&#x56F0;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x534A;&#x5C0F;&#x65F6;&#x4E00;&#x4E2A;&#x9700;&#x6C42;&#xFF0C;&#x591A;&#x6570;&#x662F;&#x8981;&#x559D;&#x6C34;&#x548C;&#x7FFB;&#x8EAB;&#x3002;&#x4ED6;&#x89C6;&#x542C;&#x529F;&#x80FD;&#x53D7;&#x5230;&#x4E86;&#x5F71;&#x54CD;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x8BF4;&#x8BDD;&#x8BF4;&#x4E0D;&#x6E05;&#x695A;&#xFF0C;&#x6211;&#x4EEC;&#x8BF4;&#x8BDD;&#x4ED6;&#x4E5F;&#x4E0D;&#x751A;&#x660E;&#x767D;&#xFF0C;&#x4ED6;&#x7684;&#x9700;&#x6C42;&#x57FA;&#x672C;&#x9760;&#x731C;&#x548C;&#x5BF9;&#x4ED6;&#x8EAB;&#x4F53;&#x52A8;&#x4F5C;&#x7684;&#x7ECF;&#x9A8C;&#x76F4;&#x89C9;&#x3002;&#x90A3;&#x5929;&#x591C;&#x91CC;&#x6211;&#x5C31;&#x518D;&#x60F3;&#x7740;&#x54EA;&#x5929;&#x62BD;&#x7A7A;&#x8981;&#x6574;&#x7406;&#x4E00;&#x4EFD;&#x5173;&#x4E8E;&#x7167;&#x987E;&#x7237;&#x7237;&#x7684;&#x7ECF;&#x9A8C;&#x624B;&#x518C;&#x3002;</p>
<p>&#x53C8;&#x53CA;&#xFF0C;&#x7237;&#x7237;&#x73A9;ROB&#x7684;&#x573A;&#x666F;&#xFF1A;</p>
<p><img src="http://static.zybuluo.com/whiledoing/4dl3iigkow0jztk86zzpjb55/image_1c10ov9a85oa1l5j18td8q81fo9.png" alt="image_1c10ov9a85oa1l5j18td8q81fo9.png-1324.6kB"></p>

          
        
      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </div>
  
  
  
  </article>


    
  </section>

  
  <nav class="pagination">
    <span class="page-number current">1</span><a class="page-number" href="/page/2/">2</a><span class="space">&hellip;</span><a class="page-number" href="/page/4/">4</a><a class="extend next" rel="next" href="/page/2/"><i class="fa fa-angle-right"></i></a>
  </nav>



          </div>
          


          

        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      

      <section class="site-overview-wrap sidebar-panel sidebar-panel-active">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <img class="site-author-image" itemprop="image"
                src="/images/avatar.jpeg"
                alt="whiledoing" />
            
              <p class="site-author-name" itemprop="name">whiledoing</p>
              <p class="site-description motion-element" itemprop="description">喜欢一切简单且美的事物，包括人。</p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="/archives/">
              
                  <span class="site-state-item-count">38</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            

            
              
              
              <div class="site-state-item site-state-tags">
                <a href="/tags/index.html">
                  <span class="site-state-item-count">26</span>
                  <span class="site-state-item-name">标签</span>
                </a>
              </div>
            

          </nav>

          

          <div class="links-of-author motion-element">
            
              
                <span class="links-of-author-item">
                  <a href="https://github.com/whiledoing" target="_blank" title="GitHub">
                    GitHub</a>
                </span>
              
                <span class="links-of-author-item">
                  <a href="http://www.douban.com/people/58249409" target="_blank" title="豆瓣">
                    豆瓣</a>
                </span>
              
                <span class="links-of-author-item">
                  <a href="https://www.zhihu.com/people/whiledoing" target="_blank" title="知乎">
                    知乎</a>
                </span>
              
                <span class="links-of-author-item">
                  <a href="https://music.163.com/#/user/home?id=18202171" target="_blank" title="网易云音乐">
                    网易云音乐</a>
                </span>
              
            
          </div>

          
          

          
          

          

        </div>
      </section>

      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; 2016 &mdash; <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">whiledoing</span>

  
    <span class="post-meta-divider">|</span>
    <span class="post-meta-item-icon">
      <i class="fa fa-area-chart"></i>
    </span>
    
      <span class="post-meta-item-text">Site words total count&#58;</span>
    
    <span title="Site words total count">75.6k</span>
  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Mist</a> v5.1.3</div>




        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
          <span id="scrollpercent"><span>0</span>%</span>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.3"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.3"></script>



  
  

  

  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.3"></script>



  


  




	





  





  












  

  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    var isXml = true;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length === 0) {
      search_path = "search.xml";
    } else if (/json$/i.test(search_path)) {
      isXml = false;
    }
    var path = "/" + search_path;
    // monitor main search box;

    var onPopupClose = function (e) {
      $('.popup').hide();
      $('#local-search-input').val('');
      $('.search-result-list').remove();
      $('#no-result').remove();
      $(".local-search-pop-overlay").remove();
      $('body').css('overflow', '');
    }

    function proceedsearch() {
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay"></div>')
        .css('overflow', 'hidden');
      $('.search-popup-overlay').click(onPopupClose);
      $('.popup').toggle();
      var $localSearchInput = $('#local-search-input');
      $localSearchInput.attr("autocapitalize", "none");
      $localSearchInput.attr("autocorrect", "off");
      $localSearchInput.focus();
    }

    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';

      // start loading animation
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay">' +
          '<div id="search-loading-icon">' +
          '<i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>' +
          '</div>' +
          '</div>')
        .css('overflow', 'hidden');
      $("#search-loading-icon").css('margin', '20% auto 0 auto').css('text-align', 'center');

      $.ajax({
        url: path,
        dataType: isXml ? "xml" : "json",
        async: true,
        success: function(res) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = isXml ? $("entry", res).map(function() {
            return {
              title: $("title", this).text(),
              content: $("content",this).text(),
              url: $("url" , this).text()
            };
          }).get() : res;
          var input = document.getElementById(search_id);
          var resultContent = document.getElementById(content_id);
          var inputEventFunction = function() {
            var searchText = input.value.trim().toLowerCase();
            var keywords = searchText.split(/[\s\-]+/);
            if (keywords.length > 1) {
              keywords.push(searchText);
            }
            var resultItems = [];
            if (searchText.length > 0) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var hitCount = 0;
                var searchTextCount = 0;
                var title = data.title.trim();
                var titleInLowerCase = title.toLowerCase();
                var content = data.content.trim().replace(/<[^>]+>/g,"");
                var contentInLowerCase = content.toLowerCase();
                var articleUrl = decodeURIComponent(data.url);
                var indexOfTitle = [];
                var indexOfContent = [];
                // only match articles with not empty titles
                if(title != '') {
                  keywords.forEach(function(keyword) {
                    function getIndexByWord(word, text, caseSensitive) {
                      var wordLen = word.length;
                      if (wordLen === 0) {
                        return [];
                      }
                      var startPosition = 0, position = [], index = [];
                      if (!caseSensitive) {
                        text = text.toLowerCase();
                        word = word.toLowerCase();
                      }
                      while ((position = text.indexOf(word, startPosition)) > -1) {
                        index.push({position: position, word: word});
                        startPosition = position + wordLen;
                      }
                      return index;
                    }

                    indexOfTitle = indexOfTitle.concat(getIndexByWord(keyword, titleInLowerCase, false));
                    indexOfContent = indexOfContent.concat(getIndexByWord(keyword, contentInLowerCase, false));
                  });
                  if (indexOfTitle.length > 0 || indexOfContent.length > 0) {
                    isMatch = true;
                    hitCount = indexOfTitle.length + indexOfContent.length;
                  }
                }

                // show search results

                if (isMatch) {
                  // sort index by position of keyword

                  [indexOfTitle, indexOfContent].forEach(function (index) {
                    index.sort(function (itemLeft, itemRight) {
                      if (itemRight.position !== itemLeft.position) {
                        return itemRight.position - itemLeft.position;
                      } else {
                        return itemLeft.word.length - itemRight.word.length;
                      }
                    });
                  });

                  // merge hits into slices

                  function mergeIntoSlice(text, start, end, index) {
                    var item = index[index.length - 1];
                    var position = item.position;
                    var word = item.word;
                    var hits = [];
                    var searchTextCountInSlice = 0;
                    while (position + word.length <= end && index.length != 0) {
                      if (word === searchText) {
                        searchTextCountInSlice++;
                      }
                      hits.push({position: position, length: word.length});
                      var wordEnd = position + word.length;

                      // move to next position of hit

                      index.pop();
                      while (index.length != 0) {
                        item = index[index.length - 1];
                        position = item.position;
                        word = item.word;
                        if (wordEnd > position) {
                          index.pop();
                        } else {
                          break;
                        }
                      }
                    }
                    searchTextCount += searchTextCountInSlice;
                    return {
                      hits: hits,
                      start: start,
                      end: end,
                      searchTextCount: searchTextCountInSlice
                    };
                  }

                  var slicesOfTitle = [];
                  if (indexOfTitle.length != 0) {
                    slicesOfTitle.push(mergeIntoSlice(title, 0, title.length, indexOfTitle));
                  }

                  var slicesOfContent = [];
                  while (indexOfContent.length != 0) {
                    var item = indexOfContent[indexOfContent.length - 1];
                    var position = item.position;
                    var word = item.word;
                    // cut out 100 characters
                    var start = position - 20;
                    var end = position + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if (end < position + word.length) {
                      end = position + word.length;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    slicesOfContent.push(mergeIntoSlice(content, start, end, indexOfContent));
                  }

                  // sort slices in content by search text's count and hits' count

                  slicesOfContent.sort(function (sliceLeft, sliceRight) {
                    if (sliceLeft.searchTextCount !== sliceRight.searchTextCount) {
                      return sliceRight.searchTextCount - sliceLeft.searchTextCount;
                    } else if (sliceLeft.hits.length !== sliceRight.hits.length) {
                      return sliceRight.hits.length - sliceLeft.hits.length;
                    } else {
                      return sliceLeft.start - sliceRight.start;
                    }
                  });

                  // select top N slices in content

                  var upperBound = parseInt('3');
                  if (upperBound >= 0) {
                    slicesOfContent = slicesOfContent.slice(0, upperBound);
                  }

                  // highlight title and content

                  function highlightKeyword(text, slice) {
                    var result = '';
                    var prevEnd = slice.start;
                    slice.hits.forEach(function (hit) {
                      result += text.substring(prevEnd, hit.position);
                      var end = hit.position + hit.length;
                      result += '<b class="search-keyword">' + text.substring(hit.position, end) + '</b>';
                      prevEnd = end;
                    });
                    result += text.substring(prevEnd, slice.end);
                    return result;
                  }

                  var resultItem = '';

                  if (slicesOfTitle.length != 0) {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + highlightKeyword(title, slicesOfTitle[0]) + "</a>";
                  } else {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + title + "</a>";
                  }

                  slicesOfContent.forEach(function (slice) {
                    resultItem += "<a href='" + articleUrl + "'>" +
                      "<p class=\"search-result\">" + highlightKeyword(content, slice) +
                      "...</p>" + "</a>";
                  });

                  resultItem += "</li>";
                  resultItems.push({
                    item: resultItem,
                    searchTextCount: searchTextCount,
                    hitCount: hitCount,
                    id: resultItems.length
                  });
                }
              })
            };
            if (keywords.length === 1 && keywords[0] === "") {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>'
            } else if (resultItems.length === 0) {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>'
            } else {
              resultItems.sort(function (resultLeft, resultRight) {
                if (resultLeft.searchTextCount !== resultRight.searchTextCount) {
                  return resultRight.searchTextCount - resultLeft.searchTextCount;
                } else if (resultLeft.hitCount !== resultRight.hitCount) {
                  return resultRight.hitCount - resultLeft.hitCount;
                } else {
                  return resultRight.id - resultLeft.id;
                }
              });
              var searchResultList = '<ul class=\"search-result-list\">';
              resultItems.forEach(function (result) {
                searchResultList += result.item;
              })
              searchResultList += "</ul>";
              resultContent.innerHTML = searchResultList;
            }
          }

          if ('auto' === 'auto') {
            input.addEventListener('input', inputEventFunction);
          } else {
            $('.search-icon').click(inputEventFunction);
            input.addEventListener('keypress', function (event) {
              if (event.keyCode === 13) {
                inputEventFunction();
              }
            });
          }

          // remove loading animation
          $(".local-search-pop-overlay").remove();
          $('body').css('overflow', '');

          proceedsearch();
        }
      });
    }

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched === false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(onPopupClose);
    $('.popup').click(function(e){
      e.stopPropagation();
    });
    $(document).on('keyup', function (event) {
      var shouldDismissSearchPopup = event.which === 27 &&
        $('.search-popup').is(':visible');
      if (shouldDismissSearchPopup) {
        onPopupClose();
      }
    });
  </script>





  

  

  

  
  

  

  
  <script type="text/javascript" src="/js/src/js.cookie.js?v=5.1.3"></script>
  <script type="text/javascript" src="/js/src/scroll-cookie.js?v=5.1.3"></script>


  

</body>
</html>
