<!DOCTYPE html>












  


<html class="theme-next mist use-motion" lang="zh-CN">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=2"/>
<meta name="theme-color" content="#222">






  
  
    
    
  <script src="/lib/pace/pace.min.js?v=1.0.2"></script>
  <link href="/lib/pace/pace-theme-minimal.min.css?v=1.0.2" rel="stylesheet">




  
  
  <link rel="stylesheet" media="all" href="/lib/Han/dist/han.min.css?v=3.3">




<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />






















<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=6.4.0" rel="stylesheet" type="text/css" />


  <link rel="apple-touch-icon" sizes="180x180" href="/images/favicon.png?v=6.4.0">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon.png?v=6.4.0">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon.png?v=6.4.0">


  <link rel="mask-icon" href="/images/logo.svg?v=6.4.0" color="#222">









<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    version: '6.4.0',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":false,"onmobile":false},
    fancybox: false,
    fastclick: false,
    lazyload: false,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>


  




  <meta name="description" content="很早就想阅读这本书了，但一直都没找到时间，而更加惭愧的是这本书并不是我买的，是有一天看到同事有这本书，我就直接要了过来，然后也不打算还了，哈哈。因为我读书有个习惯就是写写画画，加之看了这本书之后欲罢不能的各种标记，所以更加没有办法将书还给同事了。如果以后有计划我自己买一本还给同事吧，我想这个也是必要的，因为我要支持村上春树。：）">
<meta name="keywords" content="读书笔记,哲理">
<meta property="og:type" content="article">
<meta property="og:title" content="《当我跑步时我谈些什么》读书笔记">
<meta property="og:url" content="http://whiledoing.me/2016/06/28/book-thinking-about-running-md/index.html">
<meta property="og:site_name" content="whiledoing">
<meta property="og:description" content="很早就想阅读这本书了，但一直都没找到时间，而更加惭愧的是这本书并不是我买的，是有一天看到同事有这本书，我就直接要了过来，然后也不打算还了，哈哈。因为我读书有个习惯就是写写画画，加之看了这本书之后欲罢不能的各种标记，所以更加没有办法将书还给同事了。如果以后有计划我自己买一本还给同事吧，我想这个也是必要的，因为我要支持村上春树。：）">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2018-04-17T13:29:52.898Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="《当我跑步时我谈些什么》读书笔记">
<meta name="twitter:description" content="很早就想阅读这本书了，但一直都没找到时间，而更加惭愧的是这本书并不是我买的，是有一天看到同事有这本书，我就直接要了过来，然后也不打算还了，哈哈。因为我读书有个习惯就是写写画画，加之看了这本书之后欲罢不能的各种标记，所以更加没有办法将书还给同事了。如果以后有计划我自己买一本还给同事吧，我想这个也是必要的，因为我要支持村上春树。：）">






  <link rel="canonical" href="http://whiledoing.me/2016/06/28/book-thinking-about-running-md/"/>



<script type="text/javascript" id="page.configurations">
  CONFIG.page = {
    sidebar: "",
  };
</script>

  <title>《当我跑步时我谈些什么》读书笔记 | whiledoing</title>
  




<script async src="https://www.googletagmanager.com/gtag/js?id=UA-117714040-1"></script>
<script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'UA-117714040-1');
</script>



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "https://hm.baidu.com/hm.js?6de2920425778ca5a4ee717be5055e96";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>




  <noscript>
  <style type="text/css">
    .use-motion .motion-element,
    .use-motion .brand,
    .use-motion .menu-item,
    .sidebar-inner,
    .use-motion .post-block,
    .use-motion .pagination,
    .use-motion .comments,
    .use-motion .post-header,
    .use-motion .post-body,
    .use-motion .collection-title { opacity: initial; }

    .use-motion .logo,
    .use-motion .site-title,
    .use-motion .site-subtitle {
      opacity: initial;
      top: initial;
    }

    .use-motion {
      .logo-line-before i { left: initial; }
      .logo-line-after i { right: initial; }
    }
  </style>
</noscript>

</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-CN">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">whiledoing</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
    
      
        <p class="site-subtitle">喜欢一切简单且美的事物，包括人。</p>
      
    
  </div>

  <div class="site-nav-toggle">
    <button aria-label="切换导航栏">
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>



<nav class="site-nav">
  
    <ul id="menu" class="menu">
      
        
        
        
          
          <li class="menu-item menu-item-home">
    <a href="/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-home"></i> <br />首页</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-about">
    <a href="/about/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-user"></i> <br />关于</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-tags">
    <a href="/tags/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />标签</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-archives">
    <a href="/archives/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />归档</a>
  </li>

      
      
    </ul>
  

  
    

  

  
</nav>



  



</div>
    </header>

    


    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  
    <div class="reading-progress-bar"></div>
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://whiledoing.me/2016/06/28/book-thinking-about-running-md/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="whiledoing">
      <meta itemprop="description" content="喜欢一切简单且美的事物，包括人。">
      <meta itemprop="image" content="/images/avatar.jpeg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="whiledoing">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">《当我跑步时我谈些什么》读书笔记
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">

            
            
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              

              
                
              

              <time title="创建时间：2016-06-28 11:08:38" itemprop="dateCreated datePublished" datetime="2016-06-28T11:08:38+08:00">2016-06-28</time>
            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body han-init-context" itemprop="articleBody">

      
      

      
        <p>&#x5F88;&#x65E9;&#x5C31;&#x60F3;&#x9605;&#x8BFB;<a href="https://book.douban.com/subject/3369600/" target="_blank" rel="noopener">&#x8FD9;&#x672C;&#x4E66;</a>&#x4E86;&#xFF0C;&#x4F46;&#x4E00;&#x76F4;&#x90FD;&#x6CA1;&#x627E;&#x5230;&#x65F6;&#x95F4;&#xFF0C;&#x800C;&#x66F4;&#x52A0;&#x60ED;&#x6127;&#x7684;&#x662F;&#x8FD9;&#x672C;&#x4E66;&#x5E76;&#x4E0D;&#x662F;&#x6211;&#x4E70;&#x7684;&#xFF0C;&#x662F;&#x6709;&#x4E00;&#x5929;&#x770B;&#x5230;&#x540C;&#x4E8B;&#x6709;&#x8FD9;&#x672C;&#x4E66;&#xFF0C;&#x6211;&#x5C31;&#x76F4;&#x63A5;&#x8981;&#x4E86;&#x8FC7;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x4E5F;&#x4E0D;&#x6253;&#x7B97;&#x8FD8;&#x4E86;&#xFF0C;&#x54C8;&#x54C8;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x8BFB;&#x4E66;&#x6709;&#x4E2A;&#x4E60;&#x60EF;&#x5C31;&#x662F;&#x5199;&#x5199;&#x753B;&#x753B;&#xFF0C;&#x52A0;&#x4E4B;&#x770B;&#x4E86;&#x8FD9;&#x672C;&#x4E66;&#x4E4B;&#x540E;&#x6B32;&#x7F62;&#x4E0D;&#x80FD;&#x7684;&#x5404;&#x79CD;&#x6807;&#x8BB0;&#xFF0C;&#x6240;&#x4EE5;&#x66F4;&#x52A0;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x5C06;&#x4E66;&#x8FD8;&#x7ED9;&#x540C;&#x4E8B;&#x4E86;&#x3002;&#x5982;&#x679C;&#x4EE5;&#x540E;&#x6709;&#x8BA1;&#x5212;&#x6211;&#x81EA;&#x5DF1;&#x4E70;&#x4E00;&#x672C;&#x8FD8;&#x7ED9;&#x540C;&#x4E8B;&#x5427;&#xFF0C;&#x6211;&#x60F3;&#x8FD9;&#x4E2A;&#x4E5F;&#x662F;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x8981;&#x652F;&#x6301;&#x6751;&#x4E0A;&#x6625;&#x6811;&#x3002;&#xFF1A;&#xFF09;</p>
<a id="more"></a>
<h3 id="extract">extract</h3>
<p>&#x4E00;&#x4E2A;&#x8DD1;&#x9A6C;&#x62C9;&#x677E;&#x7684;&#x9009;&#x624B;&#x5728;&#x6BD4;&#x8D5B;&#x4E2D;&#x91CD;&#x590D;&#x7684;&#x8BDD;&#xFF1A;</p>
<blockquote>
<p>Pain is inevitable. Suffering is optional.</p>
</blockquote>
<p>&#x8FD9;&#x53E5;&#x8BDD;&#x5F88;&#x96BE;&#x76F4;&#x63A5;&#x7FFB;&#x8BD1;&#xFF0C;&#x53EA;&#x53EF;&#x610F;&#x4F1A;&#x3002;&#x4EBA;&#x751F;&#x5728;&#x4E16;&#xFF0C;&#x75DB;&#x82E6;&#x7684;&#x4E8B;&#x60C5;&#x5341;&#x6709;&#x516B;&#x4E5D;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x4F55;&#x770B;&#x5F85;&#x75DB;&#x82E6;&#x5C31;&#x4EC1;&#x8005;&#x89C1;&#x4EC1;&#x667A;&#x8005;&#x89C1;&#x667A;&#x4E86;&#x3002;&#x4E8E;&#x6751;&#x4E0A;&#x6625;&#x6811;&#x800C;&#x8A00;&#xFF0C;&#x8DD1;&#x6B65;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x957F;&#x671F;&#x575A;&#x6301;&#x957F;&#x8DD1;&#x8FD9;&#x79CD;&#x4E8B;&#x60C5;&#xFF0C;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x53BB;&#x627E;&#x75DB;&#x82E6;&#xFF0C;&#x5C31;&#x662F;&#x53BB;&#x4E3A;&#x4E86;&#x5F97;&#x5230;&#x90A3;&#x79CD;&#x8FD1;&#x4F3C;&#x6D85;&#x69C3;&#x91CD;&#x751F;&#x4E4B;&#x540E;&#x7684;&#x559C;&#x60A6;&#x3002;&#x6240;&#x4EE5;&#x75DB;&#x82E6;&#x5E38;&#x6709;&#xFF0C;&#x575A;&#x6301;&#x548C;&#x4E50;&#x89C2;&#x8005;&#x4E0D;&#x5E38;&#x6709;&#x7F62;&#x4E86;&#x3002;</p>
<blockquote>
<p>&#x65E0;&#x8BBA;&#x4F55;&#x4E8B;&#xFF0C;&#x8D62;&#x4E86;&#x522B;&#x4EBA;&#x4E5F;&#x7F62;&#x8F93;&#x7ED9;&#x522B;&#x4EBA;&#x4E5F;&#x7F62;&#xFF0C;&#x90FD;&#x4E0D;&#x592A;&#x8BA1;&#x8F83;&#xFF0C;&#x5012;&#x662F;&#x66F4;&#x4E3A;&#x5173;&#x5FC3;&#x80FD;&#x5426;&#x8FBE;&#x5230;&#x4E3A;&#x81EA;&#x5DF1;&#x8BBE;&#x5B9A;&#x7684;&#x6807;&#x51C6;&#x3002;&#x5728;&#x8FD9;&#x5C42;&#x610F;&#x4E49;&#x4E0A;&#xFF0C;&#x957F;&#x8DD1;&#x662F;&#x4E0E;&#x6211;&#x7684;&#x5FC3;&#x6001;&#x5B8C;&#x5168;&#x543B;&#x5408;&#x7684;&#x4F53;&#x80B2;&#x8FD0;&#x52A8;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x6211;&#x8D85;&#x8D8A;&#x4E86;&#x6628;&#x5929;&#x7684;&#x81EA;&#x5DF1;&#xFF0C;&#x54EA;&#x6015;&#x53EA;&#x662F;&#x90A3;&#x4E48;&#x4E00;&#x4E01;&#x70B9;&#x513F;&#xFF0C;&#x624D;&#x66F4;&#x4E3A;&#x91CD;&#x8981;&#x3002;&#x5728;&#x957F;&#x8DD1;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x8BF4;&#x6709;&#x4EC0;&#x4E48;&#x5FC5;&#x987B;&#x6218;&#x80DC;&#x7684;&#x5BF9;&#x624B;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x8FC7;&#x53BB;&#x7684;&#x81EA;&#x5DF1;&#x3002;</p>
</blockquote>
<p>&#x957F;&#x8DD1;&#x8005;&#x7684;&#x5FC3;&#x6001;&#xFF1A;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x51F8;&#x663E;&#x81EA;&#x5DF1;&#x7684;NB&#xFF0C;&#x800C;&#x662F;&#x4E3A;&#x4E86;&#x548C;&#x81EA;&#x5DF1;&#x5185;&#x5FC3;&#x505A;&#x6597;&#x4E89;&#x3002;</p>
<p>P23&#x9875;&#x8C08;&#x4E86;2&#xFF0C;3&#x9875;&#x5173;&#x4E8E;&#x4EBA;&#x683C;&#x72EC;&#x7ACB;&#x7684;&#x8BDD;&#x9898;&#xFF0C;&#x9887;&#x6709;&#x54F2;&#x7406;&#xFF1A;</p>
<blockquote>
<p>&#x4E0D;&#x8FC7;&#xFF0C;&#x6B63;&#x662F;&#x56E0;&#x4E3A;&#x6709;&#x4E86;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x4EBA;&#xFF0C;&#x8FD9;&#x4E16;&#x95F4;&#x65B9;&#x662F;&#x4E16;&#x95F4;&#x3002;&#x522B;&#x4EBA;&#x81EA;&#x6709;&#x4EF7;&#x503C;&#x89C2;&#x548C;&#x4E0E;&#x4E4B;&#x76F8;&#x914D;&#x7684;&#x6D3B;&#x6CD5;&#xFF0C;&#x6211;&#x4E5F;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4EF7;&#x503C;&#x89C2;&#x548C;&#x4E0E;&#x4E4B;&#x76F8;&#x914D;&#x7684;&#x6D3B;&#x6CD5;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x5DEE;&#x5F02;&#x4EA7;&#x751F;&#x4E86;&#x7EC6;&#x5FAE;&#x7684;&#x5206;&#x6B67;&#xFF0C;&#x6570;&#x4E2A;&#x5206;&#x6B67;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#xFF0C;&#x5C31;&#x53EF;&#x80FD;&#x53D1;&#x5C55;&#x6210;&#x5927;&#x7684;&#x8BEF;&#x4F1A;&#xFF0C;&#x8BA9;&#x4EBA;&#x6536;&#x5230;&#x65E0;&#x7F18;&#x65E0;&#x6545;&#x7684;&#x975E;&#x96BE;&#x3002;&#x906D;&#x5230;&#x8BEF;&#x89E3;&#xFF0C;&#x53D7;&#x5230;&#x975E;&#x96BE;&#xFF0C;&#x7EDD;&#x975E;&#x4EE4;&#x4EBA;&#x6109;&#x5FEB;&#x7684;&#x4E8B;&#x4EF6;&#xFF0C;&#x8FD8;&#x53EF;&#x80FD;&#x4F7F;&#x5FC3;&#x7075;&#x6536;&#x5230;&#x6DF1;&#x523B;&#x7684;&#x521B;&#x4F24;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x75DB;&#x82E6;&#x7684;&#x4F53;&#x9A8C;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x60F3;&#x8D77;&#x6765;&#xFF0C;&#x6B63;&#x662F;&#x8DDF;&#x522B;&#x4EBA;&#x591A;&#x5C11;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF0C;&#x4EBA;&#x624D;&#x5F97;&#x4EE5;&#x786E;&#x5B9A;&#x81EA;&#x6211;&#xFF0C;&#x4E00;&#x76F4;&#x4F5C;&#x4E3A;&#x72EC;&#x7ACB;&#x7684;&#x5B58;&#x5728;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x5FC3;&#x7075;&#x6240;&#x53D7;&#x7684;&#x4F24;&#xFF0C;&#x4FBF;&#x662F;&#x4EBA;&#x4E3A;&#x8FD9;&#x79CD;&#x72EC;&#x7ACB;&#x6027;&#x800C;&#x4E0D;&#x5F97;&#x4E0D;&#x652F;&#x4ED8;&#x7ED9;&#x4E16;&#x754C;&#x7684;&#x4EE3;&#x4EF7;&#x5427;&#x3002;</p>
</blockquote>
<p>&#x9996;&#x5148;&#x60F3;&#x5230;&#x7684;&#x8BDD;&#x5C31;&#x662F;&#xFF1A;&#x6210;&#x719F;&#x4E5F;&#x5373;&#x610F;&#x5473;&#x8FD9;&#x66F4;&#x52A0;&#x5305;&#x5BB9;&#x3002;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x7EDD;&#x5BF9;&#x4E0D;&#x662F;&#x975E;&#x9ED1;&#x5373;&#x767D;&#x7684;&#xFF0C;&#x800C;&#x662F;&#x590D;&#x6742;&#x7684;&#xFF0C;&#x4EA4;&#x6742;&#x7684;&#x903B;&#x8F91;&#x8F7D;&#x4F53;&#x3002;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x9047;&#x5230;&#x4E86;&#x975E;&#x8BAE;&#x3001;&#x4E0D;&#x8D5E;&#x540C;&#xFF0C;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x8FC7;&#x9519;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x522B;&#x4EBA;&#x7684;&#x8FC7;&#x9519;&#xFF0C;&#x800C;&#x53EF;&#x80FD;&#x8FD9;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x300C;&#x522B;&#x4EBA;&#x7684;&#x4EF7;&#x503C;&#x89C2;&#x548C;&#x4E0E;&#x4E4B;&#x76F8;&#x914D;&#x7684;&#x6D3B;&#x6CD5;&#x300D;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x7684;&#x662F;&#x63A5;&#x53D7;&#x8FD9;&#x4EFD;&#x5DEE;&#x5F02;&#xFF0C;&#x4F46;&#x662F;&#x52AA;&#x529B;&#x7EF4;&#x6301;&#x81EA;&#x5DF1;&#x4EBA;&#x683C;&#x7684;&#x72EC;&#x7ACB;&#x3002;</p>
<blockquote>
<p>&#x5C06;&#x5E97;&#x94FA;&#x968F;&#x610F;&#x4EA4;&#x6258;&#x7ED9;&#x67D0;&#x4E2A;&#x4EBA;&#xFF0C;&#x81EA;&#x5DF1;&#x8EB2;&#x5230;&#x522B;&#x5904;&#x53BB;&#x5199;&#x5C0F;&#x8BF4;&#xFF0C;&#x8FD9;&#x79CD;&#x8BA8;&#x5DE7;&#x7684;&#x4E8B;&#x60C5;&#x6211;&#x505A;&#x4E0D;&#x6765;&#x3002;&#x7AED;&#x5C3D;&#x5168;&#x529B;&#x57CB;&#x5934;&#x82E6;&#x5E72;&#xFF0C;&#x8FD8;&#x662F;&#x5E72;&#x4E0D;&#x597D;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5FC3;&#x5B89;&#x7406;&#x5F97;&#x5730;&#x653E;&#x5F00;&#x624B;&#x4E86;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5982;&#x679C;&#x56E0;&#x4E3A;&#x6A21;&#x68F1;&#x4E24;&#x53EF;&#x3001;&#x534A;&#x5FC3;&#x534A;&#x610F;&#x800C;&#x5DF2;&#x5931;&#x8D25;&#x544A;&#x7EC8;&#xFF0C;&#x61CA;&#x6094;&#x4E4B;&#x60C5;&#x53EA;&#x6015;&#x4E45;&#x4E45;&#x65E0;&#x6CD5;&#x62C2;&#x53BB;&#x3002;</p>
</blockquote>
<p>&#x300C;&#x52AA;&#x529B;&#x4F46;&#x5931;&#x8D25; VS &#x61CA;&#x6094;&#x6CA1;&#x8BD5;&#x76F4;&#x63A5;&#x5931;&#x8D25;&#x300D;&#x54EA;&#x4E00;&#x4E2A;&#x66F4;&#x52A0;&#x75DB;&#x82E6;&#x5462;&#xFF1F;&#x770B;&#x5230;&#x559C;&#x6B22;&#x7684;&#x59B9;&#x5B50;&#x5C31;&#x53BB;&#x8FFD;&#x5427;&#x3002;</p>
<blockquote>
<p>&#x53EA;&#x662F;&#x6211;&#x60F3;&#xFF0C;&#x5E74;&#x8F7B;&#x7684;&#x65F6;&#x5019;&#x59D1;&#x4E14;&#x4E0D;&#x8BBA;&#xFF0C;&#x4EBA;&#x751F;&#x4E4B;&#x4E2D;&#x603B;&#x6709;&#x4E00;&#x4E2A;&#x5148;&#x540E;&#x987A;&#x5E8F;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6309;&#x7167;&#x4F9D;&#x5E8F;&#x5B89;&#x6392;&#x65F6;&#x95F4;&#x548C;&#x80FD;&#x91CF;&#x3002;&#x5230;&#x4E00;&#x5B9A;&#x7684;&#x5E74;&#x9F84;&#x4E4B;&#x524D;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x5728;&#x5FC3;&#x4E2D;&#x5236;&#x5B9A;&#x597D;&#x8FD9;&#x6837;&#x7684;&#x89C4;&#x5212;&#xFF0C;&#x4EBA;&#x751F;&#x5C31;&#x4F1A;&#x5931;&#x53BB;&#x7126;&#x70B9;&#xFF0C;&#x53D8;&#x5F97;&#x5F20;&#x9A70;&#x5931;&#x5F53;&#x3002;</p>
</blockquote>
<p>&#x4E00;&#x5B9A;&#x7684;&#x5E74;&#x9F84;&#x505A;&#x4E00;&#x5B9A;&#x5E74;&#x9F84;&#x5E72;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5B89;&#x6392;&#x597D;&#x300C;&#x65F6;&#x95F4;&#x548C;&#x80FD;&#x91CF;&#x300D;&#x662F;&#x4EBA;&#x751F;&#x662F;&#x5426;&#x8FC7;&#x5F97;&#x5F97;&#x5F53;&#x7684;&#x91CD;&#x8981;&#x6307;&#x6807;&#x3002;</p>
<blockquote>
<p>&#x5728;&#x5B66;&#x6821;&#x91CC;&#x9762;&#x6211;&#x4EEC;&#x5B66;&#x5230;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5C31;&#x662F;&#x300C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E1C;&#x897F;&#x5728;&#x5B66;&#x6821;&#x91CC;&#x5B66;&#x4E0D;&#x5230;&#x300D;&#x8FD9;&#x4E00;&#x771F;&#x7406;&#x3002;</p>
</blockquote>
<p>&#x795E;&#x5410;&#x69FD;&#xFF0C;&#x751F;&#x6D3B;&#x5728;&#x4E8E;&#x5B66;&#x4E60;&#x548C;&#x8DF5;&#x884C;&#xFF0C;&#x5B66;&#x5230;&#x7684;&#x4E1C;&#x897F;&#x66F4;&#x591A;&#x662F;&#x522B;&#x4EBA;&#x7684;&#xFF0C;&#x800C;&#x8DF5;&#x884C;&#x7684;&#x4E1C;&#x897F;&#x4E8E;&#x65AF;&#x800C;&#x8A00;&#x624D;&#x662F;&#x6700;&#x4EF7;&#x503C;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6545;&#x6B64;&#x7406;&#x89E3;&#x4E4B;&#x3002;</p>
<blockquote>
<p>&#x4E4B;&#x524D;&#xFF0C;&#x65E0;&#x8BBA;&#x591A;&#x4E48;&#x75DB;&#x82E6;&#xFF0C;&#x6211;&#x90FD;&#x4E0D;&#x8D70;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x7684;&#x9A84;&#x50B2;&#x3002;&#x9A6C;&#x62C9;&#x677E;&#x662F;&#x8DD1;&#x7684;&#x6BD4;&#x8D5B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8D70;&#x7684;&#x6BD4;&#x8D5B;&#x3002;</p>
</blockquote>
<p>&#x300C;&#x8FD9;&#x662F;&#x6211;&#x7684;&#x9A84;&#x50B2;&#x300D;&#x662F;&#x591A;&#x4E48;&#x7684;&#x6709;&#x529B;&#x3002;</p>
<blockquote>
<p>&#x624D;&#x534E;&#x4E4B;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x518D;&#x4E3E;&#x5C0F;&#x8BF4;&#x5BB6;&#x7684;&#x91CD;&#x8981;&#x8D44;&#x8D28;&#xFF0C;&#x6211;&#x5C06;&#x6BEB;&#x4E0D;&#x72B9;&#x8C6B;&#x5730;&#x4E3E;&#x51FA;&#x96C6;&#x4E2D;&#x529B;&#x6765;&#x3002;&#x8FD9;&#x662F;&#x5C06;&#x81EA;&#x5DF1;&#x6709;&#x9650;&#x7684;&#x624D;&#x80FD;&#x6C47;&#x96C6;&#xFF0C;&#x5076;&#x5C14;&#x503E;&#x6CE8;&#x4E8E;&#x6700;&#x4E3A;&#x9700;&#x8981;&#x4E4B;&#x5904;&#x7684;&#x80FD;&#x529B;&#x3002;&#x6CA1;&#x6709;&#x5B83;&#xFF0C;&#x5219;&#x4E0D;&#x8DB3;&#x4EE5;&#x529E;&#x6210;&#x4EFB;&#x4F55;&#x5927;&#x4E8B;&#xFF0C;&#x6709;&#x6548;&#x5730;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x529B;&#x91CF;&#xFF0C;&#x5C31;&#x53EF;&#x907F;&#x514D;&#x81EA;&#x5DF1;&#x624D;&#x80FD;&#x7684;&#x4E0D;&#x8DB3;&#x548C;&#x504F;&#x9887;&#x3002;</p>
</blockquote>
<p>&#x65F6;&#x95F4;&#x7BA1;&#x7406;&#xFF0C;&#x96C6;&#x4E2D;&lt;=&gt;&#x6548;&#x7387;&#x3002;</p>
<blockquote>
<p>&#x6000;&#x7740;&#x300C;&#x4E0D;&#x80FD;&#x957F;&#x547D;&#x767E;&#x5C81;&#x4E0D;&#x8981;&#x7D27;&#xFF0C;&#x81F3;&#x5C11;&#x73B0;&#x5728;&#x6709;&#x751F;&#x4E4B;&#x5E74;&#x8FC7;&#x5F97;&#x5B8C;&#x7F8E;&#x300D;&#x8FD9;&#x79CD;&#x5FC3;&#x60C5;&#x7684;&#x8DD1;&#x6B65;&#x8005;&#xFF0C;&#x5E94;&#x8BE5;&#x4E0D;&#x5C11;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x5728;&#x4E2A;&#x4EBA;&#x7684;&#x5C40;&#x9650;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x81EA;&#x5DF1;&#x6709;&#x6548;&#x5730;&#x71C3;&#x70E7;&#x2014;&#x2014;&#x54EA;&#x6015;&#x53EA;&#x662F;&#x4E00;&#x4E01;&#x70B9;&#xFF0C;&#x8FD9;&#x4FBF;&#x662F;&#x8DD1;&#x6B65;&#x7684;&#x672C;&#x8D28;&#xFF0C;&#x4E5F;&#x662F;&#x6216;&#x8005;&#x4E00;&#x4E8B;&#x7684;&#x9690;&#x55BB;&#x3002;</p>
</blockquote>
<p>&#x751F;&#x547D;&#x5728;&#x4E8E;&#x6298;&#x817E;&#xFF0C;&#x594B;&#x6597;&#xFF0C;&#x4E3A;&#x4E86;&#x9047;&#x5230;&#x300C;&#x66F4;&#x52A0;&#x7F8E;&#x597D;&#x7684;&#x81EA;&#x5DF1;&#x300D;</p>
<blockquote>
<p>&#x6211;&#x53EF;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x8D70;&#x8DEF;&#x800C;&#x524D;&#x6765;&#x53C2;&#x52A0;&#x8FD9;&#x884C;&#x8D5B;&#x4E8B;&#xFF0C;&#x800C;&#x662F;&#x4E3A;&#x4E86;&#x8DD1;&#x6B65;&#x624D;&#x6765;&#x7684;&#x3002;&#x4E3A;&#x4E86;&#x8FD9;&#x4E2A;&#xFF0C;&#x4EC5;&#x4EC5;&#x4E3A;&#x4E86;&#x8FD9;&#x4E2A;&#xFF0C;&#x6211;&#x624D;&#x5750;&#x98DE;&#x673A;&#x8D76;&#x5230;&#x65E5;&#x672C;&#x7684;&#x5317;&#x7AEF;&#x3002;&#x4E0D;&#x7BA1;&#x5954;&#x8DD1;&#x901F;&#x5EA6;&#x964D;&#x4F4E;&#x4E86;&#x591A;&#x5C11;&#xFF0C;&#x6211;&#x90FD;&#x4E0D;&#x80FD;&#x8D70;&#xFF0C;&#x8FD9;&#x662F;&#x539F;&#x5219;&#xFF0C;&#x8FDD;&#x80CC;&#x4E86;&#x81EA;&#x5DF1;&#x5B9A;&#x4E0B;&#x7684;&#x539F;&#x5219;&#xFF0C;&#x54EA;&#x6015;&#x53EA;&#x6709;&#x4E00;&#x6B21;&#xFF0C;&#x4EE5;&#x540E;&#x5C31;&#x5C06;&#x8FDD;&#x80CC;&#x66F4;&#x591A;&#x7684;&#x539F;&#x5219;&#xFF0C;&#x60F3;&#x8DD1;&#x5B8C;&#x8FD9;&#x6B21;&#x6BD4;&#x8D5B;&#x5C31;&#x96BE;&#x4E0A;&#x52A0;&#x96BE;&#x4E86;&#x3002;</p>
</blockquote>
<p>&#x771F;&#x5FC3;&#x4F69;&#x670D;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x6240;&#x8C13;&#x610F;&#x5FD7;&#x529B;&#x9AD8;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x575A;&#x5B9A;&#x539F;&#x5219;&#xFF0C;&#x5E76;&#x4E3A;&#x4E4B;&#x52AA;&#x529B;&#x5427;&#x3002;</p>
<blockquote>
<p>&#x6211;&#x89C9;&#x5F97;&#xFF0C;&#x6240;&#x8C13;&#x7ED3;&#x675F;&#xFF0C;&#x4E0D;&#x8FC7;&#x662F;&#x6682;&#x65F6;&#x544A;&#x4E00;&#x6BB5;&#x843D;&#xFF0C;&#x5E76;&#x65E0;&#x592A;&#x5927;&#x7684;&#x610F;&#x4E49;&#x3002;&#x5C31;&#x540C;&#x6D3B;&#x7740;&#x4E00;&#x6837;&#x3002;&#x5E76;&#x975E;&#x56E0;&#x4E3A;&#x6709;&#x4E86;&#x7ED3;&#x675F;&#xFF0C;&#x8FC7;&#x7A0B;&#x624D;&#x66F4;&#x5177;&#x6709;&#x610F;&#x4E49;&#x3002;&#x800C;&#x662F;&#x4E3A;&#x4E86;&#x66F4;&#x52A0;&#x5730;&#x51F8;&#x663E;&#x8FC7;&#x7A0B;&#x8FD9;&#x73A9;&#x610F;&#x513F;&#x7684;&#x610F;&#x4E49;&#xFF0C;&#x6291;&#x6216;&#x62D0;&#x5F2F;&#x62B9;&#x89D2;&#x5730;&#x6BD4;&#x55BB;&#x5176;&#x5C40;&#x9650;&#x6027;&#xFF0C;&#x624D;&#x5728;&#x67D0;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x59D1;&#x4E14;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x7ED3;&#x675F;&#x3002;</p>
</blockquote>
<p>&#x501F;&#x7528;&#x4F5C;&#x8005;&#x7684;&#x539F;&#x6587;&#xFF1A;&#x300C;&#x76F8;&#x5F53;&#x7684;&#x54F2;&#x5B66;&#x300D;&#x3002;&#x7ED3;&#x679C;&#x4E4B;&#x4E8E;&#x8FC7;&#x7A0B;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x9526;&#x4E0A;&#x6DFB;&#x82B1;&#x7F62;&#x4E86;&#xFF0C;&#x505A;&#x597D;&#x8FC7;&#x7A0B;&#x624D;&#x662F;&#x505A;&#x4E8B;&#x60C5;&#x8981;&#x8FFD;&#x6C42;&#x7684;&#x771F;&#x8C1B;&#x3002;</p>
<blockquote>
<p>&#x8FD9;&#x4E5F;&#x8BB8;&#x548C;&#x7EC3;&#x4E60;&#x67B6;&#x5B50;&#x9F13;&#x5F88;&#x76F8;&#x4F3C;&#x3002;&#x4E00;&#x8FDE;&#x51E0;&#x5929;&#x53EA;&#x7EC3;&#x4E60;&#x4F4E;&#x97F3;&#x5927;&#x9F13;&#x7684;&#x6F14;&#x594F;&#xFF0C;&#x4E00;&#x8FDE;&#x51E0;&#x5929;&#x5149;&#x505A;x&#x7684;&#x8BAD;&#x7EC3;&#xFF0C;&#x53C8;&#x4E00;&#x8FDE;&#x51E0;&#x5929;&#x53EA;&#x7EC3;&#x9523;&#x2026;&#x5355;&#x8C03;&#x800C;&#x65E0;&#x804A;&#x3002;&#x7136;&#x800C;&#x5F53;&#x5B83;&#x4EEC;&#x6210;&#x4E3A;&#x4E00;&#x4F53;&#xFF0C;&#x5C31;&#x51FA;&#x73B0;&#x4E86;&#x5B8C;&#x7F8E;&#x7684;&#x8282;&#x594F;&#x3002;&#x4E3A;&#x4E86;&#x8FBE;&#x5230;&#x8FD9;&#x4E00;&#x6B65;&#xFF0C;&#x5C31;&#x5F97;&#x6267;&#x62D7;&#x7684;&#x3001;&#x4E25;&#x683C;&#x5730;&#x3001;&#x575A;&#x97E7;&#x4E0D;&#x62D4;&#x5730;&#xFF0C;&#x5C06;&#x4E00;&#x4E2A;&#x4E2A;&#x87BA;&#x4E1D;&#x9489;&#x4F9D;&#x6B21;&#x62E7;&#x7D27;&#x3002;&#x5F53;&#x7136;&#x5F97;&#x8D39;&#x65F6;&#x8017;&#x65E5;&#xFF0C;&#x7136;&#x800C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4ED8;&#x51FA;&#x65F6;&#x95F4;&#x4E43;&#x662F;&#x6700;&#x597D;&#x7684;&#x6377;&#x5F84;&#x4E86;&#x3002;</p>
</blockquote>
<p>&#x5C31;&#x90A3;&#x4E00;&#x53E5;&#x8BDD;&#xFF1A;&#x4ED8;&#x51FA;&#x65F6;&#x95F4;&#x4E43;&#x662F;&#x6700;&#x597D;&#x7684;&#x6377;&#x5F84;&#x4E86;&#x3002;&#x60F3;&#x5230;&#x4E86;&#x7535;&#x5F71;<a href="http://movie.douban.com/subject/25773932" target="_blank" rel="noopener">&#x7206;&#x88C2;&#x9F13;&#x624B;</a>&#x3002;</p>
<blockquote>
<p>&#x6B63;&#x56E0;&#x4E3A;&#x75DB;&#x82E6;&#xFF0C;&#x6B63;&#x56E0;&#x4E3A;&#x523B;&#x610F;&#x7ECF;&#x5386;&#x75DB;&#x82E6;&#xFF0C;&#x6211;&#x624D;&#x4ECE;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x6D3B;&#x7740;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x81F3;&#x5C11;&#x662F;&#x53D1;&#x73B0;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x6211;&#x73B0;&#x5728;&#x8BA4;&#x8BC6;&#x5230;&#xFF1A;&#x751F;&#x5B58;&#x7684;&#x8D28;&#x91CF;&#x5E76;&#x975E;&#x6210;&#x7EE9;&#x3001;&#x6570;&#x5B57;&#x3001;&#x540D;&#x6B21;&#x4E4B;&#x7C7B;&#x56FA;&#x5B9A;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x800C;&#x662F;&#x542B;&#x4E8E;&#x884C;&#x4E3A;&#x4E4B;&#x4E2D;&#x7684;&#x6D41;&#x52A8;&#x6027;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x5BF9;&#x4E8E;&#x6211;&#x8FD9;&#x6837;&#x7684;&#x8DD1;&#x8005;&#xFF0C;&#x7B2C;&#x4E00;&#x91CD;&#x8981;&#x7684;&#x662F;&#x7528;&#x53CC;&#x811A;&#x5B9E;&#x5B9E;&#x5728;&#x5728;&#x5730;&#x8DD1;&#x8FC7;&#x4E00;&#x4E2A;&#x4E2A;&#x7EC8;&#x70B9;&#xFF0C;&#x8BA9;&#x81EA;&#x5DF1;&#x65E0;&#x6028;&#x65E0;&#x6094;&#xFF1A;&#x5E94;&#x5F53;&#x5C3D;&#x7684;&#x529B;&#x6211;&#x90FD;&#x5C3D;&#x4E86;&#xFF0C;&#x5E94;&#x5F53;&#x5FCD;&#x8010;&#x7684;&#x6211;&#x90FD;&#x5FCD;&#x8010;&#x4E86;&#x3002;&#x4ECE;&#x90A3;&#x4E9B;&#x5931;&#x8D25;&#x548C;&#x559C;&#x60A6;&#x4E4B;&#x4E2D;&#xFF0C;&#x5177;&#x4F53;&#x7684;&#x2014;&#x2014;&#x5982;&#x4F55;&#x7410;&#x7EC6;&#x90FD;&#x6CA1;&#x5173;&#x7CFB;&#x2014;&#x2014;&#x4E0D;&#x65AD;&#x5438;&#x53D6;&#x6559;&#x8BAD;&#x3002;&#x5E76;&#x4E14;&#x6295;&#x5165;&#x65F6;&#x95F4;&#x6295;&#x5165;&#x5E74;&#x6708;&#xFF0C;&#x9010;&#x4E00;&#x5730;&#x7D2F;&#x79EF;&#x8FD9;&#x6837;&#x7684;&#x6BD4;&#x8D5B;&#xFF0C;&#x6700;&#x7EC8;&#x6253;&#x5230;&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x5B8C;&#x5168;&#x63A5;&#x53D7;&#x7684;&#x5883;&#x754C;&#xFF0C;&#x6291;&#x6216;&#x65E0;&#x9650;&#x76F8;&#x8FD1;&#x7684;&#x6240;&#x5728;&#x3002;&#x6069;&#xFF0C;&#x8FD9;&#x4E2A;&#x8868;&#x8FBE;&#x6050;&#x6015;&#x66F4;&#x52A0;&#x8D34;&#x5207;&#x3002;</p>
</blockquote>
<p>&#x7ECF;&#x5386;&#x75DB;&#x82E6;&#x624D;&#x6709;&#x6D3B;&#x7740;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x751F;&#x547D;&#x7684;&#x672C;&#x8D28;&#x5728;&#x4E8E;&#x8D85;&#x8D8A;&#x81EA;&#x5DF1;&#x7684;&#x6781;&#x9650;&#xFF0C;&#x5728;&#x4E8E;&#x8BA9;&#x81EA;&#x5DF1;&#x65E0;&#x6028;&#x65E0;&#x6094;&#xFF0C;&#x5728;&#x4E8E;&#x4E0D;&#x65AD;&#x7684;&#x2014;&#x2014;&#x5982;&#x4F55;&#x7410;&#x7EC6;&#x90FD;&#x6CA1;&#x5173;&#x7CFB;&#x2014;&#x2014;&#x7684;&#x603B;&#x7ED3;&#x63D0;&#x9AD8;&#xFF0C;&#x5728;&#x4E8E;&#x5F97;&#x5230;&#x66F4;&#x52A0;&#x5B8C;&#x7F8E;&#x7684;&#x81EA;&#x5DF1;&#x3002;</p>
<h3 id="wrap-up">wrap up</h3>
<p>&#x6211;&#x60F3;&#x8FD9;&#x5E94;&#x8BE5;&#x4E5F;&#x662F;&#x6211;&#x8FD1;&#x6BB5;&#x65F6;&#x95F4;&#x770B;&#x5230;&#x7684;&#x6700;&#x597D;&#x7684;&#x300E;&#x52B1;&#x5FD7;&#x300F;&#x4E66;&#x4E86;&#x3002;&#x5BF9;&#x6211;&#x800C;&#x8A00;&#x672C;&#x4E66;&#x66F4;&#x52A0;&#x6709;&#x300E;&#x9F13;&#x52A8;&#x6027;&#x300F;&#x7684;&#x5730;&#x65B9;&#x5728;&#x4E8E;&#xFF0C;&#x4F5C;&#x8005;&#x662F;&#x8EAB;&#x4F53;&#x529B;&#x884C;&#x7684;&#x5728;&#x4E8C;&#x5341;&#x5E74;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x5728;&#x4FEE;&#x884C;&#x81EA;&#x5DF1;&#x3002;&#x8DD1;&#x6B65;&#x8FD9;&#x6837;&#x770B;&#x8D77;&#x6765;&#x6700;&#x7B80;&#x5355;&#x53C8;&#x65E0;&#x804A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5374;&#x4E0D;&#x5931;&#x4E3A;&#x4E00;&#x79CD;&#x6700;&#x6709;&#x6548;&#x7684;&#x4FEE;&#x884C;&#x8FD0;&#x52A8;&#x4E4B;&#x4E00;&#x3002;&#x5982;&#x4F5C;&#x8005;&#x8FA9;&#x8BC1;&#x7684;&#x5206;&#x6790;&#x300E;&#x7ED3;&#x679C;&#x548C;&#x8FC7;&#x7A0B;&#x7684;&#x300F;&#x7684;&#x903B;&#x8F91;&#x4E00;&#x6837;&#xFF0C;&#x4FEE;&#x884C;&#x4E0D;&#x662F;&#x76EE;&#x7684;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x8BA9;&#x81EA;&#x5DF1;&#x6210;&#x4E3A;&#x66F4;&#x52A0;&#x5B8C;&#x7F8E;&#x7684;&#x81EA;&#x5DF1;&#x3002;Keep Running.</p>

      
    </div>

    
      

  <div class="popular-posts-header">相关文章</div>
  <ul class="popular-posts">
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/04/01/how-to-life-learn-note/" rel="bookmark">《活法》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/02/19/how-to-measure-your-life-reading-notes/" rel="bookmark">《如何衡量你的人生》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/02/03/the-art-of-stop-learn-note-md/" rel="bookmark">《止学》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/02/01/the-art-of-unix-programming-reading-notes/" rel="bookmark">《The Art of UNIX Programming》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/08/07/book-change-the-conversation-learn-note/" rel="bookmark">《解决冲突的关键技巧》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/03/18/book-touchable-tidy-up-life-md/" rel="bookmark">《怦然心动的人生整理魔法》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/06/27/peopleware-reading-notes/" rel="bookmark">《人件》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/11/30/money-hacker-reading-note/" rel="bookmark">《富爸爸穷爸爸》&《小狗钱钱》读书笔记</a></div>
      
    </li>
  
  </ul>


    

    
    
    

    

    

    
      <div>
        <ul class="post-copyright">
  <li class="post-copyright-author">
    <strong>本文作者： </strong>whiledoing</li>
  <li class="post-copyright-link">
    <strong>本文链接：</strong>
    <a href="http://whiledoing.me/2016/06/28/book-thinking-about-running-md/" title="《当我跑步时我谈些什么》读书笔记">http://whiledoing.me/2016/06/28/book-thinking-about-running-md/</a>
  </li>
  <li class="post-copyright-license">
    <strong>版权声明： </strong>本博客所有文章除特别声明外，均采用 <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/" rel="external nofollow" target="_blank">CC BY-NC-SA 4.0</a> 许可协议。转载请注明出处！</li>
</ul>

      </div>
    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/读书笔记/" rel="tag"># 读书笔记</a>
          
            <a href="/tags/哲理/" rel="tag"># 哲理</a>
          
        </div>
      

      
      
        <div class="post-widgets">
        

        

        
          
          <div class="social_share">
            
               <div>
                 
  <div class="bdsharebuttonbox">
    <a href="#" class="bds_tsina" data-cmd="tsina" title="分享到新浪微博"></a>
    <a href="#" class="bds_douban" data-cmd="douban" title="分享到豆瓣网"></a>
    <a href="#" class="bds_sqq" data-cmd="sqq" title="分享到QQ好友"></a>
    <a href="#" class="bds_qzone" data-cmd="qzone" title="分享到QQ空间"></a>
    <a href="#" class="bds_weixin" data-cmd="weixin" title="分享到微信"></a>
    <a href="#" class="bds_tieba" data-cmd="tieba" title="分享到百度贴吧"></a>
    <a href="#" class="bds_twi" data-cmd="twi" title="分享到Twitter"></a>
    <a href="#" class="bds_fbook" data-cmd="fbook" title="分享到Facebook"></a>
    <a href="#" class="bds_more" data-cmd="more"></a>
    <a class="bds_count" data-cmd="count"></a>
  </div>
  <script>
    window._bd_share_config = {
      "common": {
        "bdText": "",
        "bdMini": "2",
        "bdMiniList": false,
        "bdPic": ""
      },
      "share": {
        "bdSize": "16",
        "bdStyle": "0"
      },
      "image": {
        "viewList": ["tsina", "douban", "sqq", "qzone", "weixin", "twi", "fbook"],
        "viewText": "分享到：",
        "viewSize": "16"
      }
    }
  </script>

<script>
  with(document)0[(getElementsByTagName('head')[0]||body).appendChild(createElement('script')).src='//bdimg.share.baidu.com/static/api/js/share.js?cdnversion='+~(-new Date()/36e5)];
</script>

               </div>
            
            
          </div>
        
        </div>
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/06/28/learn-mongo-md/" rel="next" title="mongo学习笔记">
                <i class="fa fa-chevron-left"></i> mongo学习笔记
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/08/07/book-change-the-conversation-learn-note/" rel="prev" title="《解决冲突的关键技巧》读书笔记">
                《解决冲突的关键技巧》读书笔记 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


  </div>


          </div>
          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <img class="site-author-image" itemprop="image"
                src="/images/avatar.jpeg"
                alt="whiledoing" />
            
              <p class="site-author-name" itemprop="name">whiledoing</p>
              <p class="site-description motion-element" itemprop="description">喜欢一切简单且美的事物，包括人。</p>
          </div>

          
            <nav class="site-state motion-element">
              
                <div class="site-state-item site-state-posts">
                
                  <a href="/archives/">
                
                    <span class="site-state-item-count">60</span>
                    <span class="site-state-item-name">日志</span>
                  </a>
                </div>
              

              

              
                
                
                <div class="site-state-item site-state-tags">
                  <a href="/tags/index.html">
                    
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                    <span class="site-state-item-count">32</span>
                    <span class="site-state-item-name">标签</span>
                  </a>
                </div>
              
            </nav>
          

          

          
            <div class="links-of-author motion-element">
              
                <span class="links-of-author-item">
                  <a href="https://github.com/whiledoing" target="_blank" title="GitHub">GitHub</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="http://www.douban.com/people/58249409" target="_blank" title="豆瓣">豆瓣</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="https://www.zhihu.com/people/whiledoing" target="_blank" title="知乎">知乎</a>
                  
                </span>
              
            </div>
          

          
          

          
          

          
            
          
          

        </div>
      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-3"><a class="nav-link" href="#extract"><span class="nav-number">1.</span> <span class="nav-text">extract</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#wrap-up"><span class="nav-number">2.</span> <span class="nav-text">wrap up</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; 2016 – <span itemprop="copyrightYear">2018</span>
  <span class="with-love" id="animate">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">whiledoing</span>

  

  
</div>




  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动 v3.7.1</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 – <a class="theme-link" target="_blank" href="https://theme-next.org">NexT.Mist</a> v6.4.0</div>




        








        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

    
	
    

    
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>
























  



  
  
    <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/reading_progress/reading_progress.js"></script>
  


  


  <script type="text/javascript" src="/js/src/utils.js?v=6.4.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=6.4.0"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=6.4.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=6.4.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=6.4.0"></script>



  



  










  





  

  

  
<script>
(function(){
    var bp = document.createElement('script');
    var curProtocol = window.location.protocol.split(':')[0];
    if (curProtocol === 'https') {
        bp.src = 'https://zz.bdstatic.com/linksubmit/push.js';        
    }
    else {
        bp.src = 'http://push.zhanzhang.baidu.com/push.js';
    }
    var s = document.getElementsByTagName("script")[0];
    s.parentNode.insertBefore(bp, s);
})();
</script>


  
  

  
  

  


  
  

  
  
  
  <script src="/lib/pangu/dist/pangu.min.js?v=3.3"></script>
  <script type="text/javascript">pangu.spacingPage();</script>


  
  <script type="text/javascript" src="/js/src/js.cookie.js?v=6.4.0"></script>
  <script type="text/javascript" src="/js/src/scroll-cookie.js?v=6.4.0"></script>


  

  

  
  <style>
    .copy-btn {
      display: inline-block;
      padding: 6px 12px;
      font-size: 13px;
      font-weight: 700;
      line-height: 20px;
      color: #333;
      white-space: nowrap;
      vertical-align: middle;
      cursor: pointer;
      background-color: #eee;
      background-image: linear-gradient(#fcfcfc, #eee);
      border: 1px solid #d5d5d5;
      border-radius: 3px;
      user-select: none;
      outline: 0;
    }

    .highlight-wrap .copy-btn {
      transition: opacity .3s ease-in-out;
      opacity: 0;
      padding: 2px 6px;
      position: absolute;
      right: 4px;
      top: 8px;
    }

    .highlight-wrap:hover .copy-btn,
    .highlight-wrap .copy-btn:focus {
      opacity: 1
    }

    .highlight-wrap {
      position: relative;
    }
  </style>
  <script>
    $('.highlight').each(function (i, e) {
      var $wrap = $('<div>').addClass('highlight-wrap')
      $(e).after($wrap)
      $wrap.append($('<button>').addClass('copy-btn').append('复制').on('click', function (e) {
        var code = $(this).parent().find('.code').find('.line').map(function (i, e) {
          return $(e).text()
        }).toArray().join('\n')
        var ta = document.createElement('textarea')
        document.body.appendChild(ta)
        ta.style.position = 'absolute'
        ta.style.top = '0px'
        ta.style.left = '0px'
        ta.value = code
        ta.select()
        ta.focus()
        var result = document.execCommand('copy')
        document.body.removeChild(ta)
        
        $(this).blur()
      })).on('mouseleave', function (e) {
        var $b = $(this).find('.copy-btn')
        setTimeout(function () {
          $b.text('复制')
        }, 300)
      }).append(e)
    })
  </script>


</body>
</html>
