<!DOCTYPE html>






  


<html class="theme-next mist use-motion" lang="zh-CN">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=2"/>
<meta name="theme-color" content="#222">






  
  
    
    
  <script src="/lib/pace/pace.min.js?v=1.0.2"></script>
  <link href="/lib/pace/pace-theme-minimal.min.css?v=1.0.2" rel="stylesheet">




  
  
  <link rel="stylesheet" media="all" href="/lib/Han/dist/han.min.css?v=3.3">




<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />






















<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=6.2.0" rel="stylesheet" type="text/css" />


  <link rel="apple-touch-icon" sizes="180x180" href="/images/favicon.png?v=6.2.0">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon.png?v=6.2.0">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon.png?v=6.2.0">


  <link rel="mask-icon" href="/images/logo.svg?v=6.2.0" color="#222">









<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    version: '6.2.0',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":false,"onmobile":false},
    fancybox: false,
    fastclick: false,
    lazyload: false,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>


  




  <meta name="description" content="以前看过水湄物语理财相关的书籍，也就关注了她的豆瓣，看到她在豆瓣中推荐这本书销售无处不在。本来听到这名字以为是一本非常俗的讲销售心理学书籍，但看到豆瓣评分有8分之后，还是买回来看了下。其实书的名字有点误导，实际上本书重点讲述的是职场人生感悟，并不限定于销售领域。看完之后很有感触，将相关的重点进行总结。">
<meta name="keywords" content="读书笔记,职场,销售">
<meta property="og:type" content="article">
<meta property="og:title" content="《销售无处不在》读书笔记">
<meta property="og:url" content="http://whiledoing.me/2017/04/08/selling-is-everywhere/index.html">
<meta property="og:site_name" content="whiledoing">
<meta property="og:description" content="以前看过水湄物语理财相关的书籍，也就关注了她的豆瓣，看到她在豆瓣中推荐这本书销售无处不在。本来听到这名字以为是一本非常俗的讲销售心理学书籍，但看到豆瓣评分有8分之后，还是买回来看了下。其实书的名字有点误导，实际上本书重点讲述的是职场人生感悟，并不限定于销售领域。看完之后很有感触，将相关的重点进行总结。">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2018-04-17T13:29:52.918Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="《销售无处不在》读书笔记">
<meta name="twitter:description" content="以前看过水湄物语理财相关的书籍，也就关注了她的豆瓣，看到她在豆瓣中推荐这本书销售无处不在。本来听到这名字以为是一本非常俗的讲销售心理学书籍，但看到豆瓣评分有8分之后，还是买回来看了下。其实书的名字有点误导，实际上本书重点讲述的是职场人生感悟，并不限定于销售领域。看完之后很有感触，将相关的重点进行总结。">






  <link rel="canonical" href="http://whiledoing.me/2017/04/08/selling-is-everywhere/"/>



<script type="text/javascript" id="page.configurations">
  CONFIG.page = {
    sidebar: "",
  };
</script>

  <title>《销售无处不在》读书笔记 | whiledoing</title>
  




<script async src="https://www.googletagmanager.com/gtag/js?id=UA-117714040-1"></script>
<script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'UA-117714040-1');
</script>



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "https://hm.baidu.com/hm.js?6de2920425778ca5a4ee717be5055e96";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>




  <noscript>
  <style type="text/css">
    .use-motion .motion-element,
    .use-motion .brand,
    .use-motion .menu-item,
    .sidebar-inner,
    .use-motion .post-block,
    .use-motion .pagination,
    .use-motion .comments,
    .use-motion .post-header,
    .use-motion .post-body,
    .use-motion .collection-title { opacity: initial; }

    .use-motion .logo,
    .use-motion .site-title,
    .use-motion .site-subtitle {
      opacity: initial;
      top: initial;
    }

    .use-motion {
      .logo-line-before i { left: initial; }
      .logo-line-after i { right: initial; }
    }
  </style>
</noscript>

</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-CN">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">whiledoing</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">喜欢一切简单且美的事物，包括人。</p>
      
  </div>

  <div class="site-nav-toggle">
    <button aria-label="切换导航栏">
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>




<nav class="site-nav">
  
    <ul id="menu" class="menu">
      
        
        
        
          
          <li class="menu-item menu-item-home">
    <a href="/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-home"></i> <br />首页</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-tags">
    <a href="/tags/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />标签</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-archives">
    <a href="/archives/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />归档</a>
  </li>

      
      
    </ul>
  

  
    

  

  
</nav>



  



</div>
    </header>

    


    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  
    <div class="reading-progress-bar"></div>
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://whiledoing.me/2017/04/08/selling-is-everywhere/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="whiledoing">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/images/avatar.jpeg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="whiledoing">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">《销售无处不在》读书笔记
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">

            
            
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              

              
                
              

              <time title="创建时间：2017-04-08 12:49:41" itemprop="dateCreated datePublished" datetime="2017-04-08T12:49:41+08:00">2017-04-08</time>
            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body han-init-context" itemprop="articleBody">

      
      

      
        <p>&#x4EE5;&#x524D;&#x770B;&#x8FC7;<a href="https://www.douban.com/people/foxsshome/" target="_blank" rel="noopener">&#x6C34;&#x6E44;&#x7269;&#x8BED;</a>&#x7406;&#x8D22;&#x76F8;&#x5173;&#x7684;&#x4E66;&#x7C4D;&#xFF0C;&#x4E5F;&#x5C31;&#x5173;&#x6CE8;&#x4E86;&#x5979;&#x7684;&#x8C46;&#x74E3;&#xFF0C;&#x770B;&#x5230;&#x5979;&#x5728;&#x8C46;&#x74E3;&#x4E2D;&#x63A8;&#x8350;&#x8FD9;&#x672C;&#x4E66;<a href="https://book.douban.com/subject/20434393/" target="_blank" rel="noopener">&#x9500;&#x552E;&#x65E0;&#x5904;&#x4E0D;&#x5728;</a>&#x3002;&#x672C;&#x6765;&#x542C;&#x5230;&#x8FD9;&#x540D;&#x5B57;&#x4EE5;&#x4E3A;&#x662F;&#x4E00;&#x672C;&#x975E;&#x5E38;&#x4FD7;&#x7684;&#x8BB2;&#x9500;&#x552E;&#x5FC3;&#x7406;&#x5B66;&#x4E66;&#x7C4D;&#xFF0C;&#x4F46;&#x770B;&#x5230;&#x8C46;&#x74E3;&#x8BC4;&#x5206;&#x6709;8&#x5206;&#x4E4B;&#x540E;&#xFF0C;&#x8FD8;&#x662F;&#x4E70;&#x56DE;&#x6765;&#x770B;&#x4E86;&#x4E0B;&#x3002;&#x5176;&#x5B9E;&#x4E66;&#x7684;&#x540D;&#x5B57;&#x6709;&#x70B9;&#x8BEF;&#x5BFC;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x672C;&#x4E66;&#x91CD;&#x70B9;&#x8BB2;&#x8FF0;&#x7684;&#x662F;&#x804C;&#x573A;&#x4EBA;&#x751F;&#x611F;&#x609F;&#xFF0C;&#x5E76;&#x4E0D;&#x9650;&#x5B9A;&#x4E8E;&#x9500;&#x552E;&#x9886;&#x57DF;&#x3002;&#x770B;&#x5B8C;&#x4E4B;&#x540E;&#x5F88;&#x6709;&#x611F;&#x89E6;&#xFF0C;&#x5C06;&#x76F8;&#x5173;&#x7684;&#x91CD;&#x70B9;&#x8FDB;&#x884C;&#x603B;&#x7ED3;&#x3002;</p>
<a id="more"></a>
<blockquote>
<p>&#x7BA1;&#x7406;&#x5B66;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x540D;&#x5B57;&#x53EB;&#x505A;&#x300C;&#x8611;&#x83C7;&#x6548;&#x5E94;&#x300D;&#xFF0C;&#x6307;&#x8611;&#x83C7;&#x957F;&#x5728;&#x9634;&#x6697;&#x7684;&#x89D2;&#x843D;&#x91CC;&#xFF0C;&#x5F97;&#x4E0D;&#x5230;&#x9633;&#x5149;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x80A5;&#x6599;&#xFF0C;&#x81EA;&#x751F;&#x81EA;&#x706D;&#xFF0C;&#x53EA;&#x6709;&#x957F;&#x5230;&#x8DB3;&#x591F;&#x9AD8;&#x7684;&#x65F6;&#x5019;&#x624D;&#x4F1A;&#x88AB;&#x4EBA;&#x5173;&#x6CE8;&#xFF0C;&#x800C;&#x6B64;&#x65F6;&#x5B83;&#x81EA;&#x5DF1;&#x5DF2;&#x7ECF;&#x80FD;&#x591F;&#x63A5;&#x53D7;&#x9633;&#x5149;&#x3002;&#x4E0D;&#x4EC5;&#x65B0;&#x5458;&#x5DE5;&#x8981;&#x7ECF;&#x5386;&#x8611;&#x83C7;&#x671F;&#xFF0C;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x7EA7;&#x522B;&#x7684;&#x804C;&#x573A;&#x4EBA;&#x5176;&#x5B9E;&#x90FD;&#x5904;&#x4E8E;&#x8611;&#x83C7;&#x7684;&#x5883;&#x5730;&#xFF1A;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x6CA1;&#x6709;&#x5173;&#x5FC3;&#x548C;&#x57F9;&#x517B;&#x4F60;&#x7684;&#x4E49;&#x52A1;&#xFF0C;&#x5F97;&#x4E0D;&#x5230;&#x517B;&#x6599;&#x662F;&#x81EA;&#x7136;&#x72B6;&#x6001;&#xFF0C;&#x800C;&#x5F97;&#x5230;&#x9633;&#x5149;&#x662F;&#x9760;&#x81EA;&#x5DF1;&#x7684;&#x52AA;&#x529B;&#x751F;&#x957F;&#x6362;&#x6765;&#x7684;&#x3002;&#x6210;&#x719F;&#x7684;&#x4EBA;&#x770B;&#x8D77;&#x6765;&#x4E0D;&#x90A3;&#x4E48;&#x50CF;&#x8611;&#x83C7;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x80FD;&#x66F4;&#x5766;&#x7136;&#x5730;&#x9762;&#x5BF9;&#x81EA;&#x5DF1;&#x4E0D;&#x4F1A;&#x51ED;&#x7A7A;&#x5F97;&#x5230;&#x517B;&#x6599;&#x7684;&#x4E8B;&#x5B9E;&#xFF0C;&#x540C;&#x65F6;&#x66F4;&#x5584;&#x4E8E;&#x4F38;&#x957F;&#x8116;&#x5B50;&#x5BFB;&#x627E;&#x9633;&#x5149;&#x3002;</p>
</blockquote>
<p>**&#x804C;&#x573A;&#x4E2D;&#x7684;&#x5347;&#x7EA7;&#x4E0D;&#x662F;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#xFF0C;&#x800C;&#x662F;&#x9636;&#x6BB5;&#x8DF3;&#x8DC3;&#x51FD;&#x6570;&#x3002;**&#x66F4;&#x9AD8;&#x7684;&#x4F4D;&#x7F6E;&#x80FD;&#x5F97;&#x5230;&#x66F4;&#x9AD8;&#x7684;&#x300C;&#x8425;&#x517B;&#x300D;&#xFF0C;&#x4E5F;&#x4F1A;&#x957F;&#x7684;&#x8D8A;&#x5FEB;&#x3002;&#x6CA1;&#x6709;&#x4EBA;&#x751F;&#x6765;&#x5C31;&#x4F1A;&#x5F97;&#x5230;&#x66F4;&#x591A;&#x7684;&#x517B;&#x6599;&#xFF0C;&#x4F46;&#x53C8;&#x5FC5;&#x987B;&#x4E0D;&#x505C;&#x7684;&#x6210;&#x957F;&#x5426;&#x5219;&#x5C31;&#x66F4;&#x52A0;&#x8DDF;&#x4E0D;&#x5230;&#x517B;&#x6599;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x7406;&#x89E3;&#x7684;&#x535A;&#x5F08;&#x4E8B;&#x5B9E;&#x3002;</p>
<blockquote>
<p>&#x6210;&#x529F;&#x7684;&#x6295;&#x8D44;&#x8005;&#x5E76;&#x975E;&#x603B;&#x662F;&#x51C6;&#x786E;&#x9884;&#x6D4B;&#x5E02;&#x573A;&#x53D8;&#x5316;&#x7684;&#x4EBA;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E5F;&#x7ECF;&#x5E38;&#x72AF;&#x9519;&#x8BEF;&#x3002;&#x6240;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EBA;&#x80FD;&#x591F;&#x5728;&#x81EA;&#x5DF1;&#x6B63;&#x786E;&#x7684;&#x65F6;&#x5019;&#x6700;&#x5927;&#x5316;&#x53D6;&#x5F97;&#x7684;&#x6210;&#x679C;&#xFF0C;&#x800C;&#x5728;&#x81EA;&#x5DF1;&#x9519;&#x8BEF;&#x7684;&#x65F6;&#x5019;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x907F;&#x514D;&#x635F;&#x5931;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x4E2A;&#x54F2;&#x7406;&#x9002;&#x7528;&#x4E8E;&#x4EBA;&#x751F;&#x6240;&#x6709;&#x7684;&#x65B9;&#x9762;&#x3002;&#x4EBA;&#x751F;&#x5C31;&#x662F;&#x4E00;&#x573A;&#x573A;&#x5927;&#x5927;&#x5C0F;&#x5C0F;&#x7684;&#x6295;&#x8D44;&#xFF0C;&#x7ECF;&#x7BA1;&#x4E0D;&#x8981;&#x5168;&#x90E8;&#x90FD;&#x7528;&#x529F;&#x5229;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#xFF0C;&#x4F46;&#x4E5F;&#x8981;&#x77E5;&#x9053;&#xFF1A;<strong>&#x4EBA;&#x751F;&#x662F;&#x6CE2;&#x6D6A;&#x5F0F;&#x7684;&#xFF0C;&#x9700;&#x8981;&#x5728;&#x6CE2;&#x5CF0;&#x7684;&#x65F6;&#x5019;&#x5C3D;&#x60C5;&#xFF0C;&#x800C;&#x5931;&#x610F;&#x7684;&#x65F6;&#x5019;&#x52AA;&#x529B;&#x50A8;&#x5907;&#x3002;</strong></p>
<blockquote>
<p><strong>&#x4E00;&#x5207;&#x7BA1;&#x7406;&#x884C;&#x4E3A;&#x7684;&#x76EE;&#x7684;&#x90FD;&#x5728;&#x4E8E;&#x66F4;&#x597D;&#x5730;&#x914D;&#x7F6E;&#x8D44;&#x6E90;&#xFF0C;&#x63D0;&#x5347;&#x7EC4;&#x7EC7;&#x6574;&#x4F53;&#x7684;&#x8FD0;&#x884C;&#x6548;&#x7387;&#x3002;</strong></p>
</blockquote>
<blockquote>
<p>&#x5766;&#x8361;&#x800C;&#x9AD8;&#x660E;&#x7684;&#x4EBA;&#x603B;&#x662F;&#x4F1A;&#x7740;&#x529B;&#x683D;&#x57F9;&#x81EA;&#x5DF1;&#x7684;&#x4E0B;&#x5C5E;&#xFF0C;&#x4E3A;&#x81EA;&#x5DF1;&#x51C6;&#x5907;&#x51E0;&#x540D;&#x526F;&#x624B;&#x6216;&#x5F92;&#x5F1F;&#xFF0C;&#x4E0D;&#x4EC5;&#x80FD;&#x5E2E;&#x52A9;&#x81EA;&#x5DF1;&#x66F4;&#x597D;&#x5730;&#x5B8C;&#x6210;&#x5DE5;&#x4F5C;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x673A;&#x4F1A;&#x6765;&#x4E34;&#x65F6;&#x53EF;&#x4EE5;&#x9A6C;&#x4E0A;&#x8BA9;&#x81EA;&#x5DF1;&#x683D;&#x57F9;&#x7684;&#x4EBA;&#x8FC5;&#x901F;&#x63A5;&#x53D7;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x6211;&#x4EEC;&#x4E00;&#x5207;&#x7684;&#x51C6;&#x5907;&#x90FD;&#x662F;&#x4E3A;&#x4E86;&#x627F;&#x62C5;&#x66F4;&#x5927;&#x7684;&#x8D23;&#x4EFB;&#xFF0C;&#x800C;&#x80FD;&#x627F;&#x62C5;&#x66F4;&#x591A;&#x8D23;&#x4EFB;&#x7684;&#x4EBA;&#x4F1A;&#x83B7;&#x5F97;&#x66F4;&#x591A;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x8FD9;&#x662F;&#x804C;&#x573A;&#x6C38;&#x6052;&#x4E0D;&#x53D8;&#x7684;&#x57FA;&#x672C;&#x5B9A;&#x5F8B;&#x3002;</p>
</blockquote>
<p>&#x5347;&#x804C;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x7BA1;&#x7406;&#x8005;&#x8BA4;&#x4E3A;&#x4F60;&#x5728;&#x65B0;&#x7684;&#x804C;&#x4F4D;&#x53EF;&#x4EE5;&#x63D0;&#x5347;&#x6574;&#x4F53;&#x7684;&#x8FD0;&#x884C;&#x6548;&#x7387;&#xFF0C;&#x8FD9;&#x9700;&#x8981;&#x4F60;&#x6709;&#x8FC7;&#x786C;&#x7684;&#x6280;&#x80FD;&#xFF0C;&#x4E00;&#x5B9A;&#x7684;&#x534F;&#x8C03;&#x80FD;&#x529B;&#xFF0C;&#x6709;&#x8D23;&#x4EFB;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x9700;&#x8981;&#x5E26;&#x9886;&#x4E0B;&#x5C5E;&#x8FDB;&#x6B65;&#x3002;&#x5982;&#x679C;&#x4EC0;&#x4E48;&#x90FD;&#x662F;&#x81EA;&#x5DF1;&#x505A;&#x7684;&#x597D;&#xFF0C;&#x522B;&#x4EBA;&#x505A;&#x7684;&#x4E0D;&#x597D;&#xFF0C;&#x90A3;&#x4E48;&#x53D8;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x300C;&#x4E0D;&#x53EF;&#x66FF;&#x4EE3;&#x300D;&#x7684;&#x4EBA;&#xFF0C;&#x603B;&#x4F53;&#x6548;&#x80FD;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x53CD;&#x800C;&#x4E0D;&#x4F1A;&#x8BA9;&#x4F60;&#x5347;&#x804C;&#x66F4;&#x597D;&#x3002;</p>
<blockquote>
<p>&#x8F83;&#x65E9;&#x63D0;&#x62D4;&#x7684;&#x7BA1;&#x7406;&#x8005;&#x5F80;&#x5F80;&#x5BF9;&#x5DE5;&#x4F5C;&#x76EE;&#x6807;&#x548C;&#x6548;&#x7387;&#x5173;&#x6CE8;&#x591A;&#x8FC7;&#x5BF9;&#x4EBA;&#x4E0E;&#x4EBA;&#x4E4B;&#x95F4;&#x60C5;&#x611F;&#x548C;&#x5173;&#x7CFB;&#x7684;&#x5173;&#x6CE8;&#x3002;&#x8FD9;&#x53CD;&#x5E94;&#x5728;&#x7BA1;&#x7406;&#x5DE5;&#x4F5C;&#x8FD9;&#x5C31;&#x4F1A;&#x8868;&#x73B0;&#x51FA;&#x9AD8;&#x5EA6;&#x81EA;&#x4FE1;&#xFF0C;&#x91CD;&#x89C6;&#x76EE;&#x6807;&#x548C;&#x6570;&#x5B57;&#xFF0C;&#x5F3A;&#x8C03;&#x6267;&#x884C;&#x529B;&#xFF0C;&#x5FFD;&#x89C6;&#x56E2;&#x961F;&#x6C1B;&#x56F4;&#xFF0C;&#x540C;&#x65F6;&#x5BF9;&#x76F8;&#x5BF9;&#x6548;&#x7387;&#x8F83;&#x4F4E;&#x6216;&#x7406;&#x89E3;&#x529B;&#x8F83;&#x5DEE;&#x7684;&#x4F19;&#x4F34;&#x7F3A;&#x4E4F;&#x8010;&#x5FC3;&#xFF0C;&#x5FFD;&#x89C6;&#x56E2;&#x961F;&#x6C1B;&#x56F4;&#xFF0C;&#x4E0D;&#x6CE8;&#x610F;&#x81EA;&#x5DF1;&#x7684;&#x8868;&#x8FBE;&#x6001;&#x5EA6;&#x7B49;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x4E9B;&#x80FD;&#x529B;&#x90FD;&#x5E94;&#x8BE5;&#x662F;&#x7BA1;&#x7406;&#x8005;&#x91CD;&#x89C6;&#x7684;&#xFF0C;&#x4E0D;&#x8FC7;&#x4E00;&#x4E2A;&#x6C89;&#x7A33;&#x7684;&#x7BA1;&#x7406;&#x8005;&#xFF0C;&#x5E94;&#x8BE5;&#x66F4;&#x52A0;&#x6CE8;&#x91CD;&#x6574;&#x4F53;&#x7684;&#x6C1B;&#x56F4;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6709;&#x504F;&#x8892;&#x6027;&#x8D28;&#x7684;&#x6548;&#x7387;&#x4F18;&#x5148;&#x8BBA;&#x8005;&#x3002;</p>
<blockquote>
<p>&#x5728;&#x5E73;&#x65F6;&#x505A;&#x591F;&#x79EF;&#x7D2F;&#xFF0C;&#x5728;&#x5173;&#x952E;&#xFF08;&#x56F0;&#x96BE;&#xFF09;&#x7684;&#x65F6;&#x5019;&#x633A;&#x8EAB;&#x800C;&#x51FA;&#xFF0C;&#x505A;&#x51FA;&#x6210;&#x7EE9;&#xFF0C;&#x8868;&#x73B0;&#x81EA;&#x6211;&#xFF0C;&#x6210;&#x4E3A;&#x9886;&#x5BFC;&#x5FC3;&#x76EE;&#x4E2D;&#x7684;&#x7B2C;&#x4E00;&#x987A;&#x4F4D;&#x5019;&#x9009;&#x4EBA;&#xFF0C;&#x7B49;&#x5230;&#x6709;&#x804C;&#x4F4D;&#x7A7A;&#x7F3A;&#x7684;&#x65F6;&#x5019;&#x987A;&#x5229;&#x4E0A;&#x4EFB;&#x3002;</p>
</blockquote>
<p>&#x8D8A;&#x662F;&#x5728;&#x56F0;&#x96BE;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x627F;&#x62C5;&#x66F4;&#x5927;&#x8D23;&#x4EFB;&#x7684;&#x4EBA;&#xFF0C;&#x8D8A;&#x5BB9;&#x6613;&#x4EA7;&#x751F;&#x81EA;&#x5DF1;&#x7684;&#x5F71;&#x54CD;&#x529B;&#x3002;</p>
<blockquote>
<p>&#x5BF9;&#x4E0B;&#x7684;&#x8D8A;&#x7EA7;&#x6C9F;&#x901A;&#xFF0C;&#x4F1A;&#x635F;&#x5BB3;&#x76F4;&#x63A5;&#x4E0B;&#x5C5E;&#x7684;&#x6743;&#x5A01;&#xFF0C;&#x6253;&#x4E71;&#x5176;&#x90E8;&#x95E8;&#x5185;&#x90E8;&#x7684;&#x6743;&#x5229;&#x7ED3;&#x6784;&#xFF0C;&#x5F71;&#x54CD;&#x6574;&#x4E2A;&#x7EC4;&#x7EC7;&#x7684;&#x7BA1;&#x7406;&#x67B6;&#x6784;&#x3002;&#x4ECE;&#x957F;&#x8FDC;&#x770B;&#xFF0C;&#x5F0A;&#x5927;&#x4E8E;&#x5229;&#x3002;</p>
</blockquote>
<p>&#x4E0D;&#x8981;&#x8D8A;&#x7EA7;&#x7684;&#x6C9F;&#x901A;&#xFF0C;&#x5373;&#x4F7F;&#x5BF9;&#x4E0B;&#x5C5E;&#x3002;&#x5982;&#x679C;&#x8981;&#x8D8A;&#x7EA7;&#xFF0C;&#x4E5F;&#x662F;&#x4E86;&#x89E3;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x53D1;&#x5E03;&#x6307;&#x4EE4;&#x3002;</p>
<blockquote>
<p>&#x5BF9;&#x8D1F;&#x9762;&#x4FE1;&#x606F;&#x6709;&#x6548;&#x7684;&#x8FC7;&#x6EE4;&#x3002;<strong>&#x5BF9;&#x4E0B;&#x5C5E;&#xFF0C;&#x542C;&#x800C;&#x4E0D;&#x8BF4;&#x3002;&#x6709;&#x6548;&#x7684;&#x542C;&#x53D6;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x505A;&#x8BC4;&#x4EF7;&#xFF1B;&#x5BF9;&#x5E73;&#x7EA7;&#xFF0C;&#x4E0D;&#x542C;&#x4E0D;&#x8BF4;&#xFF0C;&#x5BF9;&#x9886;&#x5BFC;&#x800C;&#x8A00;&#xFF0C;&#x5E73;&#x7EA7;&#x4E4B;&#x95F4;&#x4F20;&#x9012;&#x8D1F;&#x9762;&#x6D88;&#x606F;&#xFF0C;&#x53EA;&#x8981;&#x542C;&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x6001;&#x5EA6;&#xFF1B;&#x5BF9;&#x4E0A;&#x7EA7;&#xFF0C;&#x8FC7;&#x6EE4;&#x540E;&#x8BF4;&#x3002;&#x5BF9;&#x4E0A;&#x7EA7;&#x9700;&#x8981;&#x6709;&#x6548;&#x7684;&#x53CD;&#x9988;&#xFF0C;&#x4F46;&#x662F;&#x9700;&#x8981;&#x8FC7;&#x6EE4;&#x4FE1;&#x606F;&#x3002;</strong></p>
</blockquote>
<p>&#x603B;&#x7ED3;&#x7684;&#x975E;&#x5E38;&#x5230;&#x4F4D;&#x3002;&#x5DE5;&#x4F5C;&#x4E2D;&#x96BE;&#x514D;&#x9047;&#x5230;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x60C5;&#x5883;&#x4E0B;&#x7684;&#x8D1F;&#x9762;&#x4FE1;&#x606F;&#xFF0C;&#x6709;&#x6548;&#x7684;&#x5904;&#x7406;&#x662F;&#x4E00;&#x79CD;&#x6210;&#x719F;&#x7684;&#x8868;&#x73B0;&#x3002;</p>
<blockquote>
<p>&#x771F;&#x6B63;&#x7684;&#x804C;&#x4E1A;&#x5347;&#x7EA7;&#x5728;&#x4E8E;&#x6362;&#x4E00;&#x79CD;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x505A;&#x540C;&#x6837;&#x6027;&#x8D28;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x800C;&#x4EC5;&#x4EC5;&#x628A;&#x73B0;&#x5728;&#x7684;&#x4E8B;&#x60C5;&#x505A;&#x7684;&#x66F4;&#x5B8C;&#x7F8E;&#x53EA;&#x80FD;&#x6362;&#x6765;&#x73B0;&#x72B6;&#x7684;&#x7565;&#x5FAE;&#x6539;&#x5584;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x8FD8;&#x662F;&#x5728;&#x5EF6;&#x7EED;&#x6B64;&#x524D;&#x7684;&#x751F;&#x6D3B;&#x800C;&#x5DF2;&#x3002;</p>
</blockquote>
<p>&#x4E0D;&#x80FD;&#x53EA;&#x662F;&#x4E00;&#x5473;&#x7684;&#x300C;&#x52AA;&#x529B;&#x52AA;&#x529B;&#x300D;&#xFF0C;&#x800C;&#x9700;&#x8981;&#x4ECE;&#x66F4;&#x5927;&#x7684;&#x683C;&#x5C40;&#x601D;&#x8003;&#x95EE;&#x9898;&#xFF0C;&#x601D;&#x8003;&#x5DE5;&#x4F5C;&#x7684;&#x65B9;&#x5F0F;&#x548C;&#x601D;&#x7EF4;&#x3002;&#x8981;&#x5B66;&#x4F1A;&#x957F;&#x8FDC;&#x6295;&#x8D44;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x53EA;&#x4E3A;&#x73B0;&#x72B6;&#x3002;&#x8BB0;&#x4F4F;&#xFF0C;&#x4EBA;&#x6C38;&#x8FDC;&#x90FD;&#x62E5;&#x6709;&#x9009;&#x62E9;&#x7684;&#x6743;&#x5229;&#x3002;</p>
<blockquote>
<p>&#x65E0;&#x8BBA;&#x7BA1;&#x7406;&#x8005;&#x5728;&#x4E0B;&#x5C5E;&#x9762;&#x524D;&#x8868;&#x73B0;&#x7684;&#x591A;&#x4E48;&#x4E00;&#x76F4;&#x540C;&#x4EC1;&#xFF0C;&#x4ED6;&#x90FD;&#x4E0D;&#x4F1A;&#x771F;&#x7684;&#x7ED9;&#x6BCF;&#x4E2A;&#x4EBA;&#x540C;&#x6837;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x81F3;&#x5C11;&#x4E0D;&#x4F1A;&#x5728;&#x6BCF;&#x4E2A;&#x4EBA;&#x8EAB;&#x4E0A;&#x6295;&#x5165;&#x540C;&#x6837;&#x591A;&#x7684;&#x5173;&#x6CE8;&#x3002;&#x8FD9;&#x4E2A;&#x79D8;&#x5BC6;&#xFF0C;&#x4ED6;&#x6C38;&#x8FDC;&#x90FD;&#x4E0D;&#x4F1A;&#x8BF4;&#xFF0C;&#x4F46;&#x662F;&#x4ED6;&#x4F1A;&#x9ED8;&#x9ED8;&#x5730;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x5FC3;&#x4E2D;&#x628A;&#x4EBA;&#x5206;&#x6210;&#x4E0D;&#x540C;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x5BF9;&#x4ED6;&#x4EEC;&#x7684;&#x672A;&#x6765;&#x62B1;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x9884;&#x671F;&#xFF0C;&#x7136;&#x540E;&#x8BA9;&#x65F6;&#x95F4;&#x6765;&#x9A8C;&#x8BC1;&#x4ED6;&#x7684;&#x5224;&#x65AD;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x65E0;&#x8BBA;&#x54EA;&#x4E2A;&#x884C;&#x4E1A;&#xFF0C;&#x90FD;&#x4F1A;&#x6709;&#x4E00;&#x6761;&#x6838;&#x5FC3;&#x7684;&#x4EF7;&#x503C;&#x94FE;&#xFF0C;&#x628A;&#x4E0D;&#x540C;&#x73AF;&#x8282;&#x7684;&#x5229;&#x76CA;&#x4F53;&#x4E32;&#x8054;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5E76;&#x6700;&#x7EC8;&#x8BA9;&#x6574;&#x4E2A;&#x884C;&#x4E1A;&#x50CF;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x4E00;&#x6837;&#x8FD0;&#x8F6C;&#x8D77;&#x6765;&#x3002;&#x6838;&#x5FC3;&#x5458;&#x5DE5;&#x603B;&#x662F;&#x51FA;&#x73B0;&#x5728;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x90E8;&#x95E8;&#x3002;&#x56E0;&#x6B64;&#x80FD;&#x5426;&#x6210;&#x4E3A;&#x6838;&#x5FC3;&#x66F4;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x89C6;&#x91CE;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5374;&#x672A;&#x5FC5;&#x662F;&#x4E00;&#x4E2A;&#x80FD;&#x529B;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
</blockquote>
<p>**&#x804C;&#x573A;&#x7684;&#x6F5C;&#x89C4;&#x5219;&#xFF0C;&#x6838;&#x5FC3;&#x4EBA;&#x5458;&#x66F4;&#x5BB9;&#x6613;&#x5F97;&#x5230;&#x673A;&#x9047;&#x548C;&#x4E0A;&#x5347;&#x7A7A;&#x95F4;&#x3002;**&#x8981;&#x9009;&#x62E9;&#x8FDB;&#x5165;&#x884C;&#x4E1A;&#x7684;&#x6838;&#x5FC3;&#x52A8;&#x529B;&#x4F4D;&#x7F6E;&#xFF0C;&#x624D;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x66F4;&#x6709;&#x7ADE;&#x4E89;&#x529B;&#x7684;&#x63D0;&#x5347;&#x3002;</p>
<blockquote>
<p>&#x6709;&#x51E0;&#x79CD;&#x4EBA;&#x96BE;&#x4EE5;&#x5F97;&#x5230;&#x91CD;&#x7528;&#xFF1A;&#x7B2C;&#x4E00;&#x79CD;&#x662F;&#x505A;&#x7684;&#x4E0D;&#x597D;&#x7684;&#x3002;&#x7B2C;&#x4E8C;&#x79CD;&#x662F;&#x80FD;&#x529B;&#x5F3A;&#xFF0C;&#x4F46;&#x662F;&#x4EBA;&#x54C1;&#x6027;&#x683C;&#x6709;&#x7F3A;&#x9677;&#x7684;&#x3002;&#x7B2C;&#x4E09;&#x79CD;&#x662F;&#x4F01;&#x4E1A;&#x8BA4;&#x540C;&#x5EA6;&#x4E0D;&#x9AD8;&#xFF0C;&#x6D41;&#x52A8;&#x6027;&#x53EF;&#x80FD;&#x5927;&#x7684;&#x4EBA;&#x3002;<strong>&#x7B2C;&#x56DB;&#x79CD;&#x662F;&#x60C5;&#x7EEA;&#x5316;&#xFF0C;&#x4E0D;&#x4F1A;&#x505A;&#x4EBA;&#xFF0C;&#x8BA9;&#x4EBA;&#x4E0D;&#x9AD8;&#x5174;&#x7684;&#x4EBA;&#x3002;</strong></p>
</blockquote>
<p>&#x53EF;&#x89C1;&#xFF0C;&#x7A33;&#x91CD;&#xFF0C;&#x4E0D;&#x60C5;&#x7EEA;&#x5316;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x6210;&#x719F;&#x7684;&#x804C;&#x573A;&#x4EBA;&#x662F;&#x591A;&#x4E48;&#x7684;&#x91CD;&#x8981;&#x3002;&#x4E25;&#x91CD;&#x60C5;&#x7EEA;&#x5316;&#x7684;&#x4EBA;&#xFF0C;&#x5373;&#x4F7F;&#x80FD;&#x529B;&#x5F88;&#x5F3A;&#xFF0C;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x5927;&#x5BB6;&#x90FD;&#x501A;&#x91CD;&#x4E8E;&#x4ED6;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x559C;&#x6B22;&#x4ED6;&#xFF0C;&#x8FD9;&#x6837;&#x5B50;&#x7684;&#x6CA1;&#x6CD5;&#x5E26;&#x9886;&#x56E2;&#x961F;&#x3002;</p>
<blockquote>
<p>&#x5982;&#x679C;&#x5BF9;&#x81EA;&#x5DF1;&#x6765;&#x8BF4;&#xFF0C;&#x5E94;&#x916C;&#x4E5F;&#x597D;&#xFF0C;&#x52A0;&#x73ED;&#x4E5F;&#x597D;&#xFF0C;&#x67D0;&#x4EF6;&#x4E8B;&#x5C5E;&#x4E8E;&#x8017;&#x8D39;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x548C;&#x7CBE;&#x529B;&#x800C;&#x610F;&#x4E49;&#x5E76;&#x4E0D;&#x5927;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x53EA;&#x662F;&#x51FA;&#x4E8E;&#x73AF;&#x5883;&#x538B;&#x529B;&#x800C;&#x4E0D;&#x5F97;&#x4E0D;&#x505A;&#xFF0C;&#x505A;&#x4E86;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x597D;&#x5904;&#xFF0C;&#x4E0D;&#x505A;&#x5374;&#x603B;&#x62C5;&#x5FC3;&#x548C;&#x522B;&#x4EBA;&#x4E0D;&#x4E00;&#x6837;&#x3002;&#x90A3;&#x4E48;&#x5C31;&#x5E94;&#x8BE5;&#x8BB0;&#x4F4F;&#xFF1A;&#x4EBA;&#x5E94;&#x8BE5;&#x5177;&#x6709;&#x638C;&#x63A7;&#x81EA;&#x5DF1;&#x65F6;&#x95F4;&#x548C;&#x751F;&#x6D3B;&#x7684;&#x80FD;&#x529B;&#x548C;&#x6743;&#x5229;&#xFF0C;&#x5982;&#x679C;&#x603B;&#x56E0;&#x4E3A;&#x522B;&#x4EBA;&#x7684;&#x9884;&#x671F;&#x6765;&#x5B89;&#x6392;&#x81EA;&#x5DF1;&#xFF0C;&#x6700;&#x7EC8;&#x96BE;&#x514D;&#x6210;&#x4E3A;&#x300C;&#x4ED6;&#x63A7;&#x578B;&#x300D;&#x4EBA;&#x2014;&#x2014;&#x8BA9;&#x81EA;&#x5DF1;&#x6210;&#x4E3A;&#x522B;&#x4EBA;&#x751F;&#x6D3B;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x62C5;&#x5FC3;&#x770B;&#x8D77;&#x6765;&#x548C;&#x522B;&#x4EBA;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5374;&#x6CA1;&#x6709;&#x60F3;&#x8FC7;&#xFF1A;<strong>&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x771F;&#x6B63;&#x7684;&#x6210;&#x529F;&#x662F;&#x9760;&#x53D6;&#x60A6;&#x522B;&#x4EBA;&#x800C;&#x83B7;&#x5F97;&#x7684;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x5931;&#x8D25;&#x662F;&#x56E0;&#x4E3A;&#x4FDD;&#x6301;&#x81EA;&#x6211;&#x800C;&#x906D;&#x9047;&#x7684;&#x3002;</strong></p>
</blockquote>
<blockquote>
<p>&#x4E00;&#x4E2A;&#x4EBA;&#x9645;&#x73AF;&#x5883;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x8981;&#x6C42;&#x300C;&#x548C;&#x5927;&#x5BB6;&#x4E00;&#x6837;&#x300D;&#x7684;&#x5F3A;&#x9ECF;&#x5EA6;&#xFF0C;&#x8BF4;&#x660E;&#x8FD9;&#x4E2A;&#x73AF;&#x5883;&#x7F3A;&#x4E4F;&#x5BF9;&#x4EBA;&#x7684;&#x7A7A;&#x95F4;&#x548C;&#x591A;&#x6837;&#x6027;&#x7684;&#x57FA;&#x672C;&#x5C0A;&#x91CD;&#xFF0C;&#x5B83;&#x672C;&#x8EAB;&#x5F88;&#x4E0D;&#x5065;&#x5EB7;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x7684;&#x662F;&#x5C3D;&#x5FEB;&#x5730;&#x8131;&#x79BB;&#x8FD9;&#x4E2A;&#x5C42;&#x6B21;&#x7684;&#x73AF;&#x5883;&#x800C;&#x4E0D;&#x662F;&#x53BB;&#x8FCE;&#x5408;&#xFF1B;&#x800C;&#x5982;&#x679C;&#x73AF;&#x5883;&#x5E76;&#x6CA1;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x538B;&#x529B;&#xFF0C;&#x53EA;&#x662F;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x4EA7;&#x751F;&#x4E86;&#x300C;&#x6211;&#x5FC5;&#x987B;&#x548C;&#x5927;&#x5BB6;&#x4E00;&#x6837;&#x300D;&#x7684;&#x5E7B;&#x89C9;&#xFF0C;&#x5219;&#x8BF4;&#x660E;&#x6211;&#x4EEC;&#x7684;&#x5FC3;&#x7406;&#x800C;&#x4E0D;&#x592A;&#x6210;&#x719F;&#xFF0C;&#x9700;&#x8981;&#x5C3D;&#x5FEB;&#x5F3A;&#x5927;&#x8D77;&#x6765;&#x3002;&#x4E0D;&#x7BA1;&#x4ECE;&#x54EA;&#x4E2A;&#x89D2;&#x5EA6;&#x8BF4;&#xFF0C;&#x73AF;&#x5883;&#x90FD;&#x4E0D;&#x5E94;&#x8BE5;&#x6210;&#x4E3A;&#x51B3;&#x5B9A;&#x6211;&#x4EEC;&#x884C;&#x52A8;&#x65B9;&#x5F0F;&#x7684;&#x552F;&#x4E00;&#x56E0;&#x7D20;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x505A;&#x7684;&#xFF0C;&#x53EA;&#x662F;&#x8868;&#x660E;&#x6001;&#x5EA6;&#xFF0C;&#x7136;&#x540E;&#x575A;&#x6301;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x51E0;&#x53E5;&#x8BDD;&#x8BF4;&#x7684;&#x918D;&#x9190;&#x704C;&#x9876;&#x3002;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x6210;&#x529F;&#x662F;&#x56E0;&#x4E3A;&#x53D6;&#x60A6;&#x522B;&#x4EBA;&#x53D6;&#x60A6;&#x73AF;&#x5883;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x4EBA;&#x56E0;&#x4E3A;&#x4FDD;&#x6301;&#x81EA;&#x6211;&#x800C;&#x5931;&#x8D25;&#x3002;&#x6211;&#x4EEC;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x7684;&#x8D8B;&#x540C;&#x5FC3;&#x7406;&#x662F;&#x56E0;&#x4E3A;&#x81EA;&#x5DF1;&#x5185;&#x5FC3;&#x6CA1;&#x6709;&#x5F3A;&#x5927;&#x7684;&#x63A7;&#x5236;&#x80FD;&#x529B;&#x3002;<strong>&#x4EBA;&#x4E0D;&#x8BBA;&#x5728;&#x4EFB;&#x4F55;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x90FD;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x81EA;&#x7531;&#x6765;&#x51B3;&#x5B9A;&#x81EA;&#x5DF1;&#x7684;&#x884C;&#x4E3A;&#x5E76;&#x4E3A;&#x4E4B;&#x627F;&#x62C5;&#x540E;&#x679C;&#x3002;</strong></p>
<blockquote>
<p>&#x6210;&#x5E74;&#x4EBA;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x5F80;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x539F;&#x5219;&#x662F;&#xFF1A;&#x5C0A;&#x91CD;&#x3002;&#x5C0A;&#x91CD;&#x4E0D;&#x4EC5;&#x610F;&#x5473;&#x7740;&#x5BA2;&#x6C14;&#x548C;&#x793C;&#x8C8C;&#xFF0C;<strong>&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#x5C0A;&#x91CD;&#x5BF9;&#x65B9;&#x7684;&#x601D;&#x60F3;&#x548C;&#x6027;&#x683C;&#x3002;&#x8BD5;&#x56FE;&#x53BB;&#x7406;&#x89E3;&#x300C;&#x4E16;&#x754C;&#x4E0A;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x9886;&#x57DF;&#x90FD;&#x4E0D;&#x5B58;&#x5728;&#x7EDD;&#x5BF9;&#x771F;&#x7406;&#x300D;&#x8FD9;&#x4E2A;&#x9053;&#x7406;&#x3002;</strong></p>
</blockquote>
<blockquote>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x6709;&#x9009;&#x62E9;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E0D;&#x8981;&#x968F;&#x610F;&#x5730;&#x5426;&#x5B9A;&#x6216;&#x8005;&#x6279;&#x8BC4;&#x4ED6;&#x4EBA;&#x7684;&#x89C2;&#x70B9;&#x548C;&#x7ACB;&#x573A;&#xFF0C;&#x66F4;&#x5C3D;&#x91CF;&#x4E0D;&#x8981;&#x8BD5;&#x56FE;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x60F3;&#x6CD5;&#x53BB;&#x8BF4;&#x670D;&#x5BF9;&#x65B9;&#x2014;&#x2014;&#x8FD9;&#x79CD;&#x884C;&#x4E3A;&#x7684;&#x80CC;&#x540E;&#x672C;&#x8D28;&#x662F;&#x8BA4;&#x4E3A;&#x81EA;&#x5DF1;&#x6BD4;&#x5BF9;&#x65B9;&#x66F4;&#x52A0;&#x9AD8;&#x660E;&#x7684;&#x81EA;&#x5927;&#x3002;<strong>&#x63A5;&#x6536;&#x4EBA;&#x7684;&#x591A;&#x6837;&#x6027;&#x662F;&#x5C0A;&#x91CD;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x800C;&#x6CA1;&#x6709;&#x5C0A;&#x91CD;&#x5219;&#x4E0D;&#x53EF;&#x80FD;&#x8D62;&#x5F97;&#x771F;&#x6B63;&#x7684;&#x4FE1;&#x8D56;&#x3002;</strong></p>
</blockquote>
<p><strong>No Judge! No Judge! No Judge!</strong> &#x5343;&#x4E07;&#x4E0D;&#x8981;&#x8F7B;&#x6613;&#x7684;&#x7ED9;&#x51FA;&#x81EA;&#x5DF1;&#x7684;&#x8BC4;&#x4EF7;&#xFF0C;&#x4EBA;&#x751F;&#x5927;&#x591A;&#x6570;&#x60C5;&#x666F;&#x9700;&#x8981;&#x7684;&#x662F;listen, identity(&#x8BA4;&#x540C;), praise.</p>
<blockquote>
<p>&#x5356;&#x70B9;&#x8FD8;&#x662F;&#x4E70;&#x70B9;&#x3002;&#x5356;&#x70B9;&#x5173;&#x5FC3;&#x7684;&#x662F;&#x4EA7;&#x54C1;&#x672C;&#x8EAB;&#x7684;&#x7279;&#x6027;&#x3002;&#x800C;&#x4E70;&#x70B9;&#x5374;&#x662F;&#x7528;&#x6237;&#x6700;&#x5173;&#x5FC3;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x9700;&#x8981;&#x5728;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#x67B6;&#x8BBE;&#x6709;&#x6548;&#x7684;&#x6865;&#x6881;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x9500;&#x552E;&#x65B0;&#x624B;&#x603B;&#x662F;&#x4F1A;&#x8DDF;&#x5BA2;&#x6237;&#x6ED4;&#x6ED4;&#x4E0D;&#x7EDD;&#xFF0C;&#x800C;&#x9500;&#x552E;&#x8001;&#x9E1F;&#x603B;&#x662F;&#x9759;&#x9759;&#x5730;&#x542C;&#xFF0C;&#x5076;&#x5C14;&#x63D0;&#x95EE;&#xFF0C;&#x7528;&#x6700;&#x7B80;&#x6D01;&#x7684;&#x8BED;&#x8A00;&#x62FF;&#x4E0B;&#x8BA2;&#x5355;&#x3002;&#x5176;&#x5B9E;&#x5BA2;&#x6237;&#x4E70;&#x4E1C;&#x897F;&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x6309;&#x94AE;&#xFF0C;&#x8981;&#x5F00;&#x542F;&#x5B83;&#x9760;&#x7684;&#x662F;&#x51C6;&#x786E;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x529B;&#x91CF;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x5BA2;&#x6237;&#x9700;&#x6C42;&#x6700;&#x8868;&#x5C42;&#x7684;&#x662F;&#x4EA7;&#x54C1;&#x548C;&#x670D;&#x52A1;&#xFF0C;&#x66F4;&#x6DF1;&#x4E00;&#x5C42;&#x7684;&#x662F;&#x91C7;&#x8D2D;&#x6807;&#x51C6;&#xFF0C;&#x8FDB;&#x4E00;&#x6B65;&#x662F;&#x5177;&#x4F53;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x66F4;&#x8FDB;&#x4E00;&#x6B65;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x80CC;&#x540E;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x6D88;&#x8D39;&#x8FC7;&#x7A0B;&#x7684;&#x56DB;&#x4E2A;&#x5178;&#x578B;&#x601D;&#x7EF4;&#x9636;&#x6BB5;&#xFF1A;<strong>&#x611F;&#x6027;&#x8BA4;&#x77E5;&#x2014;&#x2014;&#x7406;&#x6027;&#x5206;&#x6790;-&#x611F;&#x6027;&#x51B3;&#x7B56;-&#x7406;&#x6027;&#x786E;&#x8BA4;&#x3002;</strong></p>
</blockquote>
<p>&#x5C31;&#x50CF;&#x4E66;&#x4E2D;&#x8BF4;&#x5230;&#x6545;&#x4E8B;&#x4E00;&#x6837;&#xFF1A;&#x6709;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x9700;&#x8981;xxx&#x54C1;&#x724C;&#x7684;&#x5145;&#x7535;&#x5668;&#xFF0C;&#x4F46;&#x662F;&#x5E97;&#x4E2D;&#x6CA1;&#x6709;&#xFF0C;&#x5982;&#x4F55;&#x5904;&#x7406;&#xFF1F;</p>
<p>&#x4F5C;&#x8005;&#x7684;&#x601D;&#x7EF4;&#x8FC7;&#x7A0B;&#x5C31;&#x662F;&#x5728;&#x5256;&#x6790;&#x5BA2;&#x6237;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x4ECE;&#x800C;&#x6316;&#x6398;&#x5BA2;&#x6237;&#x7684;&#x300C;&#x4E70;&#x70B9;&#x300D;&#xFF1A;</p>
<ul>
<li>&#x5F00;&#x59CB;&#x65F6;&#x5019;&#x6316;&#x6398;&#x5BA2;&#x6237;&#x7684;&#x91C7;&#x8D2D;&#x6807;&#x51C6;&#xFF1A;xxx&#x724C;&#x5B50;&#x7684;&#x63A5;&#x53E3;&#x591A;&#xFF0C;&#x4F7F;&#x7528;&#x65B9;&#x4FBF;&#x7075;&#x6D3B;&#x3002;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x6709;&#x65B0;&#x4EA7;&#x54C1;&#xFF0C;&#x63A5;&#x53E3;&#x66F4;&#x52A0;&#x4E30;&#x5BCC;&#x662F;&#x5426;&#x8003;&#x8651;&#x3002;</li>
<li>&#x8FDB;&#x4E00;&#x6B65;&#x8F6C;&#x79FB;&#xFF08;&#x63A8;&#x6D4B;&#xFF09;&#x5BA2;&#x6237;&#x7684;&#x91C7;&#x8D2D;&#x6807;&#x51C6;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#xFF1A;xxx&#x724C;&#x5B50;&#x786E;&#x5B9E;&#x975E;&#x5E38;&#x597D;&#xFF0C;&#x60A8;&#x975E;&#x5E38;&#x61C2;&#x8D27;&#x3002;&#x5BF9;&#x4E8E;&#x7ED9;&#x624B;&#x673A;&#x5145;&#x7535;&#x800C;&#x8A00;&#xFF0C;&#x4E2A;&#x4EBA;&#x89C9;&#x5F97;&#x7535;&#x538B;&#x7A33;&#x5B9A;&#x66F4;&#x91CD;&#x8981;&#x3002;&#x6211;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x6B3E;&#x7535;&#x538B;&#x505A;&#x7684;&#x975E;&#x5E38;&#x597D;&#x7684;&#x540C;&#x7C7B;&#x578B;&#x4EA7;&#x54C1;&#x662F;&#x5426;&#x8003;&#x8651;&#x3002;</li>
<li>&#x8FDB;&#x4E00;&#x6B65;&#x731C;&#x6D4B;&#x5BA2;&#x6237;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x662F;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x624B;&#x673A;&#x603B;&#x662F;&#x9700;&#x8981;&#x5145;&#x7535;&#x800C;&#x70E6;&#x607C;&#xFF0C;&#x8FDB;&#x800C;&#x63A8;&#x8350;&#x4E70;&#x4E00;&#x6B3E;&#x66F4;&#x8010;&#x7535;&#x7684;&#x624B;&#x673A;&#x3002;</li>
</ul>
<p>&#x9500;&#x552E;&#x7684;&#x601D;&#x7EF4;&#x8FC7;&#x7A0B;&#x5C31;&#x662F;: <strong>&#x5145;&#x5206;&#x7406;&#x89E3;&#x5356;&#x70B9;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x73A9;&#x547D;&#x7684;&#x6316;&#x6398;&#xFF0C;&#x63A8;&#x6D4B;&#xFF0C;&#x5957;&#x8DEF;&#x51FA;&#x4E70;&#x70B9;&#xFF0C;&#x8FDB;&#x800C;&#x5EFA;&#x7ACB;&#x8054;&#x7CFB;&#xFF0C;&#x7ED9;&#x5BA2;&#x6237;&#x4E00;&#x79CD;&#x60F3;&#x8981;&#x4E70;&#x7684;&#x51B2;&#x52A8;&#x3002;&#x5728;&#x8BE5;&#x7406;&#x6027;&#x7684;&#x65F6;&#x5019;&#x8BB2;&#x6570;&#x636E;&#xFF0C;&#x8BE5;&#x611F;&#x6027;&#x7684;&#x65F6;&#x5019;&#x8BB2;&#x7F8E;&#x597D;&#x613F;&#x666F;&#x3002;</strong></p>

      
    </div>

    
      

  <div class="popular-posts-header">相关文章</div>
  <ul class="popular-posts">
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/02/01/the-art-of-unix-programming-reading-notes/" rel="bookmark">《The Art of UNIX Programming》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/08/07/book-change-the-conversation-learn-note/" rel="bookmark">《解决冲突的关键技巧》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/03/24/book-liaoge-linux-course-md/" rel="bookmark">《鸟哥的Linux私房菜》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/06/28/book-thinking-about-running-md/" rel="bookmark">《当我跑步时我谈些什么》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/02/02/code-complete-2-learn-note/" rel="bookmark">《Code Complete 2》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/04/01/how-to-life-learn-note/" rel="bookmark">《活法》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/02/19/how-to-measure-your-life-reading-notes/" rel="bookmark">《如何衡量你的人生》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/11/30/money-hacker-reading-note/" rel="bookmark">《富爸爸穷爸爸》&《小狗钱钱》读书笔记</a></div>
      
    </li>
  
  </ul>


    

    
    
    

    

    

    
      <div>
        <ul class="post-copyright">
  <li class="post-copyright-author">
    <strong>本文作者： </strong>whiledoing</li>
  <li class="post-copyright-link">
    <strong>本文链接：</strong>
    <a href="http://whiledoing.me/2017/04/08/selling-is-everywhere/" title="《销售无处不在》读书笔记">http://whiledoing.me/2017/04/08/selling-is-everywhere/</a>
  </li>
  <li class="post-copyright-license">
    <strong>版权声明： </strong>本博客所有文章除特别声明外，均采用 <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/" rel="external nofollow" target="_blank">CC BY-NC-SA 4.0</a> 许可协议。转载请注明出处！</li>
</ul>

      </div>
    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/读书笔记/" rel="tag"># 读书笔记</a>
          
            <a href="/tags/职场/" rel="tag"># 职场</a>
          
            <a href="/tags/销售/" rel="tag"># 销售</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2017/02/19/how-to-measure-your-life-reading-notes/" rel="next" title="《如何衡量你的人生》读书笔记">
                <i class="fa fa-chevron-left"></i> 《如何衡量你的人生》读书笔记
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2017/06/14/fenglun-talk-about-life-and-career/" rel="prev" title="冯仑 - 「职场相对论」演讲听后感 - 如何平衡欲望和能力">
                冯仑 - 「职场相对论」演讲听后感 - 如何平衡欲望和能力 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      

      <section class="site-overview-wrap sidebar-panel sidebar-panel-active">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <img class="site-author-image" itemprop="image"
                src="/images/avatar.jpeg"
                alt="whiledoing" />
            
              <p class="site-author-name" itemprop="name">whiledoing</p>
              <p class="site-description motion-element" itemprop="description">喜欢一切简单且美的事物，包括人。</p>
          </div>

          
            <nav class="site-state motion-element">
              
                <div class="site-state-item site-state-posts">
                
                  <a href="/archives/">
                
                    <span class="site-state-item-count">58</span>
                    <span class="site-state-item-name">日志</span>
                  </a>
                </div>
              

              

              
                
                
                <div class="site-state-item site-state-tags">
                  <a href="/tags/index.html">
                    
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                    <span class="site-state-item-count">31</span>
                    <span class="site-state-item-name">标签</span>
                  </a>
                </div>
              
            </nav>
          

          

          
            <div class="links-of-author motion-element">
              
                <span class="links-of-author-item">
                  <a href="https://github.com/whiledoing" target="_blank" title="GitHub">GitHub</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="http://www.douban.com/people/58249409" target="_blank" title="豆瓣">豆瓣</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="https://www.zhihu.com/people/whiledoing" target="_blank" title="知乎">知乎</a>
                  
                </span>
              
            </div>
          

          
          

          
          

          
            
          
          

        </div>
      </section>

      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; 2016 &mdash; <span itemprop="copyrightYear">2018</span>
  <span class="with-love" id="animate">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">whiledoing</span>

  

  
</div>




  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动 v3.7.1</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/theme-next/hexo-theme-next">NexT.Mist</a> v6.2.0</div>




        








        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>
























  



  
  
    <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/reading_progress/reading_progress.js"></script>
  


  


  <script type="text/javascript" src="/js/src/utils.js?v=6.2.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=6.2.0"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=6.2.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=6.2.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=6.2.0"></script>



  



	





  





  










  





  

  

  
<script>
(function(){
    var bp = document.createElement('script');
    var curProtocol = window.location.protocol.split(':')[0];
    if (curProtocol === 'https') {
        bp.src = 'https://zz.bdstatic.com/linksubmit/push.js';        
    }
    else {
        bp.src = 'http://push.zhanzhang.baidu.com/push.js';
    }
    var s = document.getElementsByTagName("script")[0];
    s.parentNode.insertBefore(bp, s);
})();
</script>


  
  

  
  

  


  
  

  
  
  
  <script src="/lib/pangu/dist/pangu.min.js?v=3.3"></script>
  <script type="text/javascript">pangu.spacingPage();</script>


  
  <script type="text/javascript" src="/js/src/js.cookie.js?v=6.2.0"></script>
  <script type="text/javascript" src="/js/src/scroll-cookie.js?v=6.2.0"></script>


  

  

  
  <style>
      .copy-btn {
          display: inline-block;
          padding: 6px 12px;
          font-size: 13px;
          font-weight: 700;
          line-height: 20px;
          color: #333;
          white-space: nowrap;
          vertical-align: middle;
          cursor: pointer;
          background-color: #eee;
          background-image: linear-gradient(#fcfcfc, #eee);
          border: 1px solid #d5d5d5;
          border-radius: 3px;
          user-select: none;
      }

      .highlight-wrap .copy-btn {
          transition: opacity .3s ease-in-out;
          opacity: 0;
          padding: 2px 6px;
          position: absolute;
          right: 4px;
          top: 8px;
      }

      .highlight-wrap:hover .copy-btn,
      .highlight-wrap .copy-btn:focus {
          opacity: 1
      }

      .highlight-wrap {
          position: relative;
      }
  </style>
  <script>
      $('.highlight').each(function(i, e) {
          var $wrap = $('<div>').addClass('highlight-wrap')
          $(e).after($wrap)
          $wrap.append($('<button>').addClass('copy-btn').append('复制').on('click', function(e) {
              var code = $(e.target).parent().find('.code').find('.line').map(function(i, e) {
                  return $(e).text()
              }).toArray().join('\n')
              var ta = document.createElement('textarea')
              document.body.appendChild(ta)
              ta.style.position = 'fixed'
              ta.style.top = 0
              ta.style.left = 0
              ta.value = code
              ta.select()
              ta.focus()
              document.execCommand('copy')
              document.body.removeChild(ta)
          })).append(e)
      })
  </script>


</body>
</html>
