<!DOCTYPE html>












  


<html class="theme-next mist use-motion" lang="zh-CN">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=2"/>
<meta name="theme-color" content="#222">



  
  
  <link rel="stylesheet" href="/lib/needsharebutton/needsharebutton.css">




  
  
    
    
  <script src="/lib/pace/pace.min.js?v=1.0.2"></script>
  <link href="/lib/pace/pace-theme-minimal.min.css?v=1.0.2" rel="stylesheet">




  
  
  <link rel="stylesheet" media="all" href="/lib/Han/dist/han.min.css?v=3.3">




<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />






















<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=6.4.0" rel="stylesheet" type="text/css" />


  <link rel="apple-touch-icon" sizes="180x180" href="/images/favicon.png?v=6.4.0">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon.png?v=6.4.0">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon.png?v=6.4.0">


  <link rel="mask-icon" href="/images/logo.svg?v=6.4.0" color="#222">









<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    version: '6.4.0',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":false,"onmobile":false},
    fancybox: false,
    fastclick: false,
    lazyload: false,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>


  




  <meta name="description" content="2017年的最后一天，晚上11点，我才从医院回到家中。先是和姑姑聊了下爷爷后面的治疗方案，后洗完澡躺在床上，看着电脑中写的一篇篇2017年日记。一下子，一个个的鲜活的画面和片段就像放电影似的在我脑中闪耀回旋，或开心，或悲伤，或痛苦，或坚持，或有所得，或如有所思，或成长，或迷失，或坚定，于是乎精神抖擞，想着还是写一份文章总结一下我的2017。 如果选择一个词概括2017，那么一定是「经历」。">
<meta name="keywords" content="总结">
<meta property="og:type" content="article">
<meta property="og:title" content="关于2017">
<meta property="og:url" content="http://whiledoing.me/2018/01/01/summary-2017/index.html">
<meta property="og:site_name" content="whiledoing">
<meta property="og:description" content="2017年的最后一天，晚上11点，我才从医院回到家中。先是和姑姑聊了下爷爷后面的治疗方案，后洗完澡躺在床上，看着电脑中写的一篇篇2017年日记。一下子，一个个的鲜活的画面和片段就像放电影似的在我脑中闪耀回旋，或开心，或悲伤，或痛苦，或坚持，或有所得，或如有所思，或成长，或迷失，或坚定，于是乎精神抖擞，想着还是写一份文章总结一下我的2017。 如果选择一个词概括2017，那么一定是「经历」。">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2018-04-18T07:15:34.063Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="关于2017">
<meta name="twitter:description" content="2017年的最后一天，晚上11点，我才从医院回到家中。先是和姑姑聊了下爷爷后面的治疗方案，后洗完澡躺在床上，看着电脑中写的一篇篇2017年日记。一下子，一个个的鲜活的画面和片段就像放电影似的在我脑中闪耀回旋，或开心，或悲伤，或痛苦，或坚持，或有所得，或如有所思，或成长，或迷失，或坚定，于是乎精神抖擞，想着还是写一份文章总结一下我的2017。 如果选择一个词概括2017，那么一定是「经历」。">






  <link rel="canonical" href="http://whiledoing.me/2018/01/01/summary-2017/"/>



<script type="text/javascript" id="page.configurations">
  CONFIG.page = {
    sidebar: "",
  };
</script>

  <title>关于2017 | whiledoing</title>
  




<script async src="https://www.googletagmanager.com/gtag/js?id=UA-117714040-1"></script>
<script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'UA-117714040-1');
</script>



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "https://hm.baidu.com/hm.js?6de2920425778ca5a4ee717be5055e96";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>




  <noscript>
  <style type="text/css">
    .use-motion .motion-element,
    .use-motion .brand,
    .use-motion .menu-item,
    .sidebar-inner,
    .use-motion .post-block,
    .use-motion .pagination,
    .use-motion .comments,
    .use-motion .post-header,
    .use-motion .post-body,
    .use-motion .collection-title { opacity: initial; }

    .use-motion .logo,
    .use-motion .site-title,
    .use-motion .site-subtitle {
      opacity: initial;
      top: initial;
    }

    .use-motion {
      .logo-line-before i { left: initial; }
      .logo-line-after i { right: initial; }
    }
  </style>
</noscript>

</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-CN">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">whiledoing</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
    
      
        <p class="site-subtitle">喜欢一切简单且美的事物，包括人。</p>
      
    
  </div>

  <div class="site-nav-toggle">
    <button aria-label="切换导航栏">
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>



<nav class="site-nav">
  
    <ul id="menu" class="menu">
      
        
        
        
          
          <li class="menu-item menu-item-home">
    <a href="/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-home"></i> <br />首页</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-about">
    <a href="/about/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-user"></i> <br />关于</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-tags">
    <a href="/tags/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />标签</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-archives">
    <a href="/archives/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />归档</a>
  </li>

      
      
    </ul>
  

  
    

  

  
</nav>



  



</div>
    </header>

    


    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  
    <div class="reading-progress-bar"></div>
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://whiledoing.me/2018/01/01/summary-2017/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="whiledoing">
      <meta itemprop="description" content="喜欢一切简单且美的事物，包括人。">
      <meta itemprop="image" content="/images/avatar.jpeg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="whiledoing">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">关于2017
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">

            
            
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              

              
                
              

              <time title="创建时间：2018-01-01 02:18:54" itemprop="dateCreated datePublished" datetime="2018-01-01T02:18:54+08:00">2018-01-01</time>
            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body han-init-context" itemprop="articleBody">

      
      

      
        <p>2017&#x5E74;&#x7684;&#x6700;&#x540E;&#x4E00;&#x5929;&#xFF0C;&#x665A;&#x4E0A;11&#x70B9;&#xFF0C;&#x6211;&#x624D;&#x4ECE;&#x533B;&#x9662;&#x56DE;&#x5230;&#x5BB6;&#x4E2D;&#x3002;&#x5148;&#x662F;&#x548C;&#x59D1;&#x59D1;&#x804A;&#x4E86;&#x4E0B;&#x7237;&#x7237;&#x540E;&#x9762;&#x7684;&#x6CBB;&#x7597;&#x65B9;&#x6848;&#xFF0C;&#x540E;&#x6D17;&#x5B8C;&#x6FA1;&#x8EBA;&#x5728;&#x5E8A;&#x4E0A;&#xFF0C;&#x770B;&#x7740;&#x7535;&#x8111;&#x4E2D;&#x5199;&#x7684;&#x4E00;&#x7BC7;&#x7BC7;2017&#x5E74;&#x65E5;&#x8BB0;&#x3002;&#x4E00;&#x4E0B;&#x5B50;&#xFF0C;&#x4E00;&#x4E2A;&#x4E2A;&#x7684;&#x9C9C;&#x6D3B;&#x7684;&#x753B;&#x9762;&#x548C;&#x7247;&#x6BB5;&#x5C31;&#x50CF;&#x653E;&#x7535;&#x5F71;&#x4F3C;&#x7684;&#x5728;&#x6211;&#x8111;&#x4E2D;&#x95EA;&#x8000;&#x56DE;&#x65CB;&#xFF0C;&#x6216;&#x5F00;&#x5FC3;&#xFF0C;&#x6216;&#x60B2;&#x4F24;&#xFF0C;&#x6216;&#x75DB;&#x82E6;&#xFF0C;&#x6216;&#x575A;&#x6301;&#xFF0C;&#x6216;&#x6709;&#x6240;&#x5F97;&#xFF0C;&#x6216;&#x5982;&#x6709;&#x6240;&#x601D;&#xFF0C;&#x6216;&#x6210;&#x957F;&#xFF0C;&#x6216;&#x8FF7;&#x5931;&#xFF0C;&#x6216;&#x575A;&#x5B9A;&#xFF0C;&#x4E8E;&#x662F;&#x4E4E;&#x7CBE;&#x795E;&#x6296;&#x64DE;&#xFF0C;&#x60F3;&#x7740;&#x8FD8;&#x662F;&#x5199;&#x4E00;&#x4EFD;&#x6587;&#x7AE0;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x6211;&#x7684;2017&#x3002;</p>
<p>&#x5982;&#x679C;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x8BCD;&#x6982;&#x62EC;2017&#xFF0C;&#x90A3;&#x4E48;&#x4E00;&#x5B9A;&#x662F;&#x300C;&#x7ECF;&#x5386;&#x300D;&#x3002;</p>
<a id="more"></a>
<h2 id="&#x6BCD;&#x4EB2;&#x751F;&#x75C5;">&#x6BCD;&#x4EB2;&#x751F;&#x75C5;</h2>
<p>&#x5E74;&#x4E2D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6BCD;&#x4EB2;&#x68C0;&#x6D4B;&#x51FA;&#x4E86;&#x4E73;&#x817A;&#x764C;&#x3002;&#x6211;&#x8FD8;&#x8BB0;&#x5F97;&#x90A3;&#x5929;&#x665A;&#x4E0A;&#x6211;&#x67E5;&#x4E86;&#x4E00;&#x591C;&#x7684;&#x8D44;&#x6599;&#xFF0C;&#x770B;&#x770B;&#x8FD9;&#x4E2A;&#x75C5;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#xFF0C;&#x5982;&#x4F55;&#x6CBB;&#x7597;&#x3002;&#x7136;&#x540E;&#x53C8;&#x770B;&#x4E86;&#x5F88;&#x591A;&#x5B89;&#x629A;&#x75C5;&#x4EBA;&#xFF0C;&#x5FC3;&#x7406;&#x5B66;&#x76F8;&#x5173;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x7B2C;&#x4E8C;&#x5929;&#x4E00;&#x65E9;&#x4E0A;&#x5750;&#x8F66;&#x5B50;&#x56DE;&#x5BB6;&#x770B;&#x671B;&#x6BCD;&#x4EB2;&#xFF0C;&#x4E00;&#x8DEF;&#x4E0A;&#x4E5F;&#x90FD;&#x60F3;&#x7740;&#x5982;&#x4F55;&#x5B89;&#x629A;&#x6BCD;&#x4EB2;&#x3002;&#x867D;&#x7136;&#x5F97;&#x4E86;&#x75C5;&#xFF0C;&#x4F46;&#x8001;&#x5929;&#x7737;&#x987E;&#xFF0C;&#x6211;&#x6BCD;&#x4EB2;&#x7684;&#x75C5;&#x5728;&#x4E73;&#x817A;&#x764C;&#x60A3;&#x8005;&#x4E2D;&#x7A0B;&#x5EA6;&#x5C5E;&#x4E8E;&#x6BD4;&#x8F83;&#x8F7B;&#x7684;&#x3002;&#x901A;&#x8FC7;&#x4E00;&#x5B9A;&#x7684;&#x6CBB;&#x7597;&#xFF0C;&#x540E;&#x671F;&#x590D;&#x53D1;&#x6982;&#x7387;&#x8F83;&#x4F4E;&#xFF0C;&#x76F8;&#x5BF9;&#x6CBB;&#x7597;&#x6548;&#x679C;&#x4E5F;&#x8F83;&#x597D;&#xFF0C;&#x8FD9;&#x7740;&#x5B9E;&#x662F;&#x4E00;&#x4E2A;&#x4EE4;&#x4EBA;&#x632F;&#x594B;&#x7684;&#x6D88;&#x606F;&#x3002;&#x770B;&#x5230;&#x6BCD;&#x4EB2;&#xFF0C;&#x6211;&#x5C31;&#x548C;&#x5979;&#x8BF4;&#x7740;&#x68C0;&#x6D4B;&#x62A5;&#x544A;&#x4E2D;&#x7684;&#x76F8;&#x5173;&#x53C2;&#x6570;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF0C;&#x4EE5;&#x53CA;&#x544A;&#x8BC9;&#x5979;&#xFF0C;&#x5979;&#x7684;&#x76F8;&#x5173;&#x53C2;&#x6570;&#x60C5;&#x51B5;&#x90FD;&#x6BD4;&#x8F83;&#x597D;&#xFF0C;&#x8BA9;&#x5979;&#x4E00;&#x5B9A;&#x8981;&#x575A;&#x5F3A;&#xFF0C;&#x914D;&#x5408;&#x533B;&#x751F;&#x6CBB;&#x7597;&#x3002;&#x4E5F;&#x662F;&#x4E00;&#x77AC;&#x95F4;&#xFF0C;&#x6211;&#x5C31;&#x4ECE;&#x4E00;&#x4E2A;&#x5BF9;&#x4E73;&#x817A;&#x764C;&#x5B8C;&#x5168;&#x4E0D;&#x61C2;&#x7684;&#x95E8;&#x5916;&#x6C49;&#x53D8;&#x6210;&#x4E86;&#x719F;&#x6089;&#x5404;&#x79CD;&#x76F8;&#x5173;&#x53C2;&#x6570;&#x548C;&#x610F;&#x4E49;&#x7684;&#x5C0F;&#x4E13;&#x5BB6;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x5B89;&#x629A;&#x6BCD;&#x4EB2;&#x7684;&#x60C5;&#x7EEA;&#xFF0C;&#x6211;&#x4E13;&#x95E8;&#x8054;&#x7CFB;&#x4E86;&#x4EB2;&#x621A;&#x4E2D;&#x4E5F;&#x5F97;&#x8FC7;&#x76F8;&#x5173;&#x75C5;&#x7684;&#x59D1;&#x59D1;&#x6765;&#x7ED9;&#x6211;&#x6BCD;&#x4EB2;&#x73B0;&#x8EAB;&#x8BF4;&#x6CD5;&#x3002;&#x8FD9;&#x4E2A;&#x975E;&#x5E38;&#x7BA1;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x75C5;&#x4EBA;&#x6700;&#x4E86;&#x89E3;&#x75C5;&#x4EBA;&#xFF0C;&#x4E00;&#x4E0B;&#x5B50;&#x5979;&#x7684;&#x5FC3;&#x60C5;&#x5C31;&#x53D8;&#x5F97;&#x4E0D;&#x518D;&#x7126;&#x8E81;&#xFF0C;&#x4EBA;&#x4E5F;&#x653E;&#x677E;&#x4E86;&#x8BB8;&#x591A;&#xFF0C;&#x53D8;&#x7684;&#x79EF;&#x6781;&#x914D;&#x5408;&#x6CBB;&#x7597;&#x8D77;&#x6765;&#x3002;&#x5BF9;&#x4E8E;&#x75C5;&#x4EBA;&#x800C;&#x8A00;&#xFF0C;&#x7269;&#x7406;&#x7684;&#x6CBB;&#x7597;&#x56FA;&#x7136;&#x91CD;&#x8981;&#xFF0C;&#x4F46;&#x5FC3;&#x7406;&#x7684;&#x5B89;&#x629A;&#x4E5F;&#x5FC5;&#x4E0D;&#x53EF;&#x5C11;&#x3002;&#x867D;&#x7136;&#x8BF4;&#x8D77;&#x6765;&#x4E73;&#x817A;&#x764C;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x764C;&#x75C7;&#xFF0C;&#x4F46;&#x4E73;&#x817A;&#x764C;&#x76F8;&#x6BD4;&#x4E8E;&#x5176;&#x4ED6;&#x764C;&#x75C7;&#x800C;&#x8A00;&#xFF0C;&#x4E25;&#x91CD;&#x7A0B;&#x5EA6;&#x76F8;&#x5BF9;&#x8F83;&#x4F4E;&#xFF08;&#x4F46;&#x4E5F;&#x662F;&#x73B0;&#x5728;&#x5973;&#x6027;&#x7279;&#x522B;&#x9AD8;&#x53D1;&#x7684;&#x764C;&#x75C7;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x9AD8;&#x53D1;&#x7684;&#x764C;&#x75C7;&#x662F;&#x5375;&#x5DE2;&#x764C;&#xFF09;&#x3002;&#x6162;&#x6162;&#x7684;&#xFF0C;&#x6BCD;&#x4EB2;&#x5728;&#x7ECF;&#x5386;&#x4E86;&#x6570;&#x6B21;&#x653E;&#x7597;&#x548C;&#x5316;&#x7597;&#x7684;&#x75DB;&#x82E6;&#x6298;&#x78E8;&#x540E;&#xFF0C;&#x53C8;&#x5728;&#x6389;&#x5149;&#x4E86;&#x5934;&#x53D1;&#x53C8;&#x957F;&#x51FA;&#x4E86;&#x65B0;&#x5934;&#x53D1;&#x540E;&#xFF08;&#x4E3A;&#x6B64;&#x8FD8;&#x7279;&#x610F;&#x8BA9;&#x6211;&#x62FD;&#x4E86;&#x62FD;&#x5979;&#x7684;&#x65B0;&#x751F;&#x5934;&#x53D1;&#xFF09;&#xFF0C;&#x4E00;&#x5207;&#x53C8;&#x90FD;&#x53D8;&#x5F97;&#x597D;&#x4E86;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x4E5F;&#x662F;&#x901A;&#x8FC7;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x6211;&#x624D;&#x4E86;&#x89E3;&#x5230;&#xFF1A;&#x5176;&#x5B9E;&#x4EBA;&#x7684;&#x8EAB;&#x4F53;&#x4E2D;&#x4E00;&#x76F4;&#x90FD;&#x6709;&#x764C;&#x75C7;&#x7EC6;&#x80DE;&#xFF0C;&#x4F1A;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#x53D1;&#x751F;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x7684;&#x300C;&#x7EC6;&#x80DE;&#x5F02;&#x53D8;&#x764C;&#x7EC6;&#x80DE;&#x300D;&#x3002;&#x91CD;&#x8981;&#x7684;&#x662F;&#x764C;&#x7EC6;&#x80DE;&#x7684;&#x7A0B;&#x5EA6;&#x548C;&#x5BC6;&#x5EA6;&#xFF0C;&#x4E00;&#x65E6;&#x7A0B;&#x5EA6;&#x548C;&#x5BC6;&#x5EA6;&#x79EF;&#x7D2F;&#x5230;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#xFF0C;&#x5F62;&#x6210;&#x5757;&#x72B6;&#x7269;&#xFF0C;&#x5C31;&#x53D8;&#x6210;&#x81F4;&#x547D;&#x5A01;&#x80C1;&#x7684;&#x764C;&#x75C7;&#x3002;&#x4E0D;&#x6B63;&#x5E38;&#x7684;&#x4F5C;&#x606F;&#xFF0C;&#x71AC;&#x591C;&#xFF0C;&#x4E0D;&#x8FD0;&#x52A8;&#xFF0C;&#x538B;&#x529B;&#x5927;&#xFF0C;&#x5403;&#x81F4;&#x764C;&#x7684;&#x98DF;&#x7269;&#x7B49;&#x56E0;&#x7D20;&#x90FD;&#x4F1A;&#x5BFC;&#x81F4;&#x7EC6;&#x80DE;&#x7684;&#x5F02;&#x53D8;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x8BBA;&#x591A;&#x5E74;&#x8F7B;&#xFF0C;&#x90FD;&#x4E00;&#x5B9A;&#x8981;&#x5173;&#x6CE8;&#x81EA;&#x5DF1;&#x7684;&#x8EAB;&#x4F53;&#x3002;&#x56E0;&#x4E3A;&#x4E8B;&#x60C5;&#x7684;&#x53D1;&#x751F;&#x4E5F;&#x8BB8;&#x5C31;&#x5728;&#x4E00;&#x77AC;&#x95F4;&#xFF0C;&#x4F46;&#x6076;&#x679C;&#x7D2F;&#x79EF;&#x5374;&#x662F;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x3002;</p>
<h2 id="&#x8F9E;&#x804C;gap">&#x8F9E;&#x804C;GAP</h2>
<p>8&#x6708;&#x5E95;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x8F9E;&#x4E86;&#x5DE5;&#x4F5C;&#x3002;&#x4E00;&#x6765;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x81EA;&#x5DF1;&#x4E00;&#x76F4;&#x5728;&#x91CD;&#x65B0;&#x5B9A;&#x4F4D;&#x81EA;&#x5DF1;&#x7684;&#x804C;&#x4E1A;&#x65B9;&#x5411;&#xFF0C;&#x60F3;&#x6709;&#x6240;&#x8C03;&#x6574;&#x4EE5;&#x4FBF;&#x66F4;&#x9002;&#x5E94;&#x4E2A;&#x4EBA;&#x6027;&#x683C;&#x7279;&#x70B9;&#x548C;&#x4F18;&#x52BF;&#xFF1B;&#x4E8C;&#x6765;&#x4E5F;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4E00;&#x76F4;&#x60F3;&#x7740;&#x8981;&#x6765;&#x4E00;&#x573A;&#x300C;gap year&#x300D;&#xFF0C;&#x300C;&#x4E00;&#x573A;&#x8BF4;&#x8D70;&#x5C31;&#x8D70;&#x300D;&#xFF0C;&#x300C;&#x4E00;&#x573A;&#x4E16;&#x754C;&#x90A3;&#x4E48;&#x5927;&#xFF0C;&#x6211;&#x60F3;&#x53BB;&#x5403;&#x5403;&#x300D;&#x7684;&#x65C5;&#x884C;&#x3002;&#x672C;&#x6765;&#x6211;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x7279;&#x522B;&#x559C;&#x6B22;&#x6E38;&#x73A9;&#x548C;&#x4EA4;&#x670B;&#x53CB;&#x7684;&#x4EBA;&#xFF0C;&#x60F3;&#x7740;&#x8D81;&#x7740;&#x81EA;&#x5DF1;&#x73B0;&#x5728;&#x6CA1;&#x6709;&#x7ED3;&#x5A5A;&#xFF0C;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x751F;&#x6D3B;&#x8D23;&#x4EFB;&#x548C;&#x538B;&#x529B;&#xFF0C;&#x81EA;&#x5DF1;&#x53C8;&#x6709;&#x94B1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x591A;&#x51FA;&#x53BB;&#x770B;&#x770B;&#xFF0C;&#x4E5F;&#x597D;&#x597D;&#x7684;&#x770B;&#x770B;&#x3002;&#x4E8E;&#x662F;&#x4E4E;&#xFF0C;&#x6211;&#x5F88;&#x8FC5;&#x901F;&#x7684;&#x8F9E;&#x4E86;&#x5DE5;&#x4F5C;&#xFF0C;&#x5C31;&#x51C6;&#x5907;&#x8D77;&#x81EA;&#x5DF1;&#x7684;&#x65C5;&#x884C;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x9884;&#x5B9A;&#x662F;3&#x4E2A;&#x6708;&#x7684;&#x6E38;&#x73A9;&#x8BA1;&#x5212;&#xFF0C;&#x4ECE;9&#x6708;&#x4EFD;&#x5230;11&#x6708;&#x4EFD;&#xFF0C;12&#x6708;&#x4EFD;&#x56DE;&#x6765;&#x627E;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E0D;&#x8FC7;&#x540E;&#x6765;&#x56E0;&#x4E3A;&#x7237;&#x7237;&#x7A81;&#x7136;&#x751F;&#x75C5;&#xFF0C;&#x6211;&#x4E5F;&#x5C31;11&#x6708;&#x4EFD;&#x56DE;&#x53BB;&#x4E86;&#xFF0C;&#x73B0;&#x5728;&#x4E5F;&#x4E00;&#x76F4;&#x5728;&#x7167;&#x987E;&#x7237;&#x7237;&#x3002;&#x603B;&#x7684;&#x7B97;&#x8D77;&#x6765;&#xFF0C;&#x6E38;&#x73A9;&#x4E86;&#x6709;2&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x671F;&#x95F4;&#x6CA1;&#x6709;&#x7279;&#x522B;&#x5177;&#x4F53;&#x7684;&#x8DEF;&#x7EBF;&#xFF0C;&#x6CA1;&#x6709;&#x7279;&#x522B;&#x9650;&#x5236;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x91D1;&#x94B1;&#x4E0A;&#x4E5F;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x50A8;&#x5907;&#xFF0C;&#x5C31;&#x8FD9;&#x6837;&#x5B50;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x80CC;&#x5305;&#x6D41;&#x6D6A;&#xFF1A;&#x5FAE;&#x4FE1;&#x597D;&#x53CB;&#x589E;&#x52A0;&#x4E86;&#x51E0;&#x767E;&#x4E2A;&#xFF0C;&#x542C;&#x5230;&#x4E86;N&#x591A;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x770B;&#x5230;&#x4E86;N&#x591A;&#x5F62;&#x5F62;&#x8272;&#x8272;&#x7684;&#x4EBA;&#xFF0C;&#x4F4F;&#x4E86;N&#x591A;&#x9752;&#x65C5;&#x3001;&#x540D;&#x5BBF;&#x3001;&#x9152;&#x5E97;&#x3001;&#x5BC4;&#x5BBF;&#x623F;&#x95F4;&#xFF0C;&#x559D;&#x4E86;N&#x591A;&#x7684;&#x9152;&#xFF0C;&#x5403;&#x4E86;N&#x591A;&#x597D;&#x5403;&#x7684;&#xFF0C;&#x6389;&#x4E86;N&#x591A;&#x7684;&#x5E3D;&#x5B50;&#xFF0C;&#x8D70;&#x4E86;N&#x591A;&#x7684;&#x8DEF;&#xFF0C;&#x5750;&#x4E86;N&#x591A;&#x7684;&#x6C7D;&#x8F66;&#x3001;&#x98DE;&#x673A;&#x3001;&#x706B;&#x8F66;&#x3001;&#x751A;&#x81F3;&#x642D;&#x8F66;&#xFF0C;&#x5F53;&#x7136;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#x62CD;&#x4E86;N&#x591A;&#x7684;&#x7167;&#x7247;&#xFF08;&#x518D;&#x4E5F;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x6CA1;&#x6709;&#x5934;&#x50CF;&#x53EF;&#x4EE5;&#x6362;&#x4E86;&#x1F604;&#xFF09;&#x3002;&#x60F3;&#x6765;&#x786E;&#x5B9E;&#x4EE4;&#x4EBA;&#x7279;&#x522B;&#x96BE;&#x5FD8;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x95EE;&#x6211;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x51FA;&#x53BB;&#x73A9;&#x7684;&#x8BDD;&#xFF0C;&#x9700;&#x8981;&#x51C6;&#x5907;&#x4EC0;&#x4E48;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x56F0;&#x96BE;&#xFF08;&#x6BD4;&#x5982;&#x6CA1;&#x6709;&#x4EBA;&#x770B;&#x62A4;&#x5305;&#xFF0C;&#x4F4F;&#x5BBF;&#xFF0C;&#x89E3;&#x51B3;&#x4E2A;&#x4EBA;&#x536B;&#x751F;&#xFF0C;&#x4E0D;&#x5B89;&#x5168;&#xFF0C;etc&#xFF09;&#x600E;&#x4E48;&#x89E3;&#x51B3;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x591A;&#x65E0;&#x804A;&#xFF0C;&#x600E;&#x4E48;&#x62CD;&#x7167;&#xFF0C;&#x7B49;&#x4E00;&#x7CFB;&#x5217;&#x95EE;&#x9898;&#x3002;&#x6211;&#x57FA;&#x672C;&#x4E0A;&#x544A;&#x8BC9;&#x4ED6;&#x4EEC;&#x7684;&#x5C31;&#x662F;&#xFF1A;&#x6CA1;&#x5565;&#x51C6;&#x5907;&#xFF0C;&#x968F;&#x9047;&#x800C;&#x5B89;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x4F60;&#x53EA;&#x8981;&#x51FA;&#x53D1;&#x4E86;&#xFF0C;&#x4E00;&#x5207;&#x95EE;&#x9898;&#x8DEF;&#x4E0A;&#x5C31;&#x89E3;&#x51B3;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x8FD9;&#x8FD8;&#x771F;&#x4E0D;&#x662F;&#x9A97;&#x4EBA;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x81EA;&#x5DF1;&#x51C6;&#x5907;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x6CA1;&#x6709;&#x82B1;&#x5F88;&#x591A;&#x65F6;&#x95F4;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x7279;&#x522B;&#x89C4;&#x5212;&#x884C;&#x7A0B;&#x3002;&#x5F53;&#x65F6;&#x5C31;&#x4E70;&#x4E86;&#x4E00;&#x4E2A;&#x6237;&#x5916;&#x80CC;&#x5305;&#x548C;Sony&#x5FAE;&#x5355;&#xFF0C;&#x7136;&#x540E;&#x8BA1;&#x5212;3&#x4E2A;&#x6708;&#x5927;&#x81F4;&#x65F6;&#x95F4;&#x8303;&#x56F4;&#xFF0C;&#x53C8;&#x5236;&#x5B9A;&#x4E86;&#x4E00;&#x4E2A;&#x5148;&#x5230;&#x62C9;&#x8428;&#x7684;&#x6218;&#x7565;&#x6307;&#x5BFC;&#x65B9;&#x9488;&#xFF08;&#x60F3;&#x7740;&#x4EBA;&#x8FD9;&#x8F88;&#x5B50;&#x603B;&#x8981;&#x53BB;&#x4E00;&#x6B21;&#x6709;&#x4FE1;&#x4EF0;&#x7684;&#x5730;&#x65B9;&#x5427;&#xFF0C;&#x8FD9;&#x6837;&#x5B50;&#x81EA;&#x5DF1;&#x4E5F;&#x7B97;&#x662F;&#x6709;&#x4FE1;&#x4EF0;&#x4E86;&#xFF09;&#x5C31;&#x51FA;&#x53D1;&#x4E86;&#x3002;&#x8FD8;&#x771F;&#x6CA1;&#x6709;&#x8003;&#x8651;&#x8FC7;&#x90A3;&#x4E48;&#x591A;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x60F3;&#x5982;&#x679C;&#x6211;&#x8003;&#x8651;&#x90A3;&#x4E48;&#x591A;&#x95EE;&#x9898;&#x7684;&#x8BDD;&#xFF0C;&#x4E5F;&#x8BB8;&#x6211;&#x81EA;&#x5DF1;&#x5C31;&#x88AB;&#x5413;&#x9000;&#x4E86;&#x1F602;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x6211;&#x7684;&#x4E00;&#x4E2A;&#x5FC3;&#x5F97;&#x611F;&#x53D7;&#xFF1A;&#x300C;&#x505A;&#x4E8B;&#x60C5;&#x9700;&#x8981;&#x51C6;&#x5907;&#xFF0C;&#x4F46;&#x4E0D;&#x9700;&#x8981;&#x8FC7;&#x5EA6;&#x7684;&#x51C6;&#x5907;&#xFF0C;&#x7136;&#x540E;&#x76F4;&#x63A5;&#x884C;&#x52A8;&#x300D;&#x3002;&#x56E0;&#x4E3A;&#x4F60;&#x5728;&#x6CA1;&#x6709;&#x4EB2;&#x8EAB;&#x7ECF;&#x5386;&#x4E4B;&#x524D;&#xFF0C;&#x60F3;&#x7684;&#x95EE;&#x9898;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x7B26;&#x5408;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#xFF0C;&#x53EA;&#x6709;&#x4E0A;&#x8DEF;&#x4E86;&#x9047;&#x5230;&#x4E86;&#x95EE;&#x9898;&#x518D;&#x91CD;&#x65B0;&#x7684;&#x601D;&#x8003;&#xFF0C;&#x624D;&#x66F4;&#x6709;&#x7684;&#x653E;&#x77E2;&#x3002;&#x6309;&#x7167;&#x5DE5;&#x7A0B;&#x8BF4;&#x6CD5;&#x800C;&#x8A00;&#xFF0C;&#x5C31;&#x662F;&#x9700;&#x8981;&#x5148;&#x653E;&#x4E2A;&#x66F3;&#x5149;&#x5F39;&#xFF0C;&#x505A;&#x4E00;&#x4E2A;prototype demo&#xFF0C;&#x7136;&#x540E;&#x518D;&#x8FED;&#x4EE3;&#x4F1A;&#x66F4;&#x6709;&#x6548;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x4EBA;&#x4F1A;&#x5938;&#x6211;&#x670B;&#x53CB;&#x5708;&#x653E;&#x7684;&#x7167;&#x7247;&#x7279;&#x522B;&#x597D;&#x770B;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x5728;&#x6CA1;&#x6709;&#x51FA;&#x53D1;&#x4E4B;&#x524D;&#x6839;&#x672C;&#x4E0D;&#x4F1A;&#x6444;&#x5F71;&#x4E5F;&#x6CA1;&#x6709;&#x5B66;&#x8FC7;&#x6444;&#x5F71;&#x3002;&#x51FA;&#x53D1;&#x4E4B;&#x524D;&#x6211;&#x5305;&#x91CC;&#x653E;&#x4E86;&#x4E00;&#x672C;&#x76F8;&#x673A;&#x4F7F;&#x7528;&#x624B;&#x518C;&#x548C;&#x7C7B;&#x4F3C;&#x4E8E;&#x300C;&#x6444;&#x5F71;&#x4ECE;&#x5165;&#x95E8;&#x5230;&#x7CBE;&#x901A;&#x300D;&#x7684;&#x4E66;&#xFF0C;&#x8DEF;&#x4E0A;&#x5E26;&#x7740;&#x770B;&#x770B;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x5B9E;&#x8DF5;&#x62CD;&#x6444;&#x3002;&#x5176;&#x5B9E;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E0D;&#x65AD;&#x7684;&#x5C1D;&#x8BD5;&#xFF0C;&#x6784;&#x601D;&#xFF0C;&#x4EE5;&#x53CA;N&#x9009;1&#x7684;&#x5220;&#x9664;&#x5927;&#x6CD5;&#xFF0C;&#x6700;&#x540E;&#x52A0;&#x4E0A;&#x7B80;&#x5355;&#x4E14;&#x5408;&#x7406;&#x7684;&#x540E;&#x671F;&#x8C03;&#x6574;&#x3002;&#x6240;&#x4EE5;&#x8D70;&#x5728;&#x8DEF;&#x4E0A;&#xFF0C;&#x95EE;&#x9898;&#x81EA;&#x7136;&#x5C31;&#x4F1A;&#x89E3;&#x51B3;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x603B;&#x4F1A;&#x60F3;&#x7740;&#x6CD5;&#x5B50;&#x53BB;&#x89E3;&#x51B3;&#x3002;&#x51FA;&#x95E8;&#x4E4B;&#x524D;&#x6211;&#x4E5F;&#x72B9;&#x8C6B;&#x8FC7;&#x662F;&#x4E0D;&#x662F;&#x8981;&#x4E70;&#x76F8;&#x673A;&#xFF0C;&#x56E0;&#x4E3A;&#x73B0;&#x5728;&#x624B;&#x673A;&#x62CD;&#x7167;&#x529F;&#x80FD;&#x5DF2;&#x7ECF;&#x505A;&#x7684;&#x7279;&#x522B;&#x65B9;&#x4FBF;&#x548C;&#x5B8C;&#x5584;&#x3002;&#x4F46;&#x6700;&#x7EC8;&#x6211;&#x8FD8;&#x662F;&#x82B1;&#x4E86;&#x4E9B;&#x94F6;&#x5B50;&#x8D2D;&#x5165;&#x76F8;&#x673A;&#xFF0C;&#x7ED3;&#x679C;&#x6765;&#x770B;&#xFF0C;&#x7269;&#x8D85;&#x6240;&#x503C;&#x3002;&#x5728;&#x9700;&#x8981;&#x62CD;&#x6444;&#x5E7F;&#x89D2;&#xFF0C;&#x9700;&#x8981;&#x865A;&#x5316;&#xFF0C;&#x5728;&#x5149;&#x7EBF;&#x6697;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x5728;&#x9700;&#x8981;&#x957F;&#x66DD;&#x5149;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x624B;&#x673A;&#x5B8C;&#x5168;&#x8D77;&#x4E0D;&#x4E86;&#x4F5C;&#x7528;&#xFF0C;&#x53EA;&#x80FD;&#x76F8;&#x673A;&#x767B;&#x573A;&#x3002;&#x6240;&#x4EE5;&#x63A8;&#x8350;&#x65C5;&#x884C;&#x7684;&#x670B;&#x53CB;&#x4E00;&#x5B9A;&#x8981;&#x5E26;&#x4E2A;&#x76F8;&#x673A;&#xFF0C;&#x800C;&#x4E14;&#x5F3A;&#x70C8;&#x63A8;&#x8350;&#x5FAE;&#x5355;&#x3002;&#x6211;&#x5728;&#x5580;&#x7EB3;&#x65AF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x771F;&#x662F;&#x9047;&#x5230;&#x4E86;&#x5404;&#x79CD;&#x80CC;&#x7740;&#x957F;&#x67AA;&#x77ED;&#x70AE;&#x8D70;&#x7684;&#x6C14;&#x5598;&#x5401;&#x5401;&#x7684;&#x5927;&#x7237;&#x5927;&#x5988;&#xFF0C;&#x4E00;&#x4E2A;&#x5B57;&#x7D2F;&#x3002;&#x5355;&#x53CD;&#x6BD4;&#x5FAE;&#x5355;&#x91CD;&#x591A;&#x4E86;&#xFF0C;&#x66F4;&#x4F55;&#x51B5;&#x6211;&#x8FD9;&#x79CD;&#x957F;&#x65F6;&#x95F4;&#x65C5;&#x884C;&#x52A0;&#x5F92;&#x6B65;&#x7684;&#x4EBA;&#xFF08;&#x6068;&#x4E0D;&#x5F97;&#x80CC;&#x5305;&#x4E2D;&#x4EC0;&#x4E48;&#x91CD;&#x91CF;&#x90FD;&#x6CA1;&#x6709;&#xFF09;&#x3002;&#x800C;&#x4E14;Sony&#x5927;&#x6CD5;&#x597D;&#xFF0C;&#x5FAE;&#x5355;&#x6548;&#x679C;&#x4E5F;&#x5F88;&#x4E0D;&#x9519;&#xFF0C;&#x5BF9;&#x4E8E;&#x6211;&#x8FD9;&#x79CD;&#x53EA;&#x662F;&#x60F3;&#x8BB0;&#x5F55;&#x751F;&#x6D3B;&#x7684;&#x4EBA;&#x800C;&#x8A00;&#xFF0C;&#x8DB3;&#x591F;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#x4E00;&#x4E2A;&#x4EBA;&#x65C5;&#x884C;&#x6700;&#x6709;&#x610F;&#x601D;&#x7684;&#x90E8;&#x5206;&#x5C31;&#x662F;&#x968F;&#x9047;&#x800C;&#x5B89;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x53D7;&#x522B;&#x4EBA;&#x7684;&#x60F3;&#x6CD5;&#x548C;&#x8BA1;&#x5212;&#x63A7;&#x5236;&#x3002;&#x6211;&#x4ECA;&#x5929;&#x559C;&#x6B22;&#x8FD9;&#x4E2A;&#x5730;&#x65B9;&#x5C31;&#x591A;&#x5F85;&#x4E24;&#x5929;&#xFF0C;&#x4E0D;&#x559C;&#x6B22;&#x5C31;&#x770B;&#x770B;&#x6709;&#x6CA1;&#x6709;&#x522B;&#x7684;&#x66F4;&#x597D;&#x73A9;&#x7684;&#x5730;&#x65B9;&#x3002;&#x4EA6;&#x6216;&#x662F;&#x672C;&#x6765;&#x60F3;&#x53BB;A&#x5730;&#x65B9;&#xFF0C;&#x7136;&#x540E;&#x9047;&#x5230;&#x4E86;&#x7279;&#x522B;&#x804A;&#x5F97;&#x6765;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x8981;&#x53BB;B&#xFF0C;&#x5C31;&#x76F4;&#x63A5;&#x7EA6;&#x4F34;&#x53BB;B&#x4E86;&#xFF0C;&#x53CD;&#x6B63;&#x6211;&#x4E5F;&#x6CA1;&#x6709;&#x7279;&#x522B;&#x7684;&#x8BA1;&#x5212;&#xFF0C;&#x53EA;&#x8981;&#x4E00;&#x8DEF;&#x5411;&#x897F;&#x5C31;&#x597D;&#x3002;&#x4E5F;&#x6B63;&#x662F;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x6240;&#x4EE5;&#x4F4F;&#x7684;&#x4E5F;&#x7279;&#x522B;&#x65B9;&#x4FBF;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x6211;&#x5C31;&#x662F;&#x4F4F;&#x9752;&#x65C5;&#xFF0C;&#x65E2;&#x4FBF;&#x5B9C;&#xFF08;&#x5E73;&#x5747;&#x4E00;&#x665A;50&#x5143;&#xFF09;&#xFF0C;&#x4EBA;&#x591A;&#x70ED;&#x95F9;&#x4E5F;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x7EA6;&#x73A9;&#x7EA6;&#x996D;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x3002;&#x5176;&#x5B9E;&#x4F4F;&#x9752;&#x65C5;&#x7684;&#x5E76;&#x4E0D;&#x90FD;&#x662F;&#x6240;&#x8C13;&#x7684;&#x300C;&#x9752;&#x5E74;&#x4EBA;&#x300D;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x4E0A;&#x4E86;&#x5E74;&#x7EAA;&#xFF0C;&#x6216;&#x8005;&#x7279;&#x522B;&#x610F;&#x601D;&#x7684;&#x4EBA;&#x90FD;&#x4F1A;&#x9009;&#x62E9;&#x4F4F;&#x9752;&#x65C5;&#xFF0C;&#x56E0;&#x4E3A;&#x5927;&#x81F4;&#x60F3;&#x6CD5;&#x548C;&#x6211;&#x5DEE;&#x4E0D;&#x591A;&#xFF0C;&#x4F4F;&#x9152;&#x5E97;&#x5B9E;&#x5728;&#x662F;&#x65E0;&#x8DA3;&#x7684;&#x5F88;&#x3002;&#x8BB0;&#x5F97;&#x5728;&#x62C9;&#x8428;&#x7684;&#x5E73;&#x63AA;&#x9752;&#x65C5;&#xFF0C;&#x6211;&#x4F4F;&#x5728;&#x300C;&#x75AF;&#x4EBA;&#x9662;&#x300D;&#xFF1A;&#x95E8;&#x4E0D;&#x4E0A;&#x9501;&#xFF0C;&#x67DC;&#x5B50;&#x4E0D;&#x4E0A;&#x9501;&#xFF0C;&#x5927;&#x95E8;&#x5E38;&#x5F00;&#xFF0C;&#x7537;&#x5973;&#x6DF7;&#x4F4F;&#xFF0C;&#x4F4F;&#x5728;&#x91CC;&#x9762;&#x7684;&#x4EBA;&#x4E5F;&#x90FD;&#x81EA;&#x79F0;&#x300C;&#x75AF;&#x5B50;&#x300D;&#x3002;&#x5C31;&#x662F;&#x5728;&#x8FD9;&#x4E2A;&#x5730;&#x65B9;&#xFF0C;&#x6709;&#x5929;&#x665A;&#x4E0A;&#x6211;&#x5728;&#x9752;&#x65C5;&#x9152;&#x5427;&#x559D;&#x9152;&#x65F6;&#xFF0C;&#x9047;&#x5230;&#x4E00;&#x4F4D;&#x5E7F;&#x4E1C;&#x5927;&#x54E5;&#xFF0C;&#x4ED6;&#x4E5F;&#x4F4F;&#x5728;&#x75AF;&#x4EBA;&#x9662;&#x3002;&#x665A;&#x4E0A;&#x6211;&#x548C;&#x5927;&#x54E5;&#x4E24;&#x4EBA;&#x559D;&#x9152;&#x7545;&#x8C08;&#xFF0C;&#x671F;&#x95F4;&#x4ED6;&#x544A;&#x8BC9;&#x6211;&#x4ED6;&#x6765;&#x897F;&#x85CF;&#x662F;&#x770B;&#x770B;&#x6587;&#x7269;&#xFF0C;&#x4E3B;&#x8981;&#x770B;&#x770B;&#x6CD5;&#x5668;&#xFF0C;&#x4ED6;&#x4E5F;&#x5C31;&#x8FD9;&#x6CD5;&#x5668;&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;&#x548C;&#x6211;&#x8BF4;&#x4E86;&#x5F88;&#x591A;&#x5173;&#x4E8E;&#x897F;&#x85CF;&#x7684;&#x4F20;&#x8BF4;&#xFF0C;&#x5BC6;&#x5B97;&#x548C;&#x795E;&#x79D8;&#x4E4B;&#x4E8B;&#x3002;&#x8BB2;&#x771F;&#xFF0C;&#x5927;&#x54E5;&#x7684;&#x751F;&#x610F;&#x548C;&#x89C1;&#x95FB;&#x90FD;&#x7740;&#x5B9E;&#x5413;&#x5230;&#x4E86;&#x6211;&#xFF0C;&#x6309;&#x7406;&#x8BF4;&#x8D22;&#x5BCC;&#x81EA;&#x7531;&#x5982;&#x5927;&#x54E5;&#x7684;&#x4EBA;&#x5E94;&#x8BE5;&#x4F4F;&#x9AD8;&#x5927;&#x4E0A;&#x7684;&#x9152;&#x5E97;&#xFF0C;&#x5374;&#x6CA1;&#x60F3;&#x5230;&#x4F4F;&#x5728;&#x8FD9;&#x4E00;&#x665A;&#x8C8C;&#x4F3C;&#x624D;&#x4E09;&#x5341;&#x51E0;&#x7684;&#x5730;&#x65B9;&#x3002;&#x6211;&#x95EE;&#x5927;&#x54E5;&#x4F60;&#x4E3A;&#x5565;&#x4F4F;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x4ED6;&#x56DE;&#x300E;&#x9752;&#x65C5;&#x624D;&#x6709;&#x6709;&#x8DA3;&#x7684;&#x7075;&#x9B42;&#x300F;&#x3002;&#x540E;&#x6765;&#x6211;&#x8981;&#x8D76;&#x7740;&#x53BB;&#x65B0;&#x7586;&#xFF0C;&#x5C31;&#x6CA1;&#x548C;&#x5927;&#x54E5;&#x4E00;&#x8D77;&#x7EA6;&#x4F34;&#x7EE7;&#x7EED;&#x73A9;&#x3002;&#x540E;&#x6765;&#x5927;&#x54E5;&#x7ED9;&#x6211;&#x53D1;&#x6765;&#x8BED;&#x97F3;&#x544A;&#x8BC9;&#x6211;&#x4ED6;&#x53BB;&#x4E86;&#x62C9;&#x8428;&#x5468;&#x8FB9;&#x4E00;&#x4E2A;&#x6CE1;&#x6E29;&#x6CC9;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x7279;&#x522B;&#x597D;&#xFF0C;&#x63A8;&#x8350;&#x6211;&#x4E00;&#x5B9A;&#x8981;&#x53BB;&#x6CE1;&#x6CE1;&#x3002;&#x6211;&#x95EE;&#x4ED6;&#x4E3A;&#x5565;&#x597D;&#xFF0C;&#x4ED6;&#x544A;&#x77E5;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x91CC;&#x7684;&#x6E29;&#x6CC9;&#x7537;&#x5973;&#x8EB6;&#x4F53;&#x5171;&#x6D74;&#x3002;&#x8FD9;&#x5E94;&#x8BE5;&#x5C31;&#x662F;&#x6709;&#x8DA3;&#x7684;&#x7075;&#x9B42;&#x3002;&#x1F604;</p>
<p>&#x65C5;&#x884C;&#x7684;&#x8DEF;&#x4E0A;&#x9047;&#x5230;&#x4E86;&#x8BB8;&#x591A;&#x7279;&#x522B;&#x6709;&#x8DA3;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x6BD4;&#x5982;&#x5927;&#x534A;&#x591C;&#x5728;&#x6210;&#x90FD;&#x6253;&#x8F66;&#x53BB;&#x5403;&#x597D;&#x5403;&#x5230;&#x54ED;&#x7684;&#x4E32;&#x4E32;&#x3002;&#x4E32;&#x4E32;&#x5206;&#x4E3A;&#x70ED;&#x9505;&#x4E32;&#x4E32;&#x548C;&#x51B7;&#x9505;&#x4E32;&#x4E32;&#xFF0C;&#x4EE5;&#x53CA;&#x6211;&#x7279;&#x522B;&#x559C;&#x6B22;&#x5403;&#x7684;&#x7C7B;&#x4F3C;&#x51B7;&#x9505;&#x4E32;&#x4E32;&#x7684;&#x94B5;&#x94B5;&#x9E21;&#x3002;&#x5728;&#x6210;&#x90FD;&#x5403;&#x4E86;&#x4E32;&#x4E32;&#xFF0C;&#x771F;&#x662F;&#x9664;&#x5374;&#x5DEB;&#x5C71;&#x4E0D;&#x662F;&#x4E91;&#x3002;&#x6BD4;&#x5982;&#x5728;&#x56FD;&#x9053;318&#x5DDD;&#x85CF;&#x7EBF;&#x8DEF;&#x4E0A;&#x548C;&#x5F00;&#x8F66;&#x5E08;&#x5085;&#x6361;&#x4E86;&#x4E00;&#x8DEF;&#x9A91;&#x884C;&#x8005;&#x6389;&#x7684;&#x5E3D;&#x5B50;&#xFF0C;&#x540E;&#x6765;&#x6211;&#x6234;&#x7684;&#x5E3D;&#x5B50;&#x5C31;&#x662F;&#x8DEF;&#x4E0A;&#x6361;&#x7684;&#x3002;&#x6BD4;&#x5982;&#x6BCF;&#x5929;&#x665A;&#x4E0A;&#x5728;&#x5E73;&#x5747;&#x6D77;&#x62D4;2000+&#x4EE5;&#x4E0A;&#x7684;&#x5730;&#x65B9;&#x548C;&#x5F00;&#x8F66;&#x5E08;&#x5085;&#x559D;52&#x5EA6;&#x7684;&#x67B8;&#x675E;&#x9152;&#xFF0C;&#x6BCF;&#x5929;&#x90FD;&#x559D;&#x3002;&#x6BD4;&#x5982;&#x5728;&#x62C9;&#x8428;&#x6CB3;&#x91CC;&#x9762;&#x8EB6;&#x6CE1;&#x7740;&#x96EA;&#x5C71;&#x6C34;&#xFF0C;&#x6652;&#x7740;&#x592A;&#x9633;&#x548C;&#x85CF;&#x65CF;&#x5927;&#x7237;&#x4E00;&#x8D77;&#x6D17;&#x6FA1;&#x804A;&#x5929;&#x3002;&#x6BD4;&#x5982;&#x5728;&#x98CE;&#x4E2D;&#x5439;&#x4E86;N&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x96E8;&#x4E2D;&#x6253;&#x4E86;N&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x5C31;&#x4E3A;&#x4E86;&#x62CD;&#x6444;&#x4E00;&#x5F20;&#x8272;&#x8FBE;&#x7684;&#x957F;&#x66DD;&#x5149;&#x56FE;&#x3002;&#x6BD4;&#x5982;&#x5728;&#x8D5B;&#x91CC;&#x6728;&#x6E56;&#x642D;&#x8F66;&#x8BA4;&#x8BC6;&#x51E0;&#x4F4D;&#x7279;&#x522B;&#x597D;&#x7684;&#x4F0A;&#x5B81;&#x5C0F;&#x4F19;&#x4F34;&#xFF0C;&#x665A;&#x4E0A;&#x4ED6;&#x4EEC;&#x8BF7;&#x6211;&#x559D;&#x4E86;&#x8FD9;&#x8F88;&#x5B50;&#x559D;&#x8FC7;&#x7684;&#x6700;&#x597D;&#x559D;&#x767D;&#x9152;&#xFF0C;&#x56DE;&#x7518;&#xFF0C;&#x987A;&#x6ED1;&#xFF0C;&#x4E0D;&#x4E0A;&#x5934;&#xFF0C;&#x7B2C;&#x4E8C;&#x5929;&#x8D77;&#x6765;&#x5634;&#x6709;&#x4F59;&#x9999;&#xFF0C;&#x771F;&#x662F;&#x96BE;&#x4EE5;&#x5FD8;&#x6000;&#x3002;&#x6BD4;&#x5982;&#x5728;&#x7C73;&#x62C9;&#x51B0;&#x5DDD;&#x8BA4;&#x8BC6;&#x4E86;&#x4E00;&#x4F4D;&#x5E7F;&#x4E1C;&#x722C;&#x96EA;&#x5C71;&#x6ED1;&#x96EA;&#x7684;&#x5927;&#x7237;&#xFF0C;&#x4ED6;&#x5934;&#x53D1;&#x5DF2;&#x534A;&#x767D;&#xFF0C;&#x4F46;&#x5F53;&#x6211;&#x770B;&#x4E86;&#x4ED6;&#x722C;&#x56DB;&#x59D1;&#x5A18;&#x5C71;&#x548C;&#x9AD8;&#x5C71;&#x6ED1;&#x96EA;&#x7167;&#x7247;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x4ED6;&#x771F;&#x5E74;&#x8F7B;&#x3002;&#x6BD4;&#x5982;&#x5728;&#x4F0A;&#x5B81;&#x9752;&#x65C5;&#x5F39;&#x5409;&#x4ED6;&#xFF0C;&#x8001;&#x677F;&#x8BA9;&#x6211;&#x591A;&#x4F4F;&#x51E0;&#x5929;&#xFF0C;&#x4E0D;&#x8981;&#x94B1;&#xFF0C;&#x53EA;&#x8981;&#x6211;&#x6BCF;&#x5929;&#x5F39;&#x5F39;&#x5409;&#x4ED6;&#x5C31;&#x597D;&#x3002;&#x6BD4;&#x5982;&#x5728;&#x98CE;&#x96EA;&#x4E2D;&#x7B49;&#x5230;&#x4E86;&#x8FDB;&#x5165;&#x300C;&#x7EA2;&#x5176;&#x62C9;&#x752B;&#x300D;&#x56FD;&#x95E8;&#x7684;&#x673A;&#x4F1A;&#x3002;&#x6BD4;&#x5982;&#x5728;&#x5580;&#x4EC0;&#x5403;&#x5230;&#x4E86;&#x6700;&#x597D;&#x5403;&#x7684;&#x74DC;&#x3002;&#x6BD4;&#x5982;&#x5728;&#x5927;&#x534A;&#x591C;&#x7684;&#x5580;&#x4EC0;&#x8001;&#x57CE;&#x533A;&#x6E38;&#x8361;&#x62CD;&#x7167;&#xFF0C;&#x88AB;&#x51E0;&#x4F4D;&#x7EF4;&#x65CF;&#x5927;&#x53D4;&#x8BF7;&#x5BA2;&#x5403;&#x70E4;&#x4E32;&#x3002;&#x6BD4;&#x5982;&#x5728;&#x771F;&#x67AA;&#x5B9E;&#x5F39;&#x7684;&#x8B66;&#x5BDF;&#x966A;&#x540C;&#x4E0B;&#x8FDB;&#x5165;&#x5580;&#x4EC0;&#x8B66;&#x5C40;&#x5E2E;&#x5FD9;&#x89E3;&#x51B3;&#x8BBE;&#x5907;&#x95EE;&#x9898;&#xFF0C;&#x6700;&#x540E;&#x8FD8;&#x548C;&#x5580;&#x4EC0;&#x516C;&#x5B89;&#x5C40;&#x5904;&#x957F;&#x5927;&#x54E5;&#x4E00;&#x8D77;&#x5403;&#x7279;&#x522B;&#x597D;&#x5403;&#x7684;&#x65B0;&#x7586;&#x83DC;&#x3002;&#x6BD4;&#x5982;&#x96EA;&#x5929;&#x9A91;&#x9A6C;&#x4E0A;&#x5580;&#x7EB3;&#x65AF;&#x7684;&#x300C;&#x89C2;&#x9C7C;&#x53F0;&#x300D;&#xFF0C;&#x5E73;&#x5E38;&#x8FD9;&#x91CC;&#x636E;&#x8BF4;&#x5927;&#x53D4;&#x5927;&#x5988;&#x4E3A;&#x4E86;&#x67AA;&#x673A;&#x4F4D;&#x90FD;&#x9700;&#x8981;&#x6253;&#x67B6;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x6211;&#x4E0A;&#x53BB;&#x65F6;&#x5019;&#x4E00;&#x4E2A;&#x4EBA;&#x6CA1;&#x6709;&#xFF0C;&#x6781;&#x5176;&#x9707;&#x64BC;&#x3002;&#x518D;&#x8BF4;&#x5C31;&#x5239;&#x4E0D;&#x4F4F;&#x4E86;&#xFF0C;&#x8FD8;&#x662F;&#x8BF4;&#x8BF4;&#x5370;&#x8C61;&#x6700;&#x6DF1;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x5370;&#x8C61;&#x6700;&#x6DF1;&#x7684;&#x4E8B;&#x60C5;&#x5E94;&#x8BE5;&#x662F;&#x5580;&#x7EB3;&#x65AF;&#x7684;&#x5F92;&#x6B65;&#x3002;&#x5728;&#x5580;&#x7EB3;&#x65AF;&#x4E00;&#x5171;&#x5F92;&#x6B65;&#x4E86;&#x4E24;&#x6BB5;&#xFF1A;&#x7B2C;&#x4E00;&#x6BB5;&#x4ECE;&#x767D;&#x54C8;&#x5DF4;&#x5230;&#x5580;&#x7EB3;&#x65AF;&#xFF0C;23&#x516C;&#x91CC;&#xFF0C;8&#x5C0F;&#x65F6;&#x3002;&#x7B2C;&#x4E8C;&#x6BB5;&#x4ECE;&#x8D3E;&#x767B;&#x5CEA;&#x5230;&#x79BE;&#x6728;&#xFF0C;33&#x516C;&#x91CC;&#xFF0C;10&#x5C0F;&#x65F6;&#x3002;&#x867D;&#x7136;&#x540E;&#x8005;&#x66F4;&#x957F;&#xFF0C;&#x4F46;&#x524D;&#x8005;&#x66F4;&#x7D2F;&#xFF0C;&#x66F4;&#x8BA9;&#x6211;&#x8BB0;&#x5FC6;&#x6DF1;&#x523B;&#x3002;&#x90A3;&#x5929;&#x57FA;&#x672C;&#x90FD;&#x5728;&#x4E0B;&#x96E8;&#xFF0C;&#x7EA6;&#x6709;6&#x5C0F;&#x65F6;&#x5728;&#x96E8;&#x4E2D;&#xFF0C;&#x5728;&#x5404;&#x79CD;&#x6CE5;&#x6CDE;&#xFF0C;&#x7A7A;&#x65E0;&#x4E00;&#x4EBA;&#xFF0C;&#x96E8;&#x96FE;&#x7F2D;&#x7ED5;&#xFF0C;&#x80FD;&#x89C1;&#x5EA6;&#x4E0D;&#x5230;10&#x7C73;&#x7684;&#x5C71;&#x95F4;&#x91CE;&#x8DEF;&#x4E0A;&#xFF0C;&#x80CC;&#x7740;&#x5168;&#x90E8;&#x5BB6;&#x5F53;&#xFF0C;&#x8270;&#x96BE;&#x524D;&#x884C;&#x3002;&#x5728;&#x884C;&#x7A0B;&#x7EA6;&#x8FC7;&#x534A;&#x7684;&#x67D0;&#x5904;&#x5076;&#x9047;&#x54C8;&#x8428;&#x514B;&#x5927;&#x5988;&#x642D;&#x5EFA;&#x7684;&#x6BDB;&#x6BE1;&#x623F;&#xFF0C;&#x5927;&#x5988;&#x6536;&#x7559;&#x4E86;&#x6D51;&#x8EAB;&#x6E7F;&#x900F;&#x7684;&#x6211;&#xFF0C;&#x8865;&#x7ED9;&#x4E86;&#x6551;&#x547D;&#x7684;&#x70ED;&#x6C34;&#xFF0C;&#x8FD8;&#x7ED9;&#x6211;&#x6CE1;&#x4E86;&#x4E00;&#x676F;&#x54C8;&#x8428;&#x514B;&#x5976;&#x8336;&#xFF08;&#x653E;&#x4E86;&#x4E9B;&#x8BB8;&#x7684;&#x9165;&#x6CB9;&#xFF09;&#xFF0C;&#x6211;&#x53C8;&#x5728;&#x5C4B;&#x5185;&#x7684;&#x706B;&#x7089;&#x65C1;&#x70E4;&#x4E86;&#x4E00;&#x4F1A;&#x8863;&#x7269;&#x3002;&#x7089;&#x65C1;&#x8FB9;&#x8737;&#x7F29;&#x8FD9;&#x773C;&#x775B;&#x7279;&#x522B;&#x8FF7;&#x79BB;&#x53EF;&#x7231;&#x7684;&#x6CE2;&#x65AF;&#x732B;&#xFF0C;&#x5979;&#x65C1;&#x8FB9;&#x8FD8;&#x4F9D;&#x504E;&#x7740;&#x4E24;&#x53EA;&#x55F7;&#x55F7;&#x5F85;&#x54FA;&#x7684;&#x5C0F;&#x732B;&#x3002;&#x540E;&#x6765;&#x5728;&#x5FEB;&#x8D70;&#x5230;&#x5580;&#x7EB3;&#x65AF;&#x666F;&#x533A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5728;&#x4E00;&#x7247;&#x6EC2;&#x6CB1;&#x5927;&#x96E8;&#x4E2D;&#xFF0C;&#x666F;&#x533A;&#x7BA1;&#x7406;&#x8D8A;&#x91CE;&#x8F66;&#xFF08;&#x8F66;&#x4E0A;&#x5370;&#x7740;&#x68EE;&#x6797;&#x9632;&#x706B;&#xFF0C;&#x7740;&#x5B9E;&#x88AB;&#x6B3A;&#x9A97;&#x4E86;&#xFF09;&#x9A71;&#x8F66;&#x8FFD;&#x4E86;&#x4E00;&#x516C;&#x91CC;&#x902E;&#x6355;&#x6211;&#xFF0C;&#x8BA9;&#x6211;&#x8865;&#x95E8;&#x7968;&#xFF0C;&#x9003;&#x7968;&#x8BA1;&#x5212;&#x4EE5;&#x5931;&#x8D25;&#x800C;&#x544A;&#x7EC8;&#x3002;&#x8FD8;&#x597D;&#xFF0C;&#x5FEB;&#x8D70;&#x5230;&#x7EC8;&#x70B9;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5929;&#x6C14;&#x653E;&#x6674;&#xFF0C;&#x6C90;&#x6D74;&#x7740;&#x867D;&#x6CA1;&#x6709;&#x5B8C;&#x5168;&#x76DB;&#x5F00;&#x5374;&#x53C8;&#x5982;&#x5723;&#x5149;&#x822C;&#x6E29;&#x6696;&#x7684;&#x9633;&#x5149;&#x4E2D;&#xFF0C;&#x5F53;&#x65F6;&#x89C9;&#x7740;&#x6D3B;&#x7740;&#x771F;&#x597D;&#x3002;</p>
<p>&#x5728;&#x5F92;&#x6B65;&#x7684;&#x5927;&#x540E;&#x534A;&#x6BB5;&#xFF0C;&#x5728;&#x4E91;&#x96FE;&#x7F2D;&#x7ED5;&#x7684;&#x96E8;&#x4E2D;&#xFF0C;&#x6211;&#x7684;&#x524D;&#x65B9;&#x7EC8;&#x4E8E;&#x51FA;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x540C;&#x662F;&#x5F92;&#x6B65;&#x62AB;&#x7740;&#x96E8;&#x8863;&#x5F90;&#x5F90;&#x524D;&#x884C;&#x7684;&#x4EBA;&#x3002;&#x540C;&#x884C;&#x7684;&#x662F;&#x4F4D;&#x65B0;&#x7586;&#x5927;&#x59D0;&#xFF0C;&#x8BB0;&#x5F97;&#x4E94;&#x5341;&#x6765;&#x5C81;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x8001;&#x9A74;&#x3002;&#x5979;&#x544A;&#x8BC9;&#x6211;&#x65E9;&#x4E0A;&#x672C;&#x6765;&#x7EA6;&#x597D;&#x4E00;&#x5806;&#x4EBA;&#x51FA;&#x53D1;&#xFF0C;&#x540E;&#x6765;&#x4E0B;&#x96E8;&#x5C31;&#x53EA;&#x5269;&#x4E0B;&#x5979;&#x4E00;&#x4E2A;&#x4E86;&#xFF08;&#x540E;&#x6765;&#x8FD9;&#x4E9B;&#x5C0F;&#x4F19;&#x4F34;&#x5728;&#x5580;&#x7EB3;&#x65AF;&#x7684;&#x65F6;&#x5019;&#x53C8;&#x9047;&#x5230;&#x4E86;&#xFF0C;&#x4ED6;&#x4EEC;&#x8D70;&#x9519;&#x4E86;&#x8DEF;&#xFF09;&#x3002;&#x6211;&#x548C;&#x5927;&#x59D0;&#x4E24;&#x4E2A;&#x4EBA;&#x8FB9;&#x8D70;&#x8FB9;&#x804A;&#xFF0C;&#x671F;&#x95F4;&#x5979;&#x544A;&#x8BC9;&#x6211;&#xFF1A;&#x300E;&#x65C5;&#x884C;&#x7684;&#x4EBA;&#x5927;&#x4F53;&#x5206;&#x4E24;&#x79CD;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x4EAB;&#x53D7;&#x7684;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x6298;&#x817E;&#x7684;&#x3002;&#x4EAB;&#x53D7;&#x7684;&#x4EBA;&#x89C9;&#x5F97;&#x65C5;&#x884C;&#x5C31;&#x662F;&#x7528;&#x6765;&#x653E;&#x677E;&#x4EAB;&#x53D7;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x9047;&#x5230;&#x4E0B;&#x96E8;&#x5929;&#xFF0C;&#x9700;&#x8981;&#x53D7;&#x5F88;&#x5927;&#x7F6A;&#xFF0C;&#x4ED6;&#x4EEC;&#x662F;&#x4E0D;&#x613F;&#x610F;&#x51FA;&#x6765;&#x884C;&#x8D70;&#x7684;&#xFF0C;&#x89C9;&#x5F97;&#x4E0D;&#x5982;&#x5750;&#x8F66;&#x4F11;&#x95F2;&#x5B89;&#x9038;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x7C7B;&#x4EBA;&#x521A;&#x597D;&#x76F8;&#x53CD;&#xFF0C;&#x7231;&#x6298;&#x817E;&#xFF0C;&#x8D8A;&#x662F;&#x96E8;&#x5929;&#x8D8A;&#x559C;&#x6B22;&#x884C;&#x8D70;&#xFF0C;&#x8D8A;&#x559C;&#x6B22;&#x8D70;&#x522B;&#x4EBA;&#x4E0D;&#x8D70;&#x7684;&#x8DEF;&#xFF0C;&#x8FD9;&#x6837;&#x5B50;&#x867D;&#x7136;&#x5F88;&#x7D2F;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5B8C;&#x5168;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x98CE;&#x666F;&#x300F;&#x3002;&#x6211;&#x544A;&#x8BC9;&#x5927;&#x59D0;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x662F;&#x540E;&#x4E00;&#x79CD;&#x4EBA;&#x3002;&#x5F53;&#x6211;&#x8D70;&#x5230;&#x5580;&#x7EB3;&#x65AF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6D51;&#x8EAB;&#x6E7F;&#x900F;&#xFF0C;&#x6781;&#x5176;&#x75B2;&#x60EB;&#xFF0C;&#x6D17;&#x5B8C;&#x70ED;&#x6C34;&#x6FA1;&#x8EBA;&#x5728;&#x5E8A;&#x4E0A;&#x5DF2;&#x7ECF;&#x57FA;&#x672C;&#x762B;&#x75EA;&#x3002;&#x56E0;&#x4E3A;&#x96E8;&#x4E0B;&#x7684;&#x5F88;&#x5927;&#xFF0C;&#x6240;&#x4EE5;&#x76F8;&#x673A;&#x57FA;&#x672C;&#x90FD;&#x653E;&#x5728;&#x5305;&#x91CC;&#xFF0C;&#x6CA1;&#x6709;&#x62FF;&#x51FA;&#x6765;&#x62CD;&#x6444;&#xFF0C;&#x6240;&#x4EE5;&#x90A3;&#x65F6;&#x7684;&#x6211;&#x644A;&#x5728;&#x5E8A;&#x4E0A;&#x770B;&#x4E0D;&#x4E86;&#x76F8;&#x7247;&#xFF0C;&#x65E0;&#x4E8B;&#x53EF;&#x505A;&#xFF0C;&#x5C31;&#x987A;&#x7740;&#x5927;&#x59D0;&#x7684;&#x8BDD;&#x601D;&#x8003;&#x4E86;&#x8D77;&#x6765;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x6298;&#x817E;&#x4EBA;&#x683C;&#x7684;&#x4EBA;&#x65C5;&#x884C;&#x6700;&#x5927;&#x7684;&#x610F;&#x4E49;&#x5E76;&#x4E0D;&#x5728;&#x4E8E;&#x6700;&#x540E;&#x770B;&#x5230;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x98CE;&#x666F;&#xFF0C;&#x800C;&#x5728;&#x4E8E;&#x90A3;&#x79CD;&#x72EC;&#x4E00;&#x65E0;&#x4E8C;&#x7684;&#x7ECF;&#x5386;&#x548C;&#x611F;&#x53D7;&#x3002;&#x56E0;&#x4E3A;&#x8FC7;&#x4E86;N&#x5E74;&#x540E;&#xFF0C;&#x5F53;&#x4F60;&#x548C;&#x670B;&#x53CB;&#x8BF4;&#x8D77;&#x5F53;&#x65F6;&#x7684;&#x98CE;&#x666F;&#xFF0C;&#x53EF;&#x80FD;&#x4E09;&#x8A00;&#x4E24;&#x53E5;&#x5C31;&#x53EF;&#x4EE5;&#x8BF4;&#x5B8C;&#xFF0C;&#x5E76;&#x6982;&#x62EC;&#x4E3A;&#x7279;&#x522B;&#x7F8E;&#xFF0C;&#x4F46;&#x7ECF;&#x5386;&#x5374;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x65A4;&#x9152;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x8BB2;&#x8FF0;&#x3002;&#x90A3;&#x79CD;&#x7ECF;&#x5386;&#x4E86;&#x5343;&#x4E07;&#x56F0;&#x96BE;&#xFF0C;&#x90A3;&#x79CD;&#x5230;&#x8FBE;&#x7EC8;&#x70B9;&#x65F6;&#x7684;&#x559C;&#x60A6;&#x548C;&#x6210;&#x5C31;&#x611F;&#xFF0C;&#x90A3;&#x79CD;&#x5B64;&#x72EC;&#x5BC2;&#x5BDE;&#x62C5;&#x5FC3;&#x5374;&#x53C8;&#x575A;&#x6301;&#x7684;&#x611F;&#x53D7;&#xFF0C;&#x8FD9;&#x4E9B;&#x624D;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x72EC;&#x4E00;&#x65E0;&#x4E8C;&#x548C;&#x9A84;&#x50B2;&#x7684;&#x3002;</p>
<h2 id="&#x7237;&#x7237;&#x751F;&#x75C5;">&#x7237;&#x7237;&#x751F;&#x75C5;</h2>
<p>&#x7237;&#x7237;&#x662F;11&#x6708;14&#x53F7;&#x7684;&#x65F6;&#x5019;&#x7A81;&#x53D1;&#x8111;&#x6897;&#x4F4F;&#x9662;&#x7684;&#xFF0C;&#x7B97;&#x4E0A;&#x4ECA;&#x5929;&#x5DF2;&#x7ECF;&#x4F4F;&#x9662;48&#x5929;&#x3002;</p>
<p>&#x7237;&#x7237;&#x751F;&#x75C5;&#x7684;&#x90A3;&#x5929;&#x591C;&#x91CC;&#xFF0C;&#x4E8C;&#x7237;&#x7ED9;&#x6211;&#x7535;&#x8BDD;&#x544A;&#x8BC9;&#x6211;&#x7237;&#x7237;&#x7A81;&#x7136;&#x751F;&#x75C5;&#x4F4F;&#x9662;&#x3002;&#x5F53;&#x65F6;&#x6211;&#x6B63;&#x5728;&#x5357;&#x5B81;&#xFF0C;&#x53D6;&#x6D88;&#x4E86;&#x540E;&#x7EED;&#x7684;&#x65C5;&#x884C;&#x8BA1;&#x5212;&#xFF0C;&#x7ACB;&#x523B;&#x98DE;&#x56DE;&#x5357;&#x4EAC;&#x770B;&#x7237;&#x7237;&#x3002;&#x7237;&#x7237;&#x7684;&#x8111;&#x6897;&#x662F;&#x7531;&#x5FC3;&#x810F;&#x623F;&#x98A4;&#x548C;&#x9AD8;&#x8840;&#x538B;&#x7B49;&#x56E0;&#x7D20;&#x7EFC;&#x5408;&#x5F15;&#x8D77;&#xFF0C;&#x6240;&#x4EE5;&#x8111;&#x90E8;&#x4E2D;&#x98CE;&#x8303;&#x56F4;&#x6BD4;&#x8F83;&#x5E7F;&#x3002;&#x4ED6;&#x73B0;&#x5728;&#x534A;&#x8FB9;&#x762B;&#x75EA;&#xFF0C;&#x8A00;&#x8BED;&#x8BA4;&#x77E5;&#x529F;&#x80FD;&#x4E5F;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x4ECE;&#x56DE;&#x5230;&#x5357;&#x4EAC;&#x5F00;&#x59CB;&#xFF0C;&#x8FD9;&#x4E00;&#x4E2A;&#x591A;&#x6708;&#x6211;&#x57FA;&#x672C;&#x6BCF;&#x5929;&#x90FD;&#x5728;&#x7167;&#x987E;&#x7237;&#x7237;&#x3002;&#x56E0;&#x4E3A;&#x521A;&#x597D;&#x6211;&#x73B0;&#x5728;&#x6CA1;&#x6709;&#x5DE5;&#x4F5C;&#xFF0C;&#x65F6;&#x95F4;&#x5BF9;&#x7684;&#x4E0A;&#xFF0C;&#x800C;&#x4E14;&#x7237;&#x7237;&#x4F53;&#x91CD;&#x4E5F;&#x8F83;&#x91CD;&#xFF0C;&#x9700;&#x8981;&#x5E74;&#x8F7B;&#x4EBA;&#x529B;&#x6765;&#x8FDB;&#x884C;&#x7FFB;&#x62AC;&#x3002;&#x800C;&#x4E14;&#x6211;&#x662F;&#x7237;&#x7237;&#x5976;&#x5976;&#x517B;&#x80B2;&#x5927;&#x7684;&#xFF0C;&#x517B;&#x80B2;&#x4E4B;&#x6069;&#x65E0;&#x4EE5;&#x4E3A;&#x62A5;&#x3002;&#x4E5F;&#x662F;&#x4ECE;&#x7167;&#x987E;&#x7237;&#x7237;&#x5F00;&#x59CB;&#x6211;&#x624D;&#x77E5;&#x9053;&#x62A4;&#x7406;&#x5DE5;&#x4F5C;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x662F;&#x505A;&#x7684;&#x597D;&#x7684;&#x7EC6;&#x81F4;&#x7684;&#x62A4;&#x7406;&#x5DE5;&#x4F5C;&#x662F;&#x591A;&#x4E48;&#x7684;&#x4E0D;&#x5BB9;&#x6613;&#x3002;&#x6211;&#x4E5F;&#x57FA;&#x672C;&#x4E0A;&#x4ECE;&#x4E00;&#x4E2A;&#x62A4;&#x7406;&#x95E8;&#x5916;&#x6C49;&#x5347;&#x7EA7;&#x4E3A;&#x4E00;&#x4E2A;&#x804C;&#x4E1A;&#x62A4;&#x5DE5;&#x3002;</p>
<p>&#x770B;&#x62A4;&#x7237;&#x7237;&#x6BD4;&#x8F83;&#x56F0;&#x96BE;&#x7684;&#x5730;&#x65B9;&#x4E00;&#x4E2A;&#x5728;&#x4E8E;&#x4ED6;&#x884C;&#x52A8;&#x4E0D;&#x4FBF;&#xFF0C;&#x9700;&#x8981;&#x7ECF;&#x5E38;&#x6400;&#x6276;&#xFF0C;&#x5305;&#x62EC;&#x89E3;&#x51B3;&#x5404;&#x79CD;&#x4E2A;&#x4EBA;&#x9700;&#x6C42;&#x95EE;&#x9898;&#x90FD;&#x76F8;&#x5BF9;&#x9EBB;&#x70E6;&#x3002;&#x4E8C;&#x4E2A;&#x5728;&#x4E8E;&#x7237;&#x7237;&#x8BA4;&#x77E5;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x4ED6;&#x8BF4;&#x7684;&#x8BDD;&#x6211;&#x4EEC;&#x542C;&#x4E0D;&#x61C2;&#xFF0C;&#x6211;&#x4EEC;&#x8BF4;&#x7684;&#x4ED6;&#x4E5F;&#x542C;&#x4E0D;&#x61C2;&#x3002;&#x4E09;&#x4E2A;&#x5728;&#x4E8E;&#x60C5;&#x7EEA;&#x6709;&#x65F6;&#x5019;&#x4F1A;&#x7A81;&#x53D8;&#xFF0C;&#x6309;&#x7167;&#x5976;&#x5976;&#x8BDD;&#x8BF4;&#xFF0C;&#x7237;&#x7237;&#x73B0;&#x5728;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x8001;&#x5C0F;&#x5B69;&#x3002;&#x5982;&#x679C;&#x4ED6;&#x4E0D;&#x8212;&#x670D;&#x4E86;&#xFF0C;&#x591C;&#x91CC;&#x5C31;&#x4F1A;&#x5927;&#x58F0;&#x53EB;&#x5524;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x591C;&#x91CC;&#x7761;&#x4E0D;&#x7740;&#x5C31;&#x4F1A;&#x8BF4;&#x8BDD;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x63A7;&#x5236;&#xFF0C;&#x53EA;&#x80FD;&#x60F3;&#x529E;&#x6CD5;&#x5B89;&#x629A;&#x4ED6;&#x3002;&#x56DB;&#x4E2A;&#x5728;&#x4E8E;&#x541E;&#x54BD;&#x95EE;&#x9898;&#xFF0C;&#x5403;&#x996D;&#x9700;&#x8981;&#x6253;&#x6210;&#x7CCA;&#x72B6;&#x518D;&#x5582;&#xFF0C;&#x5582;&#x6C34;&#x4E5F;&#x9700;&#x8981;&#x7279;&#x522B;&#x5C0F;&#x5FC3;&#x4E0D;&#x80FD;&#x545B;&#x5230;&#x3002;&#x6240;&#x4EE5;&#x62A4;&#x7406;&#x7237;&#x7237;&#x771F;&#x662F;&#x4E00;&#x4EF6;&#x7CFB;&#x7EDF;&#x548C;&#x7EFC;&#x5408;&#x6027;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5BB9;&#x4E0D;&#x5F97;&#x534A;&#x70B9;&#x9A6C;&#x864E;&#x3002;&#x867D;&#x6709;&#x5F88;&#x591A;&#x56F0;&#x96BE;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4E00;&#x76F4;&#x559C;&#x6B22;&#x4E00;&#x53E5;&#x8BDD;&#xFF1A;&#x300E;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x4E00;&#x5B9A;&#x6BD4;&#x56F0;&#x96BE;&#x591A;&#x300F;&#x3002;</p>
<p>&#x7237;&#x7237;&#x867D;&#x7136;&#x8BA4;&#x77E5;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x53D1;&#x73B0;&#x4ED6;&#x53EF;&#x4EE5;&#x611F;&#x53D7;&#x5230;&#x60C5;&#x7EEA;&#xFF0C;&#x4E5F;&#x5B58;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x5408;&#x4E4E;&#x903B;&#x8F91;&#x7684;&#x80A2;&#x4F53;&#x52A8;&#x4F5C;&#x3002;&#x4E3A;&#x6B64;&#x6211;&#x52A0;&#x4EE5;&#x603B;&#x7ED3;&#xFF0C;&#x5199;&#x4E86;&#x4E00;&#x4EFD;&#x7167;&#x987E;&#x7237;&#x7237;&#x7684;&#x6307;&#x5BFC;&#x7ECF;&#x9A8C;&#x5B88;&#x5219;&#xFF0C;&#x7136;&#x540E;&#x6253;&#x5370;&#x51FA;&#x6765;&#x7ED9;&#x65B0;&#x6765;&#x7684;&#x62A4;&#x5DE5;&#x5E08;&#x5085;&#x770B;&#xFF0C;&#x4ED6;&#x4E00;&#x4E0B;&#x5B50;&#x5C31;&#x53EF;&#x4EE5;&#x5F88;&#x5FEB;&#x4E0A;&#x624B;&#x3002;&#x540E;&#x6765;&#x5C31;&#x5F00;&#x59CB;&#x7422;&#x78E8;&#x5982;&#x4F55;&#x5B89;&#x629A;&#x7237;&#x7237;&#x7684;&#x60C5;&#x7EEA;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x6709;&#x6548;&#x7684;&#x5582;&#x98DF;&#x3002;&#x5728;&#x4F4F;&#x5230;&#x5EB7;&#x590D;&#x79D1;&#x6700;&#x5F00;&#x59CB;&#x7684;&#x51E0;&#x5929;&#xFF0C;&#x6BCF;&#x5929;&#x533B;&#x751F;&#x548C;&#x62A4;&#x58EB;&#x90FD;&#x6765;&#x95EE;&#x6211;&#x8981;&#x4E0D;&#x8981;&#x7ED9;&#x7237;&#x7237;&#x63D2;&#x80C3;&#x7BA1;&#xFF0C;&#x76F4;&#x63A5;&#x5C06;&#x5403;&#x7684;&#x4E1C;&#x897F;&#x6253;&#x5230;&#x80C3;&#x91CC;&#x3002;&#x671F;&#x95F4;&#x6211;&#x5185;&#x5FC3;&#x4E5F;&#x6709;&#x6240;&#x52A8;&#x6447;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x6BCF;&#x5929;&#x5582;&#x98DF;&#x7237;&#x7237;&#x9700;&#x8981;&#x82B1;&#x8D39;5&#x5230;6&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;&#x5373;&#x4F7F;&#x8FD9;&#x6837;&#x5B50;&#x5DE5;&#x4F5C;&#x91CF;&#xFF0C;&#x4E5F;&#x8FD8;&#x662F;&#x6709;&#x65F6;&#x5019;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x533B;&#x751F;&#x8981;&#x6C42;&#x7684;&#x5582;&#x98DF;&#x91CF;&#x3002;&#x5403;&#x7684;&#x66F4;&#x4E0D;&#x4E0A;&#xFF0C;&#x8425;&#x517B;&#x4E5F;&#x5C31;&#x8DDF;&#x4E0D;&#x4E0A;&#xFF0C;&#x4E5F;&#x65E0;&#x4ECE;&#x8C08;&#x8D77;&#x5EB7;&#x590D;&#x8BAD;&#x7EC3;&#x6548;&#x679C;&#x3002;&#x4F46;&#x6253;&#x80C3;&#x7BA1;&#x786E;&#x5B9E;&#x975E;&#x5E38;&#x96BE;&#x53D7;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x76F4;&#x4E0D;&#x60F3;&#x8BA9;&#x4ED6;&#x53D7;&#x8FD9;&#x4E2A;&#x7F6A;&#xFF0C;&#x6240;&#x4EE5;&#x6BCF;&#x6B21;&#x6211;&#x90FD;&#x662F;&#x7F13;&#x5175;&#x4E4B;&#x8BA1;&#xFF0C;&#x8BA9;&#x533B;&#x751F;&#x518D;&#x591A;&#x7ED9;&#x6211;&#x4EEC;&#x70B9;&#x65F6;&#x95F4;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x529E;&#x6CD5;&#x5C06;&#x5582;&#x98DF;&#x8DDF;&#x4E0A;&#x3002;&#x4E3A;&#x6B64;&#x6211;&#x6709;&#x5929;&#x665A;&#x4E0A;&#x60F3;&#x4E86;&#x5F88;&#x4E45;&#xFF0C;&#x7ED3;&#x5408;&#x76EE;&#x524D;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5236;&#x5B9A;&#x4E86;&#x4E00;&#x4E2A;&#x5582;&#x98DF;&#x5177;&#x4F53;&#x6267;&#x884C;&#x65B9;&#x6848;&#xFF0C;&#x53D1;&#x73B0;&#x8FD8;&#x633A;&#x6709;&#x6548;&#xFF0C;&#x4ECE;&#x6B64;&#x4E4B;&#x540E;&#x5582;&#x98DF;&#x95EE;&#x9898;&#x5C31;&#x5F00;&#x59CB;&#x9010;&#x6B65;&#x89E3;&#x51B3;&#x3002;&#x73B0;&#x5728;&#x7237;&#x7237;&#x5DF2;&#x7ECF;&#x53EF;&#x4EE5;&#x5403;&#x7684;&#x975E;&#x5E38;&#x9EBB;&#x6E9C;&#xFF0C;&#x5403;&#x7684;&#x4E0D;&#x4EC5;&#x5FEB;&#x800C;&#x4E14;&#x591A;&#xFF0C;&#x771F;&#x662F;&#x8BA9;&#x4EBA;&#x5F00;&#x5FC3;&#x4E0D;&#x5DF2;&#x3002;</p>
<p>&#x5199;&#x8FD9;&#x4E9B;&#x6587;&#x6863;&#x548C;&#x6267;&#x884C;&#x65B9;&#x6848;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8BA9;&#x6211;&#x60F3;&#x8D77;&#x4E86;&#x6211;&#x7684;&#x7814;&#x7A76;&#x751F;&#x5BFC;&#x5E08;&#x3002;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x4ED6;&#x603B;&#x662F;&#x4F1A;&#x4E0D;&#x538C;&#x5176;&#x70E6;&#x751A;&#x81F3;&#x8BA9;&#x4EBA;&#x6709;&#x4E9B;&#x96BE;&#x53D7;&#x7684;&#x65B9;&#x5F0F;&#x903C;&#x8FEB;&#x4F60;&#x53BB;&#x5199;&#x6587;&#x6863;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x5199;&#x5404;&#x79CD;&#x6587;&#x6863;&#x3002;&#x73B0;&#x5728;&#x770B;&#x6765;&#x90A3;&#x4F1A;&#x88AB;&#x8001;&#x5E08;&#x903C;&#x51FA;&#x6765;&#x7684;&#x4E60;&#x60EF;&#x7279;&#x522B;&#x53D7;&#x7528;&#xFF0C;&#x5199;&#x51FA;&#x6765;&#x5C31;&#x662F;&#x91CD;&#x65B0;&#x7684;&#x52A0;&#x5DE5;&#x548C;&#x6574;&#x7406;&#xFF0C;&#x800C;&#x4E14;&#x4E5F;&#x624D;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#x66F4;&#x52A0;&#x7EC6;&#x81F4;&#x7684;&#x7EC6;&#x8282;&#x548C;&#x95EE;&#x9898;&#xFF0C;&#x624D;&#x53EF;&#x4EE5;&#x6162;&#x6162;&#x6784;&#x6210;&#x300C;&#x5DE5;&#x4E1A;&#x7EA7;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x300D;&#x3002;&#x6700;&#x540E;&#x8FD9;&#x4E2A;&#x662F;&#x9ED1;&#x9ED1;&#x6211;&#x7684;&#x5BFC;&#x5E08;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x603B;&#x662F;&#x8981;&#x6C42;&#x6211;&#x4EEC;&#x5199;&#x51FA;&#x6765;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x5DE5;&#x4E1A;&#x7EA7;&#xFF0C;&#x4F5C;&#x4E3A;&#x5B66;&#x751F;&#x7684;&#x6211;&#x4EEC;&#x5F53;&#x7136;&#x8FBE;&#x4E0D;&#x5230;&#x4E86;&#x3002;&#x4E0D;&#x8FC7;&#x8FD8;&#x662F;&#x8C22;&#x8C22;&#x8001;&#x5E08;&#x5F53;&#x65F6;&#x7684;&#x4E0D;&#x538C;&#x5176;&#x70E6;&#xFF0C;&#x8BA9;&#x6211;&#x53D8;&#x5F97;&#x5BF9;&#x7EC6;&#x8282;&#x6709;&#x8FD1;&#x4E4E;&#x6781;&#x81F4;&#x7684;&#x8FFD;&#x6C42;&#x3002;&#x8FD9;&#x8BA9;&#x6211;&#x60F3;&#x8D77;&#x4E86;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x60F3;&#x6765;&#x5F88;&#x662F;&#x53D7;&#x7528;&#xFF1A;</p>
<blockquote>
<p>&#x4E0D;&#x81EA;&#x5F8B;&#x7684;&#x4EBA;&#x6C38;&#x8FDC;&#x4E0D;&#x77E5;&#x9053;&#x7CBE;&#x795E;&#x6298;&#x78E8;&#x80CC;&#x540E;&#x7684;&#x6210;&#x5C31;&#x611F;&#xFF0C;&#x5C31;&#x5982;&#x540C;&#x4F3C;&#x662F;&#x800C;&#x975E;&#x7684;&#x4EBA;&#x6C38;&#x8FDC;&#x4E0D;&#x77E5;&#x9053;&#x4E8B;&#x65E0;&#x5DE8;&#x7EC6;&#x7684;&#x91CD;&#x8981;&#x6027;&#x4E00;&#x6837;&#x3002;</p>
</blockquote>
<p>&#x770B;&#x62A4;&#x7237;&#x7237;&#x7684;&#x65F6;&#x5019;&#x6211;&#x54ED;&#x8FC7;&#x4E24;&#x6B21;&#x3002;&#x7B2C;&#x4E00;&#x6B21;&#x662F;&#x521A;&#x4E0B;&#x98DE;&#x673A;&#x53BB;&#x533B;&#x9662;&#x770B;&#x5230;&#x7237;&#x7237;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F53;&#x65F6;&#x4ED6;&#x770B;&#x5230;&#x6211;&#xFF0C;&#x8BF4;&#x4E86;&#x4E00;&#x53E5;&#x300E;&#x8FD9;&#x662F;&#x8C01;&#x554A;&#xFF1F;&#x300F;&#xFF0C;&#x5C31;&#x626D;&#x5934;&#x7761;&#x4E86;&#x8FC7;&#x53BB;&#xFF0C;&#x5E76;&#x8BA9;&#x6211;&#x8D70;&#x5F00;&#x3002;&#x5F53;&#x65F6;&#x6211;&#x5C31;&#x6CA1;&#x6709;&#x5FCD;&#x4F4F;&#x6CEA;&#x6C34;&#xFF0C;&#x59D1;&#x59D1;&#x4E5F;&#x5728;&#x65C1;&#x8FB9;&#xFF0C;&#x4ED6;&#x544A;&#x8BC9;&#x6211;&#x56DE;&#x5BB6;&#x4E0D;&#x8981;&#x544A;&#x8BC9;&#x5976;&#x5976;&#x3002;&#x7B2C;&#x4E8C;&#x6B21;&#x662F;&#x6211;&#x548C;&#x5976;&#x5976;&#x5728;&#x75C5;&#x623F;&#x7167;&#x987E;&#x7237;&#x7237;&#x65F6;&#xFF0C;&#x6211;&#x8BF4;&#x7B11;&#x7684;&#x548C;&#x4ED6;&#x8BF4;&#x4E86;&#x4E00;&#x53E5;&#x300E;&#x7237;&#x7237;&#xFF0C;&#x4F60;&#x8981;&#x597D;&#x597D;&#x52A0;&#x6CB9;&#xFF0C;&#x4F60;&#x8FD8;&#x6CA1;&#x770B;&#x5230;&#x4F60;&#x5B59;&#x5AB3;&#x5987;&#x5462;&#x300F;&#xFF0C;&#x5F53;&#x65F6;&#x672C;&#x6765;&#x662F;&#x8BF4;&#x7B11;&#x8BDD;&#x7684;&#x6211;&#xFF0C;&#x4E00;&#x4E0B;&#x5B50;&#x6CA1;&#x6709;&#x5FCD;&#x4F4F;&#xFF0C;&#x8F6C;&#x8FC7;&#x8EAB;&#x64E6;&#x62ED;&#x4E86;&#x4E0B;&#x6CEA;&#x6C34;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x60F3;&#x7ED9;&#x5976;&#x5976;&#x770B;&#x5230;&#x3002;&#x7237;&#x7237;&#x517B;&#x80B2;&#x6211;&#x771F;&#x7684;&#x5F88;&#x4E0D;&#x5BB9;&#x6613;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x6211;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x7279;&#x522B;&#x4E0D;&#x5B5D;&#x987A;&#xFF0C;&#x5E94;&#x8BE5;&#x65E9;&#x4E00;&#x70B9;&#x6210;&#x5BB6;&#xFF0C;&#x8FD9;&#x6837;&#x5B50;&#x53EF;&#x4EE5;&#x8BA9;&#x4ED6;&#x8001;&#x4EBA;&#x5BB6;&#x770B;&#x5230;&#x5B59;&#x5AB3;&#x5987;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6211;&#x7684;&#x5A5A;&#x793C;&#xFF0C;&#x4ED6;&#x4E00;&#x5B9A;&#x4F1A;&#x7279;&#x522B;&#x9AD8;&#x5174;&#x3002;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x518D;&#x4E5F;&#x6CA1;&#x6709;&#x54ED;&#x8FC7;&#xFF0C;&#x56E0;&#x4E3A;&#x7237;&#x7237;&#x4ED6;&#x53EF;&#x4EE5;&#x611F;&#x77E5;&#x5230;&#x60C5;&#x7EEA;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x8BBA;&#x5982;&#x4F55;&#x6BCF;&#x6B21;&#x770B;&#x5230;&#x4ED6;&#x90FD;&#x9762;&#x5E26;&#x7B11;&#x5BB9;&#x3002;</p>
<p>&#x4E4B;&#x524D;&#x6211;&#x5C31;&#x6709;&#x6BCF;&#x5929;&#x5199;&#x65E5;&#x5FD7;&#x7684;&#x4E60;&#x60EF;&#xFF0C;&#x540E;&#x6765;&#x7167;&#x987E;&#x7237;&#x7237;&#x65F6;&#x5019;&#x53D1;&#x73B0;&#x6BCF;&#x5929;&#x5199;&#x7684;&#x5185;&#x5BB9;&#x57FA;&#x672C;&#x90FD;&#x662F;&#x7167;&#x987E;&#x7237;&#x7237;&#x7684;&#x4E8B;&#x60C5;&#x4EE5;&#x53CA;&#x5728;&#x533B;&#x9662;&#x751F;&#x6D3B;&#x7684;&#x6240;&#x601D;&#x6240;&#x60F3;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x7D22;&#x6027;&#x4E0D;&#x5199;&#x79C1;&#x4EBA;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4E5F;&#x5C06;&#x65E5;&#x8BB0;&#x653E;&#x5230;blog&#x4E2D;&#x3002;&#x8FD9;&#x4E9B;&#x5929;&#x65E5;&#x8BB0;&#x4E2D;&#x65AD;&#x4E00;&#x4E9B;&#xFF0C;&#x4E00;&#x662F;&#x786E;&#x5B9E;&#x6BCF;&#x5929;&#x56DE;&#x5BB6;&#x4E4B;&#x540E;&#x7279;&#x522B;&#x7D2F;&#x6709;&#x65F6;&#x5019;&#x76F4;&#x63A5;&#x7761;&#x4E86;&#x5C31;&#x5FD8;&#x8BB0;&#x5199;&#x4E86;&#xFF0C;&#x4E8C;&#x662F;&#x540E;&#x6765;&#x6BCF;&#x5929;&#x65E5;&#x5E38;&#x4E8B;&#x60C5;&#x56FA;&#x5B9A;&#x5316;&#x540E;&#xFF0C;&#x7279;&#x522B;&#x9700;&#x8981;&#x8BB0;&#x5F55;&#x7684;&#x4E8B;&#x60C5;&#x4E0D;&#x591A;&#x4E86;&#xFF0C;&#x4E5F;&#x5C31;&#x6CA1;&#x529E;&#x6CD5;&#x6574;&#x7406;&#x6210;&#x4E00;&#x4EFD;&#x6587;&#x7AE0;&#x3002;&#x4E0D;&#x8FC7;&#x6211;&#x8FD8;&#x662F;&#x4F1A;&#x62BD;&#x7A7A;&#x591A;&#x8BB0;&#x5F55;&#xFF0C;&#x591A;&#x62CD;&#x7167;&#x7237;&#x7237;&#x7684;&#x65E5;&#x5E38;&#x751F;&#x6D3B;&#xFF0C;&#x4E5F;&#x8BB8;&#x4E0D;&#x80FD;&#x6BCF;&#x5929;&#x90FD;&#x53D1;&#xFF0C;&#x4F46;&#x662F;&#x4F1A;&#x5C06;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x7684;&#x5185;&#x5BB9;&#x8FDB;&#x884C;&#x6574;&#x7406;&#x6574;&#x5408;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x60F3;&#x7740;&#x4EE5;&#x540E;&#x7237;&#x7237;&#x8981;&#x662F;&#x8BA4;&#x77E5;&#x6062;&#x590D;&#x4E86;&#xFF0C;&#x770B;&#x7740;&#x5F53;&#x65F6;&#x751F;&#x75C5;&#x65F6;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4E00;&#x5B9A;&#x4F1A;&#x89C9;&#x5F97;&#x975E;&#x5E38;&#x6709;&#x8DA3;&#x3002;&#x8FD9;&#x4E00;&#x5929;&#x4E00;&#x5B9A;&#x4F1A;&#x5230;&#x6765;&#xFF0C;&#x4E00;&#x5B9A;&#x3002;<a href="/tags/%E6%97%A5%E8%AE%B0/">&#x7167;&#x987E;&#x7237;&#x7237;&#x65E5;&#x5E38;&#x65E5;&#x8BB0;</a></p>
<h2 id="wrap">wrap</h2>
<ul>
<li>&#x65F6;&#x95F4;&#x4E0A;&#x662F;&#x53D8;&#x8001;&#x4E86;&#x4E00;&#x5C81;&#xFF0C;&#x4F46;&#x6211;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x5FC3;&#x6001;&#x4E0A;&#x53D8;&#x8001;&#x4E86;&#x597D;&#x51E0;&#x5C81;&#xFF0C;&#x8FD9;&#x4E5F;&#x8BB8;&#x5C31;&#x662F;&#x589E;&#x52A0;&#x4E86;&#x751F;&#x547D;&#x7684;&#x539A;&#x5EA6;&#x3002;</li>
<li>&#x4E5F;&#x662F;&#x8FD9;&#x4E00;&#x5E74;&#xFF0C;&#x8BA9;&#x6211;&#x81EA;&#x5DF1;&#x771F;&#x7684;&#x611F;&#x89C9;&#x5230;&#x300C;&#x4E8B;&#x4E8B;&#x5982;&#x4E91;&#x4EFB;&#x5377;&#x8212;&#x300D;&#xFF0C;&#x4E16;&#x4E8B;&#x65E0;&#x5E38;&#xFF0C;&#x73CD;&#x60DC;&#x4E00;&#x5207;&#xFF0C;&#x611F;&#x6069;&#x4E00;&#x5207;&#x3002;</li>
<li>&#x6709;&#x65F6;&#x5019;&#x751F;&#x6D3B;&#x771F;&#x7684;&#x5F88;&#x4E0D;&#x5BB9;&#x6613;&#xFF0C;&#x4F46;&#x4E5F;&#x4E00;&#x5B9A;&#x4F1A;&#x6709;&#x4F60;&#x613F;&#x610F;&#x4E3A;&#x4E4B;&#x594B;&#x6597;&#x7684;&#x52A8;&#x529B;&#x548C;&#x7F18;&#x7531;&#xFF0C;&#x4E5F;&#x7EC8;&#x4F1A;&#x6709;&#x6240;&#x5F97;&#x3002;</li>
<li>&#x5E0C;&#x671B;&#x65B0;&#x7684;&#x4E00;&#x5E74;&#xFF0C;&#x7237;&#x7237;&#x53EF;&#x4EE5;&#x5EB7;&#x590D;&#x5230;&#x66F4;&#x597D;&#x7684;&#x6C34;&#x5E73;&#x3002;&#x795D;&#x798F;&#x5BB6;&#x4EBA;&#x548C;&#x81EA;&#x5DF1;&#x90FD;&#x5E73;&#x5E73;&#x5B89;&#x5B89;&#x3002;</li>
</ul>

      
    </div>

    
      

  <div class="popular-posts-header">相关文章</div>
  <ul class="popular-posts">
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2018/04/09/summary/summary-take-care-of-grandpa/" rel="bookmark">照顾爷爷的这120天</a></div>
      
    </li>
  
  </ul>


    

    
    
    

    

    

    
      <div>
        <ul class="post-copyright">
  <li class="post-copyright-author">
    <strong>本文作者： </strong>whiledoing</li>
  <li class="post-copyright-link">
    <strong>本文链接：</strong>
    <a href="http://whiledoing.me/2018/01/01/summary-2017/" title="关于2017">http://whiledoing.me/2018/01/01/summary-2017/</a>
  </li>
  <li class="post-copyright-license">
    <strong>版权声明： </strong>本博客所有文章除特别声明外，均采用 <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/" rel="external nofollow" target="_blank">CC BY-NC-SA 4.0</a> 许可协议。转载请注明出处！</li>
</ul>

      </div>
    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/总结/" rel="tag"># 总结</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2018/01/01/diary/diary-2017-12-30-SAT/" rel="next" title="diary-2017-12-30-SAT">
                <i class="fa fa-chevron-left"></i> diary-2017-12-30-SAT
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2018/01/04/diary/diary-2018-01-04-THU/" rel="prev" title="diary-2018-01-04-THU">
                diary-2018-01-04-THU <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


  </div>


          </div>
          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <img class="site-author-image" itemprop="image"
                src="/images/avatar.jpeg"
                alt="whiledoing" />
            
              <p class="site-author-name" itemprop="name">whiledoing</p>
              <p class="site-description motion-element" itemprop="description">喜欢一切简单且美的事物，包括人。</p>
          </div>

          
            <nav class="site-state motion-element">
              
                <div class="site-state-item site-state-posts">
                
                  <a href="/archives/">
                
                    <span class="site-state-item-count">60</span>
                    <span class="site-state-item-name">日志</span>
                  </a>
                </div>
              

              

              
                
                
                <div class="site-state-item site-state-tags">
                  <a href="/tags/index.html">
                    
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                    <span class="site-state-item-count">32</span>
                    <span class="site-state-item-name">标签</span>
                  </a>
                </div>
              
            </nav>
          

          

          
            <div class="links-of-author motion-element">
              
                <span class="links-of-author-item">
                  <a href="https://github.com/whiledoing" target="_blank" title="GitHub">GitHub</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="http://www.douban.com/people/58249409" target="_blank" title="豆瓣">豆瓣</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="https://www.zhihu.com/people/whiledoing" target="_blank" title="知乎">知乎</a>
                  
                </span>
              
            </div>
          

          
          

          
          

          
            
          
          

        </div>
      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#母亲生病"><span class="nav-number">1.</span> <span class="nav-text">母亲生病</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#辞职gap"><span class="nav-number">2.</span> <span class="nav-text">辞职GAP</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#爷爷生病"><span class="nav-number">3.</span> <span class="nav-text">爷爷生病</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#wrap"><span class="nav-number">4.</span> <span class="nav-text">wrap</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; 2016 – <span itemprop="copyrightYear">2018</span>
  <span class="with-love" id="animate">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">whiledoing</span>

  

  
</div>




  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动 v3.7.1</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 – <a class="theme-link" target="_blank" href="https://theme-next.org">NexT.Mist</a> v6.4.0</div>




        








        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

    
      <div id="needsharebutton-float">
        <span class="btn">
          <i class="fa fa-share-alt" aria-hidden="true"></i>
        </span>
      </div>
    
	
    

    
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>
























  



  
  
    <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/reading_progress/reading_progress.js"></script>
  


  


  <script type="text/javascript" src="/js/src/utils.js?v=6.4.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=6.4.0"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=6.4.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=6.4.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=6.4.0"></script>



  



  










  





  

  

  
<script>
(function(){
    var bp = document.createElement('script');
    var curProtocol = window.location.protocol.split(':')[0];
    if (curProtocol === 'https') {
        bp.src = 'https://zz.bdstatic.com/linksubmit/push.js';        
    }
    else {
        bp.src = 'http://push.zhanzhang.baidu.com/push.js';
    }
    var s = document.getElementsByTagName("script")[0];
    s.parentNode.insertBefore(bp, s);
})();
</script>


  
  

  
  

  


  
  
  
  <script src="/lib/needsharebutton/needsharebutton.js"></script>

  <script>
    
    
      flOptions = {};
      
          flOptions.iconStyle = "box";
      
          flOptions.boxForm = "vertical";
      
          flOptions.position = "middleRight";
      
          flOptions.networks = "Weibo,Wechat,Douban,QQZone,Twitter,Facebook";
      
      new needShareButton('#needsharebutton-float', flOptions);
    
  </script>

  

  
  
  
  <script src="/lib/pangu/dist/pangu.min.js?v=3.3"></script>
  <script type="text/javascript">pangu.spacingPage();</script>


  
  <script type="text/javascript" src="/js/src/js.cookie.js?v=6.4.0"></script>
  <script type="text/javascript" src="/js/src/scroll-cookie.js?v=6.4.0"></script>


  

  

  
  <style>
    .copy-btn {
      display: inline-block;
      padding: 6px 12px;
      font-size: 13px;
      font-weight: 700;
      line-height: 20px;
      color: #333;
      white-space: nowrap;
      vertical-align: middle;
      cursor: pointer;
      background-color: #eee;
      background-image: linear-gradient(#fcfcfc, #eee);
      border: 1px solid #d5d5d5;
      border-radius: 3px;
      user-select: none;
      outline: 0;
    }

    .highlight-wrap .copy-btn {
      transition: opacity .3s ease-in-out;
      opacity: 0;
      padding: 2px 6px;
      position: absolute;
      right: 4px;
      top: 8px;
    }

    .highlight-wrap:hover .copy-btn,
    .highlight-wrap .copy-btn:focus {
      opacity: 1
    }

    .highlight-wrap {
      position: relative;
    }
  </style>
  <script>
    $('.highlight').each(function (i, e) {
      var $wrap = $('<div>').addClass('highlight-wrap')
      $(e).after($wrap)
      $wrap.append($('<button>').addClass('copy-btn').append('复制').on('click', function (e) {
        var code = $(this).parent().find('.code').find('.line').map(function (i, e) {
          return $(e).text()
        }).toArray().join('\n')
        var ta = document.createElement('textarea')
        document.body.appendChild(ta)
        ta.style.position = 'absolute'
        ta.style.top = '0px'
        ta.style.left = '0px'
        ta.value = code
        ta.select()
        ta.focus()
        var result = document.execCommand('copy')
        document.body.removeChild(ta)
        
        $(this).blur()
      })).on('mouseleave', function (e) {
        var $b = $(this).find('.copy-btn')
        setTimeout(function () {
          $b.text('复制')
        }, 300)
      }).append(e)
    })
  </script>


</body>
</html>
