<!DOCTYPE html>












  


<html class="theme-next mist use-motion" lang="zh-CN">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=2"/>
<meta name="theme-color" content="#222">






  
  
    
    
  <script src="/lib/pace/pace.min.js?v=1.0.2"></script>
  <link href="/lib/pace/pace-theme-minimal.min.css?v=1.0.2" rel="stylesheet">




  
  
  <link rel="stylesheet" media="all" href="/lib/Han/dist/han.min.css?v=3.3">




<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />






















<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=6.4.2" rel="stylesheet" type="text/css" />


  <link rel="apple-touch-icon" sizes="180x180" href="/images/favicon.png?v=6.4.2">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon.png?v=6.4.2">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon.png?v=6.4.2">


  <link rel="mask-icon" href="/images/logo.svg?v=6.4.2" color="#222">









<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    version: '6.4.2',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":false,"onmobile":false},
    fancybox: false,
    fastclick: false,
    lazyload: false,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>


  




  <meta name="description" content="这是我学习人月神话的学习笔记。 人月神话的英文是《Man-Month Mythical》（人月其实是软件工程管理工程量的单位，一个人每月工作量的含义），本书也主要是说明单纯使用人月方式估算大型项目是不靠谱的，只是一个神话的估算方式而已，并由此开始阐述如何去构建大型复杂的系统。">
<meta name="keywords" content="读书笔记,软件工程">
<meta property="og:type" content="article">
<meta property="og:title" content="《人月神话》读书笔记">
<meta property="og:url" content="http://whiledoing.me/2016/03/21/the-mythical-man-month-learn-note-md/index.html">
<meta property="og:site_name" content="whiledoing">
<meta property="og:description" content="这是我学习人月神话的学习笔记。 人月神话的英文是《Man-Month Mythical》（人月其实是软件工程管理工程量的单位，一个人每月工作量的含义），本书也主要是说明单纯使用人月方式估算大型项目是不靠谱的，只是一个神话的估算方式而已，并由此开始阐述如何去构建大型复杂的系统。">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2018-04-17T13:29:52.944Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="《人月神话》读书笔记">
<meta name="twitter:description" content="这是我学习人月神话的学习笔记。 人月神话的英文是《Man-Month Mythical》（人月其实是软件工程管理工程量的单位，一个人每月工作量的含义），本书也主要是说明单纯使用人月方式估算大型项目是不靠谱的，只是一个神话的估算方式而已，并由此开始阐述如何去构建大型复杂的系统。">






  <link rel="canonical" href="http://whiledoing.me/2016/03/21/the-mythical-man-month-learn-note-md/"/>



<script type="text/javascript" id="page.configurations">
  CONFIG.page = {
    sidebar: "",
  };
</script>

  <title>《人月神话》读书笔记 | whiledoing</title>
  




<script async src="https://www.googletagmanager.com/gtag/js?id=UA-117714040-1"></script>
<script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'UA-117714040-1');
</script>



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "https://hm.baidu.com/hm.js?6de2920425778ca5a4ee717be5055e96";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>




  <noscript>
  <style type="text/css">
    .use-motion .motion-element,
    .use-motion .brand,
    .use-motion .menu-item,
    .sidebar-inner,
    .use-motion .post-block,
    .use-motion .pagination,
    .use-motion .comments,
    .use-motion .post-header,
    .use-motion .post-body,
    .use-motion .collection-title { opacity: initial; }

    .use-motion .logo,
    .use-motion .site-title,
    .use-motion .site-subtitle {
      opacity: initial;
      top: initial;
    }

    .use-motion {
      .logo-line-before i { left: initial; }
      .logo-line-after i { right: initial; }
    }
  </style>
</noscript>

</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-CN">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">whiledoing</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
    
      
        <p class="site-subtitle">喜欢一切简单且美的事物，包括人。</p>
      
    
  </div>

  <div class="site-nav-toggle">
    <button aria-label="切换导航栏">
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>



<nav class="site-nav">
  
    <ul id="menu" class="menu">
      
        
        
        
          
          <li class="menu-item menu-item-home">
    <a href="/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-home"></i> <br />首页</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-about">
    <a href="/about/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-user"></i> <br />关于</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-tags">
    <a href="/tags/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />标签</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-archives">
    <a href="/archives/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />归档</a>
  </li>

      
      
    </ul>
  

  
    

  

  
</nav>



  



</div>
    </header>

    


    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  
    <div class="reading-progress-bar"></div>
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://whiledoing.me/2016/03/21/the-mythical-man-month-learn-note-md/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="whiledoing">
      <meta itemprop="description" content="喜欢一切简单且美的事物，包括人。">
      <meta itemprop="image" content="/images/avatar.jpeg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="whiledoing">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">《人月神话》读书笔记
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">

            
            
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              

              
                
              

              <time title="创建时间：2016-03-21 10:20:39" itemprop="dateCreated datePublished" datetime="2016-03-21T10:20:39+08:00">2016-03-21</time>
            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body han-init-context" itemprop="articleBody">

      
      

      
        <p>&#x8FD9;&#x662F;&#x6211;&#x5B66;&#x4E60;<a href="https://www.douban.com/tag/%E8%BD%AF%E4%BB%B6%E5%B7%A5%E7%A8%8B/?focus=book" target="_blank" rel="noopener">&#x4EBA;&#x6708;&#x795E;&#x8BDD;</a>&#x7684;&#x5B66;&#x4E60;&#x7B14;&#x8BB0;&#x3002;</p>
<p>&#x4EBA;&#x6708;&#x795E;&#x8BDD;&#x7684;&#x82F1;&#x6587;&#x662F;&#x300A;Man-Month Mythical&#x300B;&#xFF08;&#x4EBA;&#x6708;&#x5176;&#x5B9E;&#x662F;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x7BA1;&#x7406;&#x5DE5;&#x7A0B;&#x91CF;&#x7684;&#x5355;&#x4F4D;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x6BCF;&#x6708;&#x5DE5;&#x4F5C;&#x91CF;&#x7684;&#x542B;&#x4E49;&#xFF09;&#xFF0C;&#x672C;&#x4E66;&#x4E5F;&#x4E3B;&#x8981;&#x662F;&#x8BF4;&#x660E;<strong>&#x5355;&#x7EAF;&#x4F7F;&#x7528;&#x4EBA;&#x6708;</strong>&#x65B9;&#x5F0F;&#x4F30;&#x7B97;<strong>&#x5927;&#x578B;&#x9879;&#x76EE;</strong>&#x662F;&#x4E0D;&#x9760;&#x8C31;&#x7684;&#xFF0C;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x795E;&#x8BDD;&#x7684;&#x4F30;&#x7B97;&#x65B9;&#x5F0F;&#x800C;&#x5DF2;&#xFF0C;&#x5E76;&#x7531;&#x6B64;&#x5F00;&#x59CB;&#x9610;&#x8FF0;&#x5982;&#x4F55;&#x53BB;&#x6784;&#x5EFA;&#x5927;&#x578B;&#x590D;&#x6742;&#x7684;&#x7CFB;&#x7EDF;&#x3002;</p>
<a id="more"></a>
<blockquote>
<p>&#x6211;&#x4EEC;&#x9762;&#x4E34;&#x7684;&#x6311;&#x6218;&#x548C;&#x4EFB;&#x52A1;&#x662F;&#x5728;&#x5B9E;&#x9645;&#x7684;&#x8FDB;&#x5EA6;&#x548C;&#x6709;&#x6548;&#x7684;&#x8D44;&#x6E90;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x5BFB;&#x627E;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x5207;&#x5B9E;&#x53EF;&#x884C;&#x65B9;&#x6848;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x5728;&#x4F17;&#x591A;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x7F3A;&#x4E4F;&#x5408;&#x7406;&#x7684;&#x8FDB;&#x5EA6;&#x5B89;&#x6392;&#x662F;&#x9020;&#x6210;&#x9879;&#x76EE;&#x6EDE;&#x540E;&#x7684;&#x6700;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#xFF0C;&#x5B83;&#x6BD4;&#x5176;&#x4ED6;&#x6240;&#x6709;&#x56E0;&#x7D20;&#x52A0;&#x8D77;&#x6765;&#x7684;&#x5F71;&#x54CD;&#x8FD8;&#x8981;&#x5927;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x70B9;&#x6DF1;&#x6709;&#x611F;&#x89E6;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;PM&#x5B58;&#x5728;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x5982;&#x679C;&#x9879;&#x76EE;&#x7F3A;&#x4E4F;&#x89C4;&#x5212;&#x540E;&#x679C;&#x4E00;&#x5B9A;&#x662F;&#x5931;&#x8D25;&#x7684;&#xFF0C;&#x5176;&#x5B9E;&#x505A;&#x4EBA;&#x505A;&#x4E8B;&#x4E0D;&#x662F;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x7684;&#x561B;&#xFF1F;</p>
<blockquote>
<p>&#x6240;&#x6709;&#x7684;&#x7F16;&#x7A0B;&#x4EBA;&#x5458;&#x90FD;&#x662F;&#x4E50;&#x89C2;&#x4E3B;&#x4E49;&#x8005;</p>
</blockquote>
<p>sign&#x2026; &#x4E0D;&#x8981;&#x5C06;&#x81EA;&#x5DF1;&#x9677;&#x5165;&#x5230;&#x81EA;&#x4FE1;&#x548C;&#x6C38;&#x4E45;&#x505A;&#x4E0D;&#x5B8C;&#x4EFB;&#x52A1;&#x7684;&#x6CE5;&#x6F6D;&#x4E2D; :&#xFF09;</p>
<p>&#x6700;&#x91CD;&#x8981;&#x662F;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4F30;&#x7B97;&#x90FD;&#x662F;&#x7406;&#x60F3;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x65B9;&#x6848;&#x641E;&#x5B9A;&#x4E4B;&#x540E;&#xFF0C;&#x5927;&#x6982;&#x53EA;&#x5B8C;&#x6210;&#x4E86;50%&#xFF0C;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x7684;&#x95EE;&#x9898;&#x548C;&#x51B3;&#x7B56;&#x53EF;&#x80FD;&#x8FD8;&#x8981;&#x5230;&#x6267;&#x884C;&#x5C42;&#x9762;&#x53BB;&#x7EE7;&#x7EED;&#x601D;&#x8003;&#x548C;&#x89E3;&#x51B3;&#xFF08;&#x4E2A;&#x4EBA;&#x611F;&#x53D7;&#xFF09;</p>
<blockquote>
<p>&#x4F7F;&#x7528;&#x4EBA;&#x6708;&#x53EF;&#x4EE5;&#x7CBE;&#x786E;&#x8BA1;&#x7B97;&#x7684;&#x60C5;&#x51B5;&#x662F;&#xFF1A;&#x4EBA;&#x6570;&#x548C;&#x65F6;&#x95F4;&#x53EF;&#x4EE5;&#x4E92;&#x6362;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x4EFB;&#x52A1;&#x90FD;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x7684;&#x5206;&#x89E3;&#x3002;</p>
</blockquote>
<p>&#x4F46;&#x5728;&#x5B9E;&#x9645;&#x7684;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x51E0;&#x4E4E;&#x662F;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x2026;oops&#x2026;</p>
<blockquote>
<p>Brooks&#x6CD5;&#x5219;&#xFF1A;&#x5411;&#x8FDB;&#x5EA6;&#x843D;&#x540E;&#x7684;&#x9879;&#x76EE;&#x589E;&#x52A0;&#x4EBA;&#x624B;&#xFF0C;&#x53EA;&#x4F1A;&#x4F7F;&#x8FDB;&#x5EA6;&#x66F4;&#x52A0;&#x843D;&#x540E;&#x3002;</p>
</blockquote>
<p>&#x4F5C;&#x8005;&#x7684;&#x903B;&#x8F91;&#x70B9;&#x5728;&#x4E8E;&#xFF0C;&#x7CBE;&#x5EA6;&#x843D;&#x540E; -&gt; &#x589E;&#x52A0;&#x4EBA;&#x624B; -&gt; &#x65B0;&#x4EBA;&#x4E0A;&#x624B;&#x9700;&#x8981;&#x65F6;&#x95F4;&#x548C;&#x522B;&#x4EBA;&#x6559;&#x7684;&#x65F6;&#x95F4; -&gt; &#x53CD;&#x800C;&#x5F97;&#x4E0D;&#x507F;&#x5931;&#x3002;</p>
<blockquote>
<p>&#x5916;&#x79D1;&#x624B;&#x672F;&#x961F;&#x4F0D;&#xFF1A; &#x5C0F;&#x578B;&#x9879;&#x76EE;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#xFF0C;&#x5C0F;&#x800C;&#x7CBE;&#x608D;&#x7684;&#x4EBA;&#x5458;&#x6784;&#x6210;&#x7684;&#x56E2;&#x961F;&#x3002;&#x8FD9;&#x6837;&#x5B50;&#x7684;&#x6548;&#x7387;&#x662F;&#x9AD8;&#x7684;&#x3002;&#x4F46;&#x662F;&#x4E0D;&#x9002;&#x7528;&#x4E8E;&#x5927;&#x578B;&#x9879;&#x76EE;&#xFF0C;&#x56E0;&#x4E3A;&#x5BF9;&#x4E8E;&#x5927;&#x578B;&#x9879;&#x76EE;&#x800C;&#x8A00;&#xFF0C;&#x4EBA;&#x6570;&#x592A;&#x5C11;&#x4E00;&#x5B9A;&#x662F;&#x6162;&#x7684;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x4E3A;&#x4E86;&#x5E73;&#x8861;&#x597D;&#x6548;&#x7387;&#x548C;&#x6982;&#x5FF5;&#x5B8C;&#x6574;&#x6027;&#xFF0C;&#x6700;&#x597D;&#x662F;&#x7531;&#x5C11;&#x6570;&#x5E72;&#x7EC3;&#x7684;&#x4EBA;&#x5458;&#x6765;&#x8BBE;&#x8BA1;&#x548C;&#x5F00;&#x53D1;&#x3002;</p>
</blockquote>
<p>&#x5728;&#x8FD9;&#x672C;&#x4E66;&#x4E2D;&#x591A;&#x6B21;&#x63D0;&#x5230;&#x4E86;<strong>&#x6982;&#x5FF5;&#x5B8C;&#x6574;&#x6027;</strong>&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x7ED3;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x9879;&#x76EE;&#x5F00;&#x53D1;&#x7ECF;&#x9A8C;&#xFF0C;&#x8FD9;&#x70B9;&#x786E;&#x5B9E;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;&#x5C24;&#x5176;&#x662F;&#x4E00;&#x4E9B;&#x5E95;&#x5C42;&#x67B6;&#x6784;&#x7684;&#x8BBE;&#x8BA1;&#x548C;&#x6784;&#x601D;&#x4E0A;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x7ED3;&#x8BBA;&#x548C;&#x65B9;&#x6848;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5927;&#x5BB6;&#x5404;&#x81EA;&#x641E;&#x6210;&#x4E00;&#x5957;&#xFF0C;&#x4E5F;&#x8BB8;&#x8FD9;&#x4E2A;&#x8BBE;&#x8BA1;&#x4E0A;&#x5B58;&#x5728;&#x95EE;&#x9898;&#x6216;&#x8005;&#x4E0D;&#x5B8C;&#x6574;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4F46;&#x662F;&#x53EF;&#x4EE5;&#x8C03;&#x6574;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x53EF;&#x4EE5;&#x8FDD;&#x80CC;&#x8BBE;&#x8BA1;&#x7684;&#x521D;&#x8877;&#xFF0C;&#x5426;&#x5219;&#x6574;&#x7406;&#x7684;&#x6982;&#x5FF5;&#x5B8C;&#x6574;&#x6027;&#x5C31;&#x88AB;&#x7834;&#x574F;&#x4E86;&#xFF0C;&#x8FD9;&#x5728;&#x9879;&#x76EE;&#x540E;&#x671F;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x7528;&#x66F4;&#x591A;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x6765;&#x4FEE;&#x590D;&#x56E0;&#x4E3A;&#x8BBE;&#x8BA1;&#x8FED;&#x4EE3;&#x6240;&#x5BFC;&#x81F4;&#x7684;&#x7EA7;&#x8054;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#x8BF4;&#x56DE;&#x6765;&#xFF0C;&#x8FD9;&#x786E;&#x5B9E;&#x662F;&#x7ECF;&#x9A8C;&#x6D3B;&#xFF0C;&#x5728;&#x5F00;&#x59CB;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x8003;&#x8651;&#x5230;&#x9700;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x9884;&#x7559;&#x9700;&#x8981;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x90FD;&#x662F;&#x5BF9;&#x6574;&#x4E2A;&#x4E1A;&#x52A1;&#x4F53;&#x7CFB;&#x6709;&#x6DF1;&#x523B;&#x4E86;&#x89E3;&#x7684;&#x4EBA; &#xFF1A;&#xFF09;</p>
<blockquote>
<p>System 360 &#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x81F4;&#x5B8C;&#x6574;&#x6027;&#x4EC5;&#x6765;&#x81EA;&#x4E8E;&#x4E24;&#x540D;&#x4F5C;&#x8005;&#xFF0C;&#x601D;&#x8DEF;&#x662F;&#x591A;&#x4E2A;&#x4EBA;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x4F46;&#x662F;&#x6700;&#x7EC8;&#x5F62;&#x6210;&#x89C4;&#x5B9A;&#x548C;&#x6587;&#x5B57;&#x8BF4;&#x660E;&#x7684;&#x53EA;&#x6709;&#x4E24;&#x4E2A;&#x4EBA;&#x51B3;&#x5B9A;&#x3002;&#x4F8B;&#x5982;&#xFF0C;System 360&#x9700;&#x8981;&#x51B3;&#x5B9A;&#x5728;&#x6BCF;&#x6B21;&#x64CD;&#x4F5C;&#x4E4B;&#x540E;&#xFF0C;&#x5982;&#x4F55;&#x8BBE;&#x7F6E;&#x8FD4;&#x56DE;&#x7684;&#x6761;&#x4EF6;&#x7801;&#x3002;&#x770B;&#x4F3C;&#x8FD9;&#x79CD;&#x7410;&#x788E;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x5176;&#x5B9E;&#x5BF9;&#x4E8E;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x4E9B;&#x7410;&#x788E;&#x95EE;&#x9898;&#x5904;&#x7406;&#x4E0A;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x7EDD;&#x5BF9;&#x4E0D;&#x662F;&#x4E00;&#x4EF6;&#x65E0;&#x5173;&#x7D27;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#xFF01;</p>
</blockquote>
<p>&#x7B80;&#x5355;&#x8BF4;&#x662F;&#x7EC6;&#x8282;&#x51B3;&#x5B9A;&#x6210;&#x8D25;&#xFF0C;&#x5927;&#x4E86;&#x8BF4;&#xFF0C;&#x6240;&#x6709;&#x4F18;&#x79C0;&#x7684;&#x8BBE;&#x8BA1;&#x548C;&#x5927;&#x578B;&#x9879;&#x76EE;&#x7684;&#x6784;&#x5EFA;&#x90FD;&#x662F;&#x5177;&#x6709;&#x7EDD;&#x5BF9;&#x7684;&#x89C4;&#x5F8B;&#x548C;&#x81EA;&#x5F8B;&#x7684;&#xFF09;</p>
<blockquote>
<p>&#x53E4;&#x8001;&#x7684;&#x683C;&#x8A00;&#xFF1A;&#x201C;&#x4E0D;&#x8981;&#x643A;&#x5E26;&#x4E24;&#x4E2A;&#x65F6;&#x949F;&#x51FA;&#x6D77;&#xFF0C;&#x5E26;&#x4E00;&#x4E2A;&#x6216;&#x8005;&#x4E09;&#x4E2A;&#x201D;</p>
</blockquote>
<p>&#x8981;&#x4E48;&#x6CA1;&#x6709;&#x60F3;&#x6CD5;&#xFF0C;&#x8981;&#x4E48;&#x5C31;&#x6709;&#x5907;&#x4EFD;&#x7684;&#x60F3;&#x6CD5;&#x3002;</p>
<blockquote>
<p>&#x7CBE;&#x6E5B;&#x7684;&#x6280;&#x827A;&#x51FA;&#x81EA;&#x521B;&#x9020;&#xFF0C;&#x7CBE;&#x70BC;&#xFF0C;&#x5145;&#x5206;&#x548C;&#x5FEB;&#x901F;&#xFF0C;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;&#x6280;&#x827A;&#x6539;&#x8FDB;&#x7684;&#x7ED3;&#x679C;&#x5F80;&#x5F80;&#x662F;&#x6218;&#x7565;&#x4E0A;&#x7684;&#x7A81;&#x7834;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x6280;&#x5DE7;&#x4E0A;&#x7684;&#x63D0;&#x9AD8;&#x3002;&#x66F4;&#x666E;&#x904D;&#x7684;&#x60C5;&#x51B5;&#x662F;&#xFF0C;&#x6218;&#x7565;&#x4E0A;&#x7684;&#x7A81;&#x7834;&#x5E38;&#x6765;&#x81EA;&#x4E8E;&#x6570;&#x636E;&#x6216;&#x8868;&#x7684;&#x91CD;&#x65B0;&#x8868;&#x8FBE;&#xFF0C;&#x8FD9;&#x662F;&#x7A0B;&#x5E8F;&#x7684;&#x6838;&#x5FC3;&#x6240;&#x5728;&#xFF08;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E3A;&#x738B;&#xFF0C;&#x6570;&#x636E;&#x4E3A;&#x738B;&#x5440;&#xFF01;&#xFF01;&#xFF01;&#xFF09;&#x3002;&#x5982;&#x679C;&#x63D0;&#x4F9B;&#x4E86;&#x7A0B;&#x5E8F;&#x6D41;&#x7A0B;&#x56FE;&#xFF0C;&#x800C;&#x6CA1;&#x6709;&#x8868;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x4ECD;&#x7136;&#x4F1A;&#x5F88;&#x8FF7;&#x60D1;&#x3002;&#x800C;&#x7ED9;&#x6211;&#x770B;&#x8868;&#x6570;&#x636E;&#xFF0C;&#x5F80;&#x5F80;&#x4E0D;&#x7528;&#x518D;&#x770B;&#x6D41;&#x7A0B;&#x56FE;&#xFF0C;&#x7A0B;&#x5E8F;&#x7684;&#x7ED3;&#x6784;&#x662F;&#x975E;&#x5E38;&#x6E05;&#x6670;&#x7684;&#x3002;</p>
</blockquote>
<p>&#x6DF1;&#x6709;&#x611F;&#x609F;&#xFF0C;&#x7ED3;&#x6784;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x7B97;&#x6CD5;&#x7684;&#x8BBE;&#x8BA1;&#x90FD;&#x662F;&#x4E3A;&#x4E86;&#x6570;&#x636E;&#x670D;&#x52A1;&#x7684;&#xFF0C;&#x6709;&#x4E86;&#x6570;&#x636E;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x95EE;&#x9898;&#x90FD;&#x4F1A;&#x53D8;&#x5F97;&#x660E;&#x4E86;&#x3002;&#x540C;&#x7406;&#xFF0C;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x7684;&#x4E0D;&#x597D;&#xFF0C;&#x5F88;&#x5927;&#x7A0B;&#x5E8F;&#x4E0A;&#x56E0;&#x4E3A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x8BBE;&#x8BA1;&#x7684;&#x4E0D;&#x597D;&#x3002;&#x8FD9;&#x4E5F;&#x8BF4;&#x660E;&#x5728;&#x8BBE;&#x8BA1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x8BBE;&#x8BA1;&#x9700;&#x8981;<strong>&#x7ED9;&#x4E88;&#x5145;&#x5206;&#x7684;&#x65F6;&#x95F4;&#x4EE5;&#x53CA;&#x914D;&#x5BF9;&#x7684;&#x6587;&#x6863;&#x63CF;&#x8FF0;</strong>&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x540E;&#x671F;&#x7684;&#x7EF4;&#x62A4;&#x548C;&#x5F00;&#x53D1;&#x90FD;&#x662F;&#x5927;&#x6709;&#x88E8;&#x76CA;&#x7684;&#x3002;&#x539F;&#x8C05;&#x6211;&#x505A;&#x4E3A;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x7AEF;&#x7A0B;&#x5E8F;&#x7684;&#x300C;&#x4E2A;&#x4EBA;&#x504F;&#x89C1;&#x300D;&#x8BA4;&#x8BC6;&#x3002;&#x3002;</p>
<blockquote>
<p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x6570;&#x636E;&#x7684;&#x8868;&#x73B0;&#x5F62;&#x5F0F;&#x662F;&#x7F16;&#x7A0B;&#x7684;&#x6839;&#x672C;&#x3002;</p>
</blockquote>
<p>&#x597D;&#x5427;&#xFF0C;&#x76F4;&#x63A5;&#x4E0A;&#x5347;&#x5230;&#x672C;&#x8D28;&#x7684;&#x5C42;&#x6B21;&#x4E86;&#x2026;oops</p>
<blockquote>
<p>&#x7A0B;&#x5E8F;&#x7EF4;&#x62A4;&#x7684;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x95EE;&#x9898;&#xFF1A;&#x7F3A;&#x9677;&#x4FEE;&#x590D;&#x603B;&#x662F;&#x4F1A;&#x4EE5;&#x56FA;&#x5B9A;&#xFF08;20%-50%&#xFF09;&#x7684;&#x51E0;&#x7387;&#x5F15;&#x5165;&#x65B0;&#x7684;bug&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x662F;&#x524D;&#x8FDB;&#x4E24;&#x6B65;&#x7136;&#x540E;&#x540E;&#x9000;&#x4E00;&#x6B65;&#x3002;</p>
</blockquote>
<p>&#x4FEE;&#x590D;bug&#x7684;&#x71B5;&#x3002;</p>
<blockquote>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x7F3A;&#x9677;&#x4E0D;&#x80FD;&#x66F4;&#x5F7B;&#x5E95;&#x7684;&#x4FEE;&#x590D;&#xFF1F;&#x9996;&#x5148;&#xFF0C;&#x770B;&#x4E0A;&#x53BB;&#x5F88;&#x5C0F;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x4F3C;&#x4E4E;&#x662F;&#x5C40;&#x90E8;&#x64CD;&#x4F5C;&#x7684;&#x5931;&#x8D25;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x5374;&#x662F;&#x7CFB;&#x7EDF;&#x7EA7;&#x522B;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4F55;&#x51B5;&#x540E;&#x671F;&#x5F00;&#x53D1;&#x7684;&#x4EBA;&#x5458;&#x4E0D;&#x662F;&#x6700;&#x521D;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x4E9B;&#x521D;&#x7EA7;&#x7A0B;&#x5E8F;&#x6216;&#x8005;&#x65B0;&#x624B;&#xFF0C;&#x4ED6;&#x4EEC;&#x5728;&#x8BBE;&#x8BA1;&#x7684;&#x65F6;&#x5019;&#x5F80;&#x5F80;&#x662F;&#x6CA1;&#x6709;&#x8003;&#x8651;&#x5168;&#x4E4B;&#x524D;&#x7684;&#x8BBE;&#x8BA1;&#x7684;&#xFF0C;&#x5BFC;&#x81F4;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF1A;&#x770B;&#x4F3C;&#x7B80;&#x5355;&#x7684;&#x4EFB;&#x52A1;&#x5374;&#x5BFC;&#x81F4;&#x5F88;&#x591A;&#x7684;bug&#x3002;</p>
</blockquote>
<p>&#x7ED3;&#x5408;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x9879;&#x76EE;&#x540E;&#x671F;&#xFF0C;&#x56E0;&#x4E3A;&#x65F6;&#x95F4;&#x7D27;&#x5F20;&#xFF0C;&#x6211;&#x5C06;&#x76F8;&#x5BF9;&#x4E0D;&#x590D;&#x6742;&#x7684;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x7ED9;&#x4E86;&#x65B0;&#x7684;&#x7684;&#x540C;&#x5B66;&#xFF0C;&#x672C;&#x6765;&#x4EE5;&#x4E3A;&#x662F;&#x4EF6;&#x7B80;&#x5355;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4F46;&#x662F;&#x540E;&#x671F;&#x5374;&#x51FA;&#x73B0;&#x4E86;&#x5F88;&#x591A;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x975E;&#x5E38;&#x4E25;&#x91CD;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x8FD9;&#x70B9;&#x7ED9;&#x6211;&#x7684;&#x53CD;&#x601D;&#x5C31;&#x662F;&#x5373;&#x4F7F;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4E5F;&#x9700;&#x8981;&#x8003;&#x8651;&#x597D;&#x7ED3;&#x6784;&#xFF0C;&#x7136;&#x540E;&#x6307;&#x5BFC;&#x65B0;&#x624B;&#x53BB;&#x5B8C;&#x6210;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x544A;&#x8BC9;&#x4ED6;&#x4EEC;&#x529F;&#x80FD;&#x53BB;&#x5B9E;&#x73B0;&#xFF0C;&#x9700;&#x8981;&#x4F60;&#x53BB;&#x8BBE;&#x8BA1;&#x597D;&#x7ED3;&#x6784;&#xFF0C;&#x7136;&#x540E;&#x8BA9;&#x4ED6;&#x518D;&#x53BB;&#x5B9E;&#x73B0;&#x3002;&#x6BD5;&#x7ADF;&#x540E;&#x671F;&#x52A0;&#x5165;&#x7684;&#x540C;&#x5B66;&#x4E0D;&#x53EF;&#x80FD;&#x4E5F;&#x4E0D;&#x4F1A;&#x6709;&#x65F6;&#x95F4;&#x53BB;&#x638C;&#x63E1;&#x4F60;&#x4E4B;&#x524D;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x4F55;&#x51B5;&#x4E4B;&#x524D;&#x8BBE;&#x8BA1;&#x4E5F;&#x8BB8;&#x4E5F;&#x662F;&#x7CDF;&#x7CD5;&#x7684;&#x6216;&#x8005;&#x662F;&#x6709;&#x5F88;&#x591A;&#x5751;&#x7684;&#xFF0C;&#x518D;&#x5176;&#x4E2D;&#x589E;&#x52A0;&#x4E1C;&#x897F;&#xFF0C;&#x4E0D;&#x662F;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x7684;&#x529F;&#x80FD;&#x5806;&#x79EF;&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x4EA7;&#x751F;&#x8FDE;&#x9501;&#x7684;&#x53CD;&#x5E94;&#x3002;</p>
<blockquote>
<p>&#x6211;&#x4EEC;&#x7684;&#x5927;&#x8111;&#x5177;&#x6709;&#x7684;&#x591A;&#x6837;&#x6027;&#xFF0C;&#x81EA;&#x6211;&#x4FDD;&#x62A4;&#x548C;&#x81EA;&#x6211;&#x66F4;&#x65B0;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x5176;&#x4E2D;&#x7684;&#x79D8;&#x5BC6;&#x5C31;&#x662F;&#x9010;&#x6B65;&#x53D1;&#x80B2;&#x6210;&#x957F;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x6B21;&#x6027;&#x642D;&#x5EFA;&#x3002;&#x5F00;&#x53D1;&#x6A21;&#x5F0F;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x8FED;&#x4EE3;&#x589E;&#x91CF;&#x7684;&#x5F00;&#x53D1;&#xFF0C;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x8FEB;&#x5207;&#x7684;&#x9700;&#x8981;&#x81EA;&#x4E0A;&#x800C;&#x4E0B;&#x7684;&#x5F00;&#x53D1;&#x5F62;&#x6001;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x4E48;&#x4E45;&#x4E4B;&#x524D;&#x5C31;&#x5F00;&#x59CB;&#x63A8;&#x5D07;&#x8FED;&#x4EE3;&#x7684;&#x5F00;&#x53D1;&#x6A21;&#x5F0F;&#x4E86;&#x3002;</p>
<blockquote>
<p>&#x4F46;&#x662F;&#x8F6F;&#x4EF6;&#x6700;&#x91CD;&#x8981;&#x7684;&#x90E8;&#x5206;&#x4E00;&#x5B9A;&#x662F;&#xFF1A;&#x4EBA;&#x3002;&#x5353;&#x8D8A;&#x7684;&#x8BBE;&#x8BA1;&#x8005;&#x548C;&#x4E00;&#x822C;&#x8BBE;&#x8BA1;&#x8005;&#x7684;&#x4EA7;&#x54C1;&#x5DEE;&#x5F02;&#x5DEE;&#x4E86;&#x4E00;&#x4E2A;&#x6570;&#x91CF;&#x7EA7;&#x3002;&#x5353;&#x8D8A;&#x8BBE;&#x8BA1;&#x8005;&#x751F;&#x4EA7;&#x7684;&#x6210;&#x679C;&#x66F4;&#x5FEB;&#xFF0C;&#x66F4;&#x5C0F;&#xFF0C;&#x66F4;&#x7B80;&#x5355;&#xFF0C;&#x66F4;&#x5E72;&#x51C0;&#xFF0C;&#x5B9E;&#x73B0;&#x7684;&#x4EE3;&#x4EF7;&#x66F4;&#x5C11;&#x3002;</p>
</blockquote>
<p>&#x4F18;&#x79C0;&#x5DE5;&#x7A0B;&#x5E08;&#x548C;&#x666E;&#x901A;&#x5DE5;&#x7A0B;&#x5E08;&#x662F;&#x91CF;&#x7EA7;&#x7684;&#x533A;&#x522B;&#x3002;</p>
<blockquote>
<p>There is nothing in the world constant but inconstancy.</p>
</blockquote>
<p>&#x6BD4;&#x5982;&#x8BF4;&#x611F;&#x60C5;&#x3002;&#x3002;&#x3002;</p>
<blockquote>
<p>&#x6211;&#x4EEC;&#x7406;&#x89E3;&#x4E5F;&#x597D;&#xFF0C;&#x4E0D;&#x7406;&#x89E3;&#x4E5F;&#x597D;&#xFF0C;&#x63CF;&#x8FF0;&#x90FD;&#x5E94;&#x8BE5;&#x7B80;&#x77ED;&#x6E05;&#x6670;&#x3002;</p>
</blockquote>
<p>KISS</p>
<blockquote>
<p>&#x5173;&#x4E8E;&#x8FDB;&#x5EA6;&#x5B89;&#x6392;&#xFF0C;&#x6211;&#x7684;&#x7ECF;&#x9A8C;&#x662F;&#xFF1A;1/3 &#x8BA1;&#x5212; 1/6 &#x7F16;&#x7801; 1/4 &#x6784;&#x4EF6;&#x6D4B;&#x8BD5; &#x4EE5;&#x53CA;1/4&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#x3002;</p>
</blockquote>
<p>&#x540C;&#x611F;&#xFF0C;&#x8BA1;&#x5212;&#xFF0C;&#x5199;&#x8BBE;&#x8BA1;&#x6587;&#x6863;&#xFF0C;&#x8BF4;&#x660E;&#x6587;&#x6863;&#xFF0C;&#x9700;&#x8981;&#x7ED9;&#x4E88;&#x8DB3;&#x591F;&#x7684;&#x65F6;&#x95F4;&#xFF01;</p>
<blockquote>
<p>&#x6BCF;&#x4E2A;&#x4EBA;&#x770B;&#x5230;&#x6BCF;&#x4EF6;&#x4E8B;&#x7684;&#x76EE;&#x6807;&#x662F;&#x9519;&#x8BEF;&#x7684;&#xFF01;&#x5404;&#x4E2A;&#x90E8;&#x5206;&#x5E94;&#x8BE5;&#x88AB;&#x5C01;&#x88C5;&#xFF0C;&#x4ECE;&#x800C;&#x6CA1;&#x6709;&#x4EBA;&#x9700;&#x8981;&#x6216;&#x8005;&#x88AB;&#x5141;&#x8BB8;&#x770B;&#x5230;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#x7684;&#x5185;&#x90E8;&#x7ED3;&#x6784;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x63A5;&#x53E3;&#x3002;</p>
</blockquote>
<p>&#x5206;&#x5C42;&#xFF01;&#x4E0D;&#x8981;&#x6307;&#x671B;&#x77E5;&#x9053;&#x6240;&#x6709;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x597D;&#x7684;&#x8BBE;&#x8BA1;&#x5E94;&#x8BE5;&#x662F;&#x4F60;&#x53EA;&#x8981;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x5408;&#x9002;&#x7684;&#x4F4D;&#x7F6E;&#x53BB;&#x505A;&#x5408;&#x9002;&#x7684;&#x4E8B;&#x60C5;&#x5373;&#x53EF;&#x3002;&#x5269;&#x4E0B;&#x7684;&#x4EA4;&#x7ED9;&#x67B6;&#x6784;&#x5E08;&#x8003;&#x8651;&#x5427;&#x3002;&#x5F53;&#x7136;&#x8FD9;&#x4E5F;&#x662F;&#x52AA;&#x529B;&#x7684;&#x76EE;&#x6807;&#x3002;</p>
<blockquote>
<p>&#x80FD;&#x6D88;&#x9664;&#xFF0C;&#x81F3;&#x5C11;&#x662F;&#x80FD;&#x6307;&#x660E;&#x6709;&#x526F;&#x4F5C;&#x7528;&#x7684;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x65B9;&#x6848;&#xFF0C;&#x5BF9;&#x7EF4;&#x62A4;&#x6210;&#x672C;&#x6709;&#x5F88;&#x5927;&#x7684;&#x5F71;&#x54CD;</p>
</blockquote>
<p>&#x4E0D;&#x8981;&#x4F9D;&#x8D56;&#x4E8E;&#x6709;&#x526F;&#x4F5C;&#x7528;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6216;&#x8005;tricky&#x7684;&#x6280;&#x5DE7;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x53EF;&#x80FD;&#x662F;&#x540E;&#x671F;evil&#x7684;&#x6839;&#x6E90;&#x3002;&#x8FD8;&#x662F;KISS&#x3002;</p>
<p>&#x4ECE;&#x5B66;&#x6821;&#x6BD5;&#x4E1A;&#x8FDB;&#x5165;&#x5230;&#x5DE5;&#x4F5C;&#x73AF;&#x5883;&#xFF0C;&#x6216;&#x8005;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x624D;&#x610F;&#x8BC6;&#x5230;&#xFF0C;&#x6E05;&#x6670;&#x662F;&#x591A;&#x4E48;&#x7684;&#x91CD;&#x8981;&#x3002;</p>
<blockquote>
<p>&#x4EBA;&#x5C31;&#x662F;&#x4E00;&#x5207;&#xFF08;&#x6216;&#x8005;&#x8BF4;&#xFF0C;&#x51E0;&#x4E4E;&#x662F;&#x4E00;&#x5207;&#xFF09;&#x3002;&#x6211;&#x4EEC;&#x884C;&#x4E1A;&#x7684;&#x4E3B;&#x8981;&#x95EE;&#x9898;&#x5B9E;&#x8D28;&#x4E0A;&#x66F4;&#x4FA7;&#x91CD;&#x4E8E;&#x793E;&#x4F1A;&#x5B66;&#x800C;&#x4E0D;&#x662F;&#x79D1;&#x5B66;&#x6280;&#x672F;&#x3002;</p>
</blockquote>
<p>&#x9ED1;&#x5BA2;&#x6280;&#x672F;&#x7684;&#x6700;top&#x6280;&#x672F;&#x662F;&#xFF1A;socical hacking&#x2026;</p>
<blockquote>
<p>&#x4E0D;&#x8981;&#x4F4E;&#x4F30;&#x4EA7;&#x54C1;&#x7684;&#x96BE;&#x5EA6;&#xFF0C;&#x96BE;&#x5EA6;&#x4F30;&#x8BA1;&#x7684;&#x9AD8;&#x70B9;&#x603B;&#x662F;&#x6CA1;&#x6709;&#x9519;&#x7684;&#x3002;</p>
</blockquote>
<p>&#x5728;&#x786E;&#x5B9A;&#x4EFB;&#x52A1;&#x8FDB;&#x5EA6;&#x7684;&#x65F6;&#x5019;&#x8981;&#x4E89;&#x53D6;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x8FD9;&#x70B9;&#x6211;&#x5BB9;&#x6613;&#x72AF;&#x4E0B;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x4E0D;&#x8981;&#x4F4E;&#x4F30;&#x4E86;&#x65F6;&#x95F4;&#xFF0C;&#x6309;&#x65F6;&#x6309;&#x91CF;&#x7684;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#x624D;&#x662F;&#x5173;&#x952E;&#xFF0C;&#x4F55;&#x51B5;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x5C31;&#x5E94;&#x8BE5;&#x6709;&#x56FA;&#x6709;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x65F6;&#x95F4;&#x7D27;&#x5F20;&#x4E86;&#xFF0C;&#x4E34;&#x65F6;&#x7684;&#x65B9;&#x6848;&#xFF0C;&#x540E;&#x9762;&#x90FD;&#x662F;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x548C;&#x7CBE;&#x529B;&#x53BB;&#x5F25;&#x8865;&#x7684;&#xFF0C;&#x4E3A;&#x4F55;&#x4E0D;&#x5728;&#x5F00;&#x59CB;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x591A;&#x7559;&#x4E00;&#x4E9B;&#x65F6;&#x95F4;&#xFF0C;&#x8BBE;&#x8BA1;&#x51FA;&#x4E00;&#x4E2A;&#x66F4;&#x52A0;&#x6709;&#x6548;&#xFF0C;&#x7075;&#x6D3B;&#x7684;&#x65B9;&#x6848;&#x5462;&#x3002;&#x7A0B;&#x5E8F;&#x5458;&#x90FD;&#x662F;&#x81EA;&#x4FE1;&#x7684;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FDB;&#x5EA6;&#x4F30;&#x7B97;&#x4E0A;&#x5C24;&#x5176;&#x5982;&#x6B64;&#xFF0C;&#x6240;&#x4EE5;&#x4EE5;&#x540E;&#x81EA;&#x5DF1;&#x9700;&#x8981;&#x66F4;&#x52A0;&#x5408;&#x7406;&#x7684;&#x4F30;&#x7B97;&#x8FDB;&#x5EA6;&#xFF0C;&#x65F6;&#x95F4;&#x4F30;&#x7B97;&#x7684;&#x591A;&#x70B9;&#x603B;&#x662F;&#x6CA1;&#x6709;&#x574F;&#x5904;&#x7684;&#x3002;</p>
<p>&#x5957;&#x7528;&#x4E66;&#x4E2D;&#x7684;&#x4E00;&#x4EFD;&#x6CD5;&#x5F0F;&#x9910;&#x5385;&#x83DC;&#x5355;&#x4E0A;&#x7684;&#x53E5;&#x5B50;&#x300C;&#x505A;&#x597D;&#x83DC;&#x662F;&#x9700;&#x8981;&#x65F6;&#x95F4;&#x7684;&#x3002;&#x5982;&#x679C;&#x4EBA;&#x5BB6;&#x8BA9;&#x60A8;&#x591A;&#x7B49;&#x4F1A;&#x513F;&#xFF0C;&#x90A3;&#x662F;&#x4E3A;&#x4E86;&#x8BA9;&#x60A8;&#x6700;&#x540E;&#x5403;&#x5F97;&#x9AD8;&#x5174;&#x3002;&#x300D;</p>

      
    </div>

    
      

  <div class="popular-posts-header">相关文章</div>
  <ul class="popular-posts">
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/02/02/code-complete-2-learn-note/" rel="bookmark">《Code Complete 2》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/06/27/peopleware-reading-notes/" rel="bookmark">《人件》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/02/03/the-pragmatic-programmer-learn-note/" rel="bookmark">《The Pragmatic Programmer》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/08/07/book-change-the-conversation-learn-note/" rel="bookmark">《解决冲突的关键技巧》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/06/28/book-thinking-about-running-md/" rel="bookmark">《当我跑步时我谈些什么》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/03/24/book-liaoge-linux-course-md/" rel="bookmark">《鸟哥的Linux私房菜》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/03/18/book-touchable-tidy-up-life-md/" rel="bookmark">《怦然心动的人生整理魔法》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/04/01/how-to-life-learn-note/" rel="bookmark">《活法》读书笔记</a></div>
      
    </li>
  
  </ul>


    

    
    
    

    

    

    
      <div>
        <ul class="post-copyright">
  <li class="post-copyright-author">
    <strong>本文作者： </strong>whiledoing</li>
  <li class="post-copyright-link">
    <strong>本文链接：</strong>
    <a href="http://whiledoing.me/2016/03/21/the-mythical-man-month-learn-note-md/" title="《人月神话》读书笔记">http://whiledoing.me/2016/03/21/the-mythical-man-month-learn-note-md/</a>
  </li>
  <li class="post-copyright-license">
    <strong>版权声明： </strong>本博客所有文章除特别声明外，均采用 <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/" rel="external nofollow" target="_blank">CC BY-NC-SA 4.0</a> 许可协议。转载请注明出处！</li>
</ul>

      </div>
    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/读书笔记/" rel="tag"># 读书笔记</a>
          
            <a href="/tags/软件工程/" rel="tag"># 软件工程</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/03/18/book-touchable-tidy-up-life-md/" rel="next" title="《怦然心动的人生整理魔法》读书笔记">
                <i class="fa fa-chevron-left"></i> 《怦然心动的人生整理魔法》读书笔记
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/03/24/learn-linux-from-linux-foundation/" rel="prev" title="linux course from linux foundation 学习记录">
                linux course from linux foundation 学习记录 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


  </div>


          </div>
          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      

      <section class="site-overview-wrap sidebar-panel sidebar-panel-active">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <img class="site-author-image" itemprop="image"
                src="/images/avatar.jpeg"
                alt="whiledoing" />
            
              <p class="site-author-name" itemprop="name">whiledoing</p>
              <p class="site-description motion-element" itemprop="description">喜欢一切简单且美的事物，包括人。</p>
          </div>

          
            <nav class="site-state motion-element">
              
                <div class="site-state-item site-state-posts">
                
                  <a href="/archives/">
                
                    <span class="site-state-item-count">63</span>
                    <span class="site-state-item-name">日志</span>
                  </a>
                </div>
              

              

              
                
                
                <div class="site-state-item site-state-tags">
                  <a href="/tags/index.html">
                    
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                    <span class="site-state-item-count">34</span>
                    <span class="site-state-item-name">标签</span>
                  </a>
                </div>
              
            </nav>
          

          

          
            <div class="links-of-author motion-element">
              
                <span class="links-of-author-item">
                  <a href="https://github.com/whiledoing" target="_blank" title="GitHub">GitHub</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="http://www.douban.com/people/58249409" target="_blank" title="豆瓣">豆瓣</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="https://www.zhihu.com/people/whiledoing" target="_blank" title="知乎">知乎</a>
                  
                </span>
              
            </div>
          

          
          

          
          

          
            
          
          

        </div>
      </section>

      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; 2016 – <span itemprop="copyrightYear">2020</span>
  <span class="with-love" id="animate">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">whiledoing</span>

  

  
</div>




  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动 v3.7.1</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 – <a class="theme-link" target="_blank" href="https://theme-next.org">NexT.Mist</a> v6.4.2</div>




        








        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

    
	
    

    
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>
























  



  
  
    <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/reading_progress/reading_progress.js"></script>
  


  


  <script type="text/javascript" src="/js/src/utils.js?v=6.4.2"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=6.4.2"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=6.4.2"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=6.4.2"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=6.4.2"></script>



  



  










  





  

  

  
<script>
(function(){
    var bp = document.createElement('script');
    var curProtocol = window.location.protocol.split(':')[0];
    if (curProtocol === 'https') {
        bp.src = 'https://zz.bdstatic.com/linksubmit/push.js';        
    }
    else {
        bp.src = 'http://push.zhanzhang.baidu.com/push.js';
    }
    var s = document.getElementsByTagName("script")[0];
    s.parentNode.insertBefore(bp, s);
})();
</script>


  
  

  
  

  


  
  

  
  
  
  <script src="/lib/pangu/dist/pangu.min.js?v=3.3"></script>
  <script type="text/javascript">pangu.spacingPage();</script>


  
  <script type="text/javascript" src="/js/src/js.cookie.js?v=6.4.2"></script>
  <script type="text/javascript" src="/js/src/scroll-cookie.js?v=6.4.2"></script>


  

  

  
  <style>
    .copy-btn {
      display: inline-block;
      padding: 6px 12px;
      font-size: 13px;
      font-weight: 700;
      line-height: 20px;
      color: #333;
      white-space: nowrap;
      vertical-align: middle;
      cursor: pointer;
      background-color: #eee;
      background-image: linear-gradient(#fcfcfc, #eee);
      border: 1px solid #d5d5d5;
      border-radius: 3px;
      user-select: none;
      outline: 0;
    }

    .highlight-wrap .copy-btn {
      transition: opacity .3s ease-in-out;
      opacity: 0;
      padding: 2px 6px;
      position: absolute;
      right: 4px;
      top: 8px;
    }

    .highlight-wrap:hover .copy-btn,
    .highlight-wrap .copy-btn:focus {
      opacity: 1
    }

    .highlight-wrap {
      position: relative;
    }
  </style>
  <script>
    $('.highlight').each(function (i, e) {
      var $wrap = $('<div>').addClass('highlight-wrap')
      $(e).after($wrap)
      $wrap.append($('<button>').addClass('copy-btn').append('复制').on('click', function (e) {
        var code = $(this).parent().find('.code').find('.line').map(function (i, e) {
          return $(e).text()
        }).toArray().join('\n')
        var ta = document.createElement('textarea')
        document.body.appendChild(ta)
        ta.style.position = 'absolute'
        ta.style.top = '0px'
        ta.style.left = '0px'
        ta.value = code
        ta.select()
        ta.focus()
        var result = document.execCommand('copy')
        document.body.removeChild(ta)
        
        $(this).blur()
      })).on('mouseleave', function (e) {
        var $b = $(this).find('.copy-btn')
        setTimeout(function () {
          $b.text('复制')
        }, 300)
      }).append(e)
    })
  </script>


</body>
</html>
