<!DOCTYPE html>



  


<html class="theme-next mist use-motion" lang="zh-CN">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=2"/>
<meta name="theme-color" content="#222">









  
  
  <link rel="stylesheet" media="all" href="/lib/Han/dist/han.min.css?v=3.3">




<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />






















<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=6.1.0" rel="stylesheet" type="text/css" />


  <link rel="apple-touch-icon" sizes="180x180" href="/images/favicon.png?v=6.1.0">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon.png?v=6.1.0">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon.png?v=6.1.0">


  <link rel="mask-icon" href="/images/logo.svg?v=6.1.0" color="#222">









<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    version: '6.1.0',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":false,"onmobile":false},
    fancybox: false,
    fastclick: false,
    lazyload: false,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>


  




  <meta name="description" content="&amp;#x4ECA;&amp;#x5929;&amp;#x662F;&amp;#x7237;&amp;#x7237;&amp;#x751F;&amp;#x75C5;&amp;#x4F4F;&amp;#x9662;&amp;#x7684;&amp;#x7B2C;33&amp;#x5929;&amp;#x3002; &amp;#x524D;&amp;#x51E0;&amp;#x5929;&amp;#x7684;&amp;#x7ECF;&amp;#x9A8C;&amp;#x544A;&amp;#x8BC9;&amp;#x6211;&amp;#xFF1A;&amp;#x7237;&amp;#x72">
<meta name="keywords" content="日记,爷爷">
<meta property="og:type" content="article">
<meta property="og:title" content="diary-2017-12-17-SUN">
<meta property="og:url" content="http://whiledoing.me/2017/12/21/diary/diary-2017-12-17-SUN/index.html">
<meta property="og:site_name" content="whiledoing">
<meta property="og:description" content="&amp;#x4ECA;&amp;#x5929;&amp;#x662F;&amp;#x7237;&amp;#x7237;&amp;#x751F;&amp;#x75C5;&amp;#x4F4F;&amp;#x9662;&amp;#x7684;&amp;#x7B2C;33&amp;#x5929;&amp;#x3002; &amp;#x524D;&amp;#x51E0;&amp;#x5929;&amp;#x7684;&amp;#x7ECF;&amp;#x9A8C;&amp;#x544A;&amp;#x8BC9;&amp;#x6211;&amp;#xFF1A;&amp;#x7237;&amp;#x72">
<meta property="og:locale" content="zh-CN">
<meta property="og:image" content="http://static.zybuluo.com/whiledoing/s7hogqmjuefvogr2kstbvb60/image_1c1srt7abus28m17be1vvt17ji9.png">
<meta property="og:updated_time" content="2018-04-17T13:29:52.953Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="diary-2017-12-17-SUN">
<meta name="twitter:description" content="&amp;#x4ECA;&amp;#x5929;&amp;#x662F;&amp;#x7237;&amp;#x7237;&amp;#x751F;&amp;#x75C5;&amp;#x4F4F;&amp;#x9662;&amp;#x7684;&amp;#x7B2C;33&amp;#x5929;&amp;#x3002; &amp;#x524D;&amp;#x51E0;&amp;#x5929;&amp;#x7684;&amp;#x7ECF;&amp;#x9A8C;&amp;#x544A;&amp;#x8BC9;&amp;#x6211;&amp;#xFF1A;&amp;#x7237;&amp;#x72">
<meta name="twitter:image" content="http://static.zybuluo.com/whiledoing/s7hogqmjuefvogr2kstbvb60/image_1c1srt7abus28m17be1vvt17ji9.png">






  <link rel="canonical" href="http://whiledoing.me/2017/12/21/diary/diary-2017-12-17-SUN/"/>



<script type="text/javascript" id="page.configurations">
  CONFIG.page = {
    sidebar: "",
  };
</script>

  <title>diary-2017-12-17-SUN | whiledoing</title>
  




<script async src="https://www.googletagmanager.com/gtag/js?id=UA-117714040-1"></script>
<script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'UA-117714040-1');
</script>






  <noscript>
  <style type="text/css">
    .use-motion .motion-element,
    .use-motion .brand,
    .use-motion .menu-item,
    .sidebar-inner,
    .use-motion .post-block,
    .use-motion .pagination,
    .use-motion .comments,
    .use-motion .post-header,
    .use-motion .post-body,
    .use-motion .collection-title { opacity: initial; }

    .use-motion .logo,
    .use-motion .site-title,
    .use-motion .site-subtitle {
      opacity: initial;
      top: initial;
    }

    .use-motion {
      .logo-line-before i { left: initial; }
      .logo-line-after i { right: initial; }
    }
  </style>
</noscript>

</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-CN">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">whiledoing</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">喜欢一切简单且美的事物，包括人。</p>
      
  </div>

  <div class="site-nav-toggle">
    <button aria-label="切换导航栏">
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>




<nav class="site-nav">
  
    <ul id="menu" class="menu">
      
        
        
        
          
          <li class="menu-item menu-item-home">
    <a href="/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-home"></i> <br />首页</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-tags">
    <a href="/tags/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />标签</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-archives">
    <a href="/archives/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />归档</a>
  </li>

      
      
    </ul>
  

  
    

  

  
</nav>



  



</div>
    </header>

    


    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://whiledoing.me/2017/12/21/diary/diary-2017-12-17-SUN/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="whiledoing">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/images/avatar.jpeg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="whiledoing">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">diary-2017-12-17-SUN
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">

            
            
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              

              
                
              

              <time title="创建于：2017-12-21 23:43:26" itemprop="dateCreated datePublished" datetime="2017-12-21T23:43:26+08:00">2017-12-21</time>
            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body han-init-context" itemprop="articleBody">

      
      

      
        <p>&#x4ECA;&#x5929;&#x662F;&#x7237;&#x7237;&#x751F;&#x75C5;&#x4F4F;&#x9662;&#x7684;&#x7B2C;33&#x5929;&#x3002;</p>
<p>&#x524D;&#x51E0;&#x5929;&#x7684;&#x7ECF;&#x9A8C;&#x544A;&#x8BC9;&#x6211;&#xFF1A;&#x7237;&#x7237;&#x7684;&#x72B6;&#x6001;&#x5927;&#x7EA6;&#x662F;&#x4E00;&#x5929;&#x597D;&#xFF0C;&#x4E00;&#x5929;&#x4E0D;&#x597D;&#x3002;&#x6240;&#x4EE5;&#x6309;&#x7167;&#x89C4;&#x5F8B;&#xFF0C;&#x7237;&#x7237;&#x4ECA;&#x5929;&#x72B6;&#x6001;&#x6982;&#x7387;&#x9762;&#x4E0A;&#x4F1A;&#x4E0D;&#x592A;&#x597D;&#xFF0C;&#x6211;&#x5FC3;&#x91CC;&#x4E5F;&#x662F;&#x5E26;&#x7740;&#x62C5;&#x5FE7;&#x7684;&#x5FC3;&#x60C5;&#x53BB;&#x533B;&#x9662;&#x3002;&#x5230;&#x4E86;&#x540E;&#xFF0C;&#x62A4;&#x5DE5;&#x5E08;&#x5085;&#x544A;&#x8BC9;&#x6211;&#x6628;&#x5929;&#x591C;&#x91CC;&#x95F9;&#x5F97;&#x5B9E;&#x5728;&#x5389;&#x5BB3;&#xFF0C;&#x7ED9;&#x5403;&#x4E86;&#x5B89;&#x7720;&#x836F;&#xFF0C;&#x7761;&#x4E86;&#x7EA6;2&#x5C0F;&#x65F6;&#xFF0C; &#x540E;&#x9762;&#x4E5F;&#x7ECF;&#x5E38;&#x9192;&#xFF0C;&#x4E0D;&#x8FC7;&#x60C5;&#x7EEA;&#x8FD8;&#x597D;&#xFF0C;&#x591A;&#x662F;&#x7FFB;&#x8EAB;&#x559D;&#x6C34;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x4ED6;&#x4E5F;&#x53EF;&#x4EE5;&#x5E94;&#x4ED8;&#x7684;&#x6765;&#x3002;&#x4E4B;&#x524D;&#x7684;&#x7ECF;&#x9A8C;&#x5C31;&#x662F;&#x5403;&#x4E86;&#x5B89;&#x7720;&#x836F;&#xFF0C;&#x7B2C;&#x4E8C;&#x5929;&#x767D;&#x5929;&#x7684;&#x7CBE;&#x795E;&#x5C31;&#x4F1A;&#x5F88;&#x4E0D;&#x597D;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5631;&#x5490;&#x5E08;&#x5085;&#x4E0D;&#x662F;&#x5728;&#x7279;&#x522B;&#x60C5;&#x51B5;&#x4E0B;&#xFF08;&#x6BD4;&#x5982;&#x591C;&#x91CC;&#x95F9;&#x817E;&#x8D85;&#x8FC7;&#x4E00;&#x5C0F;&#x65F6;&#x8FD8;&#x662F;&#x5B89;&#x629A;&#x4E0D;&#x4E86;&#xFF09;&#x5C3D;&#x91CF;&#x4E0D;&#x5403;&#x5B89;&#x7720;&#x836F;&#x3002;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E5F;&#x4E0D;&#x80FD;&#x602A;&#x5E08;&#x5085;&#xFF0C;&#x591C;&#x91CC;&#x4E00;&#x76F4;&#x95F9;&#x817E;&#xFF0C;&#x522B;&#x4EBA;&#x4E5F;&#x53D7;&#x4E0D;&#x4E86;&#xFF0C;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#x62C5;&#x5FC3;&#x4ED6;&#x95F9;&#x8D77;&#x6765;&#x4E0D;&#x76D6;&#x88AB;&#x5B50;&#xFF0C;&#x611F;&#x5192;&#x53D1;&#x70E7;&#x7684;&#x8BDD;&#x5C31;&#x4F1A;&#x975E;&#x5E38;&#x9EBB;&#x70E6;&#xFF0C;&#x6240;&#x4EE5;&#x8BF4;&#x8FD9;&#x786E;&#x5B9E;&#x662F;&#x4E2A;&#x4E24;&#x96BE;&#x7684;&#x884C;&#x4E3A;&#x3002;</p>
<p>&#x4E2D;&#x5348;&#x53D1;&#x751F;&#x4E86;&#x4EF6;&#x8DA3;&#x4E8B;&#x3002;&#x6211;&#x5403;&#x4E86;&#x5348;&#x996D;&#x56DE;&#x5230;&#x75C5;&#x623F;&#xFF0C;&#x53D1;&#x73B0;&#x6211;&#x7684;&#x95E8;&#x7981;&#x5361;&#xFF08;&#x4E5F;&#x662F;&#x536B;&#x751F;&#x95F4;&#x51FA;&#x70ED;&#x6C34;&#x7684;&#x5361;&#xFF09;&#x6CA1;&#x6709;&#x4E86;&#xFF0C;&#x4ED4;&#x7EC6;&#x60F3;&#x6765;&#x6211;&#x5E94;&#x8BE5;&#x662F;&#x63D2;&#x5728;&#x536B;&#x751F;&#x95F4;&#x7684;&#x5361;&#x69FD;&#x4E0A;&#xFF0C;&#x6CA1;&#x6709;&#x62D4;&#x4E0B;&#x88AB;&#x522B;&#x4EBA;&#x62FF;&#x8D70;&#x3002;&#x524D;&#x51E0;&#x5929;&#x6700;&#x91CC;&#x9762;&#x5E8A;&#x7684;&#x62A4;&#x5DE5;&#x5E08;&#x5085;&#x4ECE;&#x536B;&#x751F;&#x95F4;&#x51FA;&#x6765;&#x5C31;&#x9887;&#x6709;&#x5FAE;&#x8BCD;&#x7684;&#x5927;&#x58F0;&#x8BF4;&#x5230;&#x300E;&#x662F;&#x8C01;&#x7F3A;&#x5FB7;&#x62FF;&#x8D70;&#x4E86;&#x70ED;&#x6C34;&#x5361;&#x300F;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x4E00;&#x8138;&#x61F5;&#x6BD4;&#x7684;&#x5E94;&#x4ED8;&#x5230;&#xFF1A;&#x6CA1;&#x6709;&#x62FF;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x8C01;&#x5E72;&#x7684;&#x3002;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x7528;&#x70ED;&#x6C34;&#x4E86;&#xFF0C;&#x6211;&#x65E9;&#x4E0A;&#x5C31;&#x5C06;&#x6211;&#x6C34;&#x5361;&#x63D2;&#x4E0A;&#x53BB;&#x4F7F;&#x7528;&#xFF0C;&#x5FD8;&#x8BB0;&#x62FF;&#x4E0B;&#x6765;&#xFF0C;&#x7ED3;&#x679C;&#x4E2D;&#x5348;&#x4E5F;&#x6CA1;&#x6709;&#x4E86;&#x3002;&#x6211;&#x4E5F;&#x5F88;&#x751F;&#x6C14;&#x7684;&#x5728;&#x623F;&#x95F4;&#x8BF4;&#x8D77;&#x6765;&#xFF0C;&#x597D;&#x7AEF;&#x7AEF;&#x7684;&#x8C01;&#x6CA1;&#x4E8B;&#x7F3A;&#x5FB7;&#x62FF;&#x5361;&#xFF01;&#x672C;&#x6765;&#x6211;&#x4EEC;&#x7167;&#x987E;&#x75C5;&#x4EBA;&#x5C31;&#x7ECF;&#x5E38;&#x9700;&#x8981;&#x7528;&#x6C34;&#xFF0C;&#x6BCF;&#x6B21;&#x63D2;&#x62D4;&#x592A;&#x5F71;&#x54CD;&#x6548;&#x7387;&#xFF0C;&#x5C31;&#x4E00;&#x76F4;&#x63D2;&#x7740;&#xFF0C;&#x8C01;&#x60F3;&#x5230;&#x88AB;&#x522B;&#x4EBA;&#x5077;&#x4E86;&#x3002;&#x6211;&#x76F4;&#x63A5;&#x6253;&#x4E86;110&#xFF0C;&#x6298;&#x817E;&#x4E86;&#x51E0;&#x756A;&#x529F;&#x592B;&#x4E4B;&#x540E;&#xFF0C;&#x7EC8;&#x4E8E;&#x5F97;&#x5230;&#x4E86;&#x770B;&#x533B;&#x9662;&#x76D1;&#x63A7;&#x7684;&#x6743;&#x9650;&#x3002;&#x6211;&#x548C;&#x8B66;&#x5BDF;&#x53D4;&#x53D4;&#x8BF4;&#xFF0C;&#x6211;&#x627E;&#x8FD9;&#x4E2A;&#x6C34;&#x5361;&#x4E0D;&#x4E3A;&#x5565;&#xFF0C;&#x8FD9;&#x672C;&#x8EAB;&#x4E5F;&#x6CA1;&#x6709;&#x591A;&#x5C11;&#x94B1;&#xFF0C;&#x5C31;&#x662F;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x8BA9;&#x6211;&#x6076;&#x5FC3;&#xFF0C;&#x8C01;tmd&#x7F3A;&#x5FB7;&#x5077;&#x75C5;&#x623F;&#x7684;&#x6C34;&#x5361;&#x3002;&#xFF08;&#x8BB2;&#x771F;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x77E5;&#x9053;&#x8C03;&#x770B;&#x76D1;&#x63A7;&#x9700;&#x8981;&#x5982;&#x6B64;&#x590D;&#x6742;&#x7684;&#x624B;&#x7EED;&#x6D41;&#x7A0B;&#xFF0C;&#x6211;&#x53EF;&#x80FD;&#x4E5F;&#x5C31;&#x4E0D;&#x6298;&#x817E;&#x4E86;&#x3002;&#x3002;&#xFF09;&#x3002;&#x5728;&#x8B66;&#x5BDF;&#x540C;&#x5FD7;&#x7684;&#x5E26;&#x9886;&#x4E0B;&#xFF0C;&#x6211;&#x8FDB;&#x5165;&#x533B;&#x9662;&#x7684;&#x76D1;&#x63A7;&#x623F;&#x95F4;&#xFF0C;&#x5728;&#x7B7E;&#x4E86;&#x4E00;&#x5806;&#x624B;&#x7EED;&#x540E;&#xFF0C;&#x624D;&#x8C03;&#x51FA;&#x4E86;&#x4E2D;&#x5348;&#x65F6;&#x6BB5;&#x7684;&#x8D70;&#x5ECA;&#x76D1;&#x63A7;&#x3002;&#x7ED3;&#x679C;&#x662F;&#xFF0C;&#x6211;&#x770B;&#x4E86;&#x4E00;&#x4E2A;&#x4E2D;&#x5348;&#xFF0C;&#x7EA6;3&#x5C0F;&#x65F6;&#x957F;&#x7684;&#x76D1;&#x63A7;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x53D1;&#x73B0;&#x5916;&#x4EBA;&#xFF08;&#x4E0D;&#x662F;&#x6211;&#x4EEC;&#x623F;&#x95F4;&#x7684;&#x75C5;&#x4EBA;&#xFF0C;&#x5BB6;&#x5C5E;&#xFF0C;&#x62A4;&#x5DE5;&#xFF09;&#x8FDB;&#x51FA;&#x3002;&#x5F53;&#x65F6;&#x6211;&#x5C31;&#x60F3;&#x5F88;&#x53EF;&#x80FD;&#x662F;&#x4E4B;&#x524D;&#x6389;&#x5361;&#x7684;&#x62A4;&#x5DE5;&#x62FF;&#x4E86;&#x6211;&#x7684;&#x5361;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x81EA;&#x5DF1;&#x6389;&#x4E86;&#x5361;&#xFF0C;&#x7528;&#x6211;&#x7684;&#x5361;&#x6765;&#x9876;&#x3002;&#x4E0D;&#x8FC7;&#x540E;&#x60F3;&#xFF0C;&#x4E00;&#x662F;&#x53EA;&#x662F;&#x6211;&#x4E2A;&#x4EBA;&#x731C;&#x6D4B;&#xFF1B;&#x4E8C;&#x662F;&#x5373;&#x4FBF;&#x5982;&#x6B64;&#xFF0C;&#x8FD9;&#x4E8B;&#x60C5;&#x4E5F;&#x6CA1;&#x5FC5;&#x8981;&#x641E;&#x50F5;&#xFF0C;&#x6BD5;&#x7ADF;&#x5728;&#x4E00;&#x4E2A;&#x75C5;&#x623F;&#xFF0C;&#x8865;&#x4E00;&#x5F20;&#x5361;&#x4E5F;&#x5C31;&#x4E94;&#x5341;&#x5143;&#x94B1;&#xFF0C;&#x6CA1;&#x5FC5;&#x8981;&#x4E3A;&#x6B64;&#x4F24;&#x4E86;&#x548C;&#x6C14;&#x3002;&#x4E0B;&#x5348;&#x6211;&#x76F4;&#x63A5;&#x53BB;&#x8865;&#x529E;&#x4E86;&#x4E00;&#x5F20;&#x5361;&#xFF0C;&#x4E5F;&#x6CA1;&#x548C;&#x540C;&#x75C5;&#x623F;&#x7684;&#x4EBA;&#x8BF4;&#x66F4;&#x591A;&#x7EC6;&#x8282;&#xFF0C;&#x5C31;&#x5C06;&#x8FD9;&#x4E8B;&#x7565;&#x8FC7;&#x4E86;&#x3002;&#x597D;&#x73A9;&#x7684;&#x662F;&#xFF0C;&#x5F53;&#x665A;&#x4E0A;&#x6211;&#x5C06;&#x65B0;&#x529E;&#x7684;&#x5361;&#x4EA4;&#x7ED9;&#x6211;&#x4EEC;&#x62A4;&#x5DE5;&#x91D1;&#x5E08;&#x5085;&#x7528;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x987A;&#x7740;&#x65E9;&#x4E0A;&#x5077;&#x5361;&#x7684;&#x4E8B;&#x60C5;&#x591A;&#x8BF4;&#x4E86;&#x51E0;&#x53E5;&#xFF0C;&#x800C;&#x4E5F;&#x5C31;&#x5728;&#x540C;&#x65F6;&#xFF0C;&#x6700;&#x53F3;&#x8FB9;&#x5E8A;&#x4F4D;&#x7684;&#x62A4;&#x5DE5;&#x5E08;&#x5085;&#x8DF3;&#x4E86;&#x51FA;&#x6765;&#xFF0C;&#x9887;&#x6709;&#x4E9B;&#x6FC0;&#x52A8;&#x7684;&#x4E5F;&#x987A;&#x7740;&#x8BF4;&#x4E86;&#x51E0;&#x53E5;&#xFF0C;&#x9887;&#x6709;&#x4E9B;&#x300C;&#x6B64;&#x5730;&#x65E0;&#x94F6;&#x4E09;&#x767E;&#x4E24;&#x300D;&#x7684;&#x610F;&#x601D;&#xFF0C;&#x60F3;&#x6765;&#xFF0C;&#x5341;&#x6709;&#x516B;&#x4E5D;&#xFF0C;&#x987F;&#x89C9;&#x6709;&#x8DA3;&#x3002;</p>
<p>&#x5468;&#x672B;&#x6674;&#x6717;&#x7684;&#x5929;&#x6C14;&#x5F97;&#x5230;&#x4E86;&#x5EF6;&#x7EED;&#xFF0C;&#x4E0B;&#x5348;&#x6211;&#x4EEC;&#x8FD8;&#x5C06;&#x7237;&#x7237;&#x63A8;&#x5230;&#x4E86;&#x5927;&#x5385;&#x9633;&#x5149;&#x597D;&#x7684;&#x5730;&#x65B9;&#x5750;&#x5750;&#x3002;&#x4E0B;&#x5348;&#x6211;&#x53BB;&#x8865;&#x529E;&#x5361;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E8C;&#x7237;&#x548C;&#x4E8C;&#x5A76;&#x8FC7;&#x6765;&#x4E86;&#x3002;&#x6211;&#x548C;&#x4E8C;&#x7237;&#x4E24;&#x4E2A;&#x4EBA;&#x4E00;&#x4EBA;&#x4E00;&#x53E5;&#x7684;&#x5E94;&#x5BF9;&#x7740;&#x7237;&#x7237;&#x8BF4;&#x4E0D;&#x6E05;&#x695A;&#x7684;&#x8BDD;&#x8BED;&#xFF1A;&#x867D;&#x7136;&#x4E0D;&#x61C2;&#x4ED6;&#x7684;&#x8BDD;&#xFF0C;&#x4F46;&#x662F;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x4ED6;&#x8BF4;&#x8BDD;&#x7684;&#x60C5;&#x7EEA;&#x731C;&#x6D4B;&#x7237;&#x7237;&#x8BF4;&#x8BDD;&#x7684;&#x8BED;&#x6C14;&#xFF0C;&#x7136;&#x540E;&#x8FDB;&#x884C;&#x7C7B;&#x4F3C;&#x4E8E;&#x300C;&#x5965;&#x3002;&#x771F;&#x7684;&#x554A;&#x3002;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x7684;&#x4E8B;&#x60C5;&#x554A;&#x3002;&#x6CA1;&#x95EE;&#x9898;&#x300D;&#x4E4B;&#x7C7B;&#x4E07;&#x80FD;&#x7684;&#x642D;&#x8BDD;&#x8BCD;&#x3002;&#x540E;&#x6765;&#x7237;&#x7237;&#x7A81;&#x7136;&#x795E;&#x60C5;&#x6FC0;&#x52A8;&#x7684;&#x8BF4;&#x8981;&#x7AD9;&#x8D77;&#x6765;&#x8BD5;&#x8BD5;&#xFF0C;&#x6211;&#x4EEC;&#x62DB;&#x67B6;&#x4E0D;&#x4F4F;&#xFF0C;&#x5C31;&#x591A;&#x4EBA;&#x914D;&#x5408;&#x5C06;&#x8001;&#x7237;&#x5B50;&#x6400;&#x6276;&#x7740;&#x7AD9;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x53EA;&#x662F;&#x6CA1;&#x7AD9;&#x591A;&#x4E45;&#xFF0C;&#x5927;&#x5BB6;&#x5C31;&#x6491;&#x4E0D;&#x4F4F;&#x529B;&#x6C14;&#x53C8;&#x8BA9;&#x4ED6;&#x5750;&#x4E86;&#x4E0B;&#x53BB;&#x3002;&#x540E;&#x6765;&#x60F3;&#x5230;&#x4E00;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x6298;&#x4E2D;&#x65B9;&#x6848;&#xFF1A;&#x5C06;&#x7237;&#x7237;&#x8F6E;&#x6905;&#x63A8;&#x5230;&#x9760;&#x5899;&#x6709;&#x6276;&#x624B;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x8BA9;&#x7237;&#x7237;&#x81EA;&#x5DF1;&#x5DE6;&#x624B;&#x6293;&#x4F4F;&#x6276;&#x624B;&#xFF0C;&#x5750;&#x5728;&#x8F6E;&#x6905;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5176;&#x540E;&#x80CC;&#x9876;&#x4F4F;&#xFF0C;&#x633A;&#x8D77;&#x6210;&#x5750;&#x7ACB;&#x6001;&#xFF0C;&#x7237;&#x7237;&#x4E5F;&#x5C31;&#x4E0D;&#x518D;&#x95F9;&#x817E;&#x3002;</p>
<p>&#x4ECA;&#x5929;&#x72B6;&#x6001;&#x603B;&#x7684;&#x8BF4;&#x6765;&#x5EF6;&#x7EED;&#x4E86;&#x4E00;&#x5929;&#x597D;&#x4E00;&#x5929;&#x4E0D;&#x597D;&#x7684;&#x89C4;&#x5F8B;&#x3002;&#x665A;&#x4E0A;&#x4E00;&#x76F4;&#x4E0D;&#x80AF;&#x5403;&#x996D;&#xFF0C;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x53EA;&#x80FD;&#x8BA9;&#x4ED6;&#x5148;&#x7761;&#x89C9;&#x3002;&#x8FD8;&#x597D;&#x665A;&#x4E0A;&#x5A9B;&#x5A9B;&#x59B9;&#x59B9;&#x8FC7;&#x6765;&#x5E2E;&#x5FD9;&#xFF0C;&#x8BA9;&#x6211;&#x8F7B;&#x677E;&#x4E86;&#x4E0D;&#x5C11;&#x3002;&#x665A;&#x4E0A;8&#x70B9;&#x534A;&#x5DE6;&#x53F3;&#xFF0C;&#x6211;&#x548C;&#x59B9;&#x59B9;&#x4E24;&#x4EBA;&#x5408;&#x4F5C;&#xFF0C;&#x4E00;&#x4E2A;&#x60F3;&#x529E;&#x6CD5;&#x5F04;&#x9192;&#x7237;&#x7237;&#xFF0C;&#x4E00;&#x4E2A;&#x51C6;&#x5907;&#x70ED;&#x83DC;&#xFF0C;&#x6C34;&#xFF0C;&#x8425;&#x517B;&#x6DB2;&#x7B49;&#x5582;&#x98DF;&#x7269;&#x4EF6;&#x3002;&#x7EC8;&#x4E8E;&#x5728;&#x78E8;&#x4E86;&#x4E00;&#x4E2A;&#x591A;&#x5C0F;&#x65F6;&#x540E;&#xFF0C;&#x5C06;400ml&#x7684;&#x5582;&#x98DF;&#x91CF;&#x7ED9;&#x5B8C;&#x6210;&#x4E86;&#x3002;</p>
<p>&#x53C8;&#x53CA;&#xFF0C;&#x5A9B;&#x5A9B;&#x59B9;&#x59B9;&#x665A;&#x4E0A;&#x8FC7;&#x6765;&#x5E2E;&#x6211;&#x5582;&#x7237;&#x7237;&#xFF1A;</p>
<p><img src="http://static.zybuluo.com/whiledoing/s7hogqmjuefvogr2kstbvb60/image_1c1srt7abus28m17be1vvt17ji9.png" alt="image_1c1srt7abus28m17be1vvt17ji9.png-1053.7kB"></p>

      
    </div>

    
      

  <div class="popular-posts-header">相关文章</div>
  <ul class="popular-posts">
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/16/diary/diary-2017-12-13-WED/" rel="bookmark">diary-2017-12-13-WED</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/07/diary/diary-2017-12-06-WED/" rel="bookmark">diary-2017-12-06-WED</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/11/diary/diary-2017-12-08-FRI/" rel="bookmark">diary-2017-12-08-FRI</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/19/diary/diary-2016-12-14-THU/" rel="bookmark">diary-2016-12-14-THU</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/12/diary/diary-2017-12-10-SUN/" rel="bookmark">diary-2017-12-10-SUN</a></div>
      
    </li>
  
  </ul>


    

    
    
    

    

    

    
      <div>
        <ul class="post-copyright">
  <li class="post-copyright-author">
    <strong>本文作者： </strong>whiledoing</li>
  <li class="post-copyright-link">
    <strong>本文链接：</strong>
    <a href="http://whiledoing.me/2017/12/21/diary/diary-2017-12-17-SUN/" title="diary-2017-12-17-SUN">http://whiledoing.me/2017/12/21/diary/diary-2017-12-17-SUN/</a>
  </li>
  <li class="post-copyright-license">
    <strong>版权声明： </strong>本博客所有文章除特别声明外，均采用 <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/" rel="external nofollow" target="_blank">CC BY-NC-SA 4.0</a> 许可协议。转载请注明出处！</li>
</ul>

      </div>
    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/日记/" rel="tag"># 日记</a>
          
            <a href="/tags/爷爷/" rel="tag"># 爷爷</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2017/12/21/diary/diary-2017-12-16-SAT/" rel="next" title="diary-2017-12-16-SAT">
                <i class="fa fa-chevron-left"></i> diary-2017-12-16-SAT
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2017/12/31/diary/diary-2017-12-18-MON/" rel="prev" title="diary-2017-12-18-MON">
                diary-2017-12-18-MON <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      

      <section class="site-overview-wrap sidebar-panel sidebar-panel-active">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <img class="site-author-image" itemprop="image"
                src="/images/avatar.jpeg"
                alt="whiledoing" />
            
              <p class="site-author-name" itemprop="name">whiledoing</p>
              <p class="site-description motion-element" itemprop="description">喜欢一切简单且美的事物，包括人。</p>
          </div>

          
            <nav class="site-state motion-element">
              
                <div class="site-state-item site-state-posts">
                
                  <a href="/archives/">
                
                    <span class="site-state-item-count">51</span>
                    <span class="site-state-item-name">日志</span>
                  </a>
                </div>
              

              

              
                
                
                <div class="site-state-item site-state-tags">
                  <a href="/tags/index.html">
                    
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                    <span class="site-state-item-count">28</span>
                    <span class="site-state-item-name">标签</span>
                  </a>
                </div>
              
            </nav>
          

          

          
            <div class="links-of-author motion-element">
              
                <span class="links-of-author-item">
                  <a href="https://github.com/whiledoing" target="_blank" title="GitHub">GitHub</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="http://www.douban.com/people/58249409" target="_blank" title="豆瓣">豆瓣</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="https://www.zhihu.com/people/whiledoing" target="_blank" title="知乎">知乎</a>
                  
                </span>
              
            </div>
          

          
          

          
          

          
            
          
          

        </div>
      </section>

      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; 2016 &mdash; <span itemprop="copyrightYear">2018</span>
  <span class="with-love" id="animate">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">whiledoing</span>

  

  
</div>




  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动 v3.7.1</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/theme-next/hexo-theme-next">NexT.Mist</a> v6.1.0</div>




        








        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>


























  
  
    <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  


  


  <script type="text/javascript" src="/js/src/utils.js?v=6.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=6.1.0"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=6.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=6.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=6.1.0"></script>



  



	





  





  










  





  

  

  

  
  

  
  

  


  
  

  
  
  
  <script src="/lib/pangu/dist/pangu.min.js?v=3.3"></script>
  <script type="text/javascript">pangu.spacingPage();</script>


  
  <script type="text/javascript" src="/js/src/js.cookie.js?v=6.1.0"></script>
  <script type="text/javascript" src="/js/src/scroll-cookie.js?v=6.1.0"></script>


  

  

  
  <style>
    .copy-btn {
        position: relative;
        display: inline-block;
        padding: 6px 12px;
        font-size: 13px;
        font-weight: 700;
        line-height: 20px;
        color: #333;
        white-space: nowrap;
        vertical-align: middle;
        cursor: pointer;
        background-color: #eee;
        background-image: linear-gradient(#fcfcfc, #eee);
        border: 1px solid #d5d5d5;
        border-radius: 3px;
        user-select: none;
    }

    .highlight {
        position: relative;
    }

    .highlight .copy-btn {
        transition: opacity .3s ease-in-out;
        opacity: 0;
        padding: 2px 6px;
        position: absolute;
        right: 4px;
        top: 8px;
    }

    .highlight:hover .copy-btn,
    .highlight .copy-btn:focus {
        opacity: 1
    }
  </style>
  <script>
    $('.highlight').prepend($('<button>').addClass('copy-btn').append('Copy').on('click', function(e) {
      var code = $(e.target).parent().find('.code').find('.line').map(function(i, e){
        return $(e).text()
      }).toArray().join('\n')
      var ta = document.createElement('textarea')
      document.body.appendChild(ta)
      ta.style.position = 'fixed'
      ta.style.top = 0
      ta.style.left = 0
      ta.value = code
      ta.select()
      ta.focus()
      document.execCommand('copy')
      document.body.removeChild(ta)
    }))
  </script>


</body>
</html>
