<!DOCTYPE html>



  


<html class="theme-next mist use-motion" lang="zh-CN">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=2"/>
<meta name="theme-color" content="#222">









  
  
  <link rel="stylesheet" media="all" href="/lib/Han/dist/han.min.css?v=3.3">




<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />






















<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=6.1.0" rel="stylesheet" type="text/css" />


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=6.1.0">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=6.1.0">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=6.1.0">


  <link rel="mask-icon" href="/images/logo.svg?v=6.1.0" color="#222">









<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    version: '6.1.0',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":false,"onmobile":false},
    fancybox: false,
    fastclick: false,
    lazyload: false,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>


  




  <meta name="description" content="这本书是偶然机会下看到别人书评中推荐的，刚好最近也经常会因为一些事情和别人进行「斯比」，哈哈，而且豆瓣评分8.5也非常的高，就索性买了一本看了起来。书有三百多页，但其实内容不多，很多页都是一页纸就一句话的类似ppt样式的结论文字。但看了之后很是喜欢，很多道理（或者说是解决冲突，社交，沟通的有效方法）都或多或少知道，但是如何将其系统性的应用到「冲突解决」这个事情上，进而达到更加有效的沟通，本书给出了">
<meta name="keywords" content="自写,读书笔记,心理学">
<meta property="og:type" content="article">
<meta property="og:title" content="《解决冲突的关键技巧》读书笔记">
<meta property="og:url" content="http://whiledoing.me/2016/08/07/book-change-the-conversation-learn-note/index.html">
<meta property="og:site_name" content="whiledoing">
<meta property="og:description" content="这本书是偶然机会下看到别人书评中推荐的，刚好最近也经常会因为一些事情和别人进行「斯比」，哈哈，而且豆瓣评分8.5也非常的高，就索性买了一本看了起来。书有三百多页，但其实内容不多，很多页都是一页纸就一句话的类似ppt样式的结论文字。但看了之后很是喜欢，很多道理（或者说是解决冲突，社交，沟通的有效方法）都或多或少知道，但是如何将其系统性的应用到「冲突解决」这个事情上，进而达到更加有效的沟通，本书给出了">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2017-11-30T07:12:46.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="《解决冲突的关键技巧》读书笔记">
<meta name="twitter:description" content="这本书是偶然机会下看到别人书评中推荐的，刚好最近也经常会因为一些事情和别人进行「斯比」，哈哈，而且豆瓣评分8.5也非常的高，就索性买了一本看了起来。书有三百多页，但其实内容不多，很多页都是一页纸就一句话的类似ppt样式的结论文字。但看了之后很是喜欢，很多道理（或者说是解决冲突，社交，沟通的有效方法）都或多或少知道，但是如何将其系统性的应用到「冲突解决」这个事情上，进而达到更加有效的沟通，本书给出了">






  <link rel="canonical" href="http://whiledoing.me/2016/08/07/book-change-the-conversation-learn-note/"/>



<script type="text/javascript" id="page.configurations">
  CONFIG.page = {
    sidebar: "",
  };
</script>

  <title>《解决冲突的关键技巧》读书笔记 | whiledoing</title>
  




<script async src="https://www.googletagmanager.com/gtag/js?id=UA-117714040-1"></script>
<script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'UA-117714040-1');
</script>






  <noscript>
  <style type="text/css">
    .use-motion .motion-element,
    .use-motion .brand,
    .use-motion .menu-item,
    .sidebar-inner,
    .use-motion .post-block,
    .use-motion .pagination,
    .use-motion .comments,
    .use-motion .post-header,
    .use-motion .post-body,
    .use-motion .collection-title { opacity: initial; }

    .use-motion .logo,
    .use-motion .site-title,
    .use-motion .site-subtitle {
      opacity: initial;
      top: initial;
    }

    .use-motion {
      .logo-line-before i { left: initial; }
      .logo-line-after i { right: initial; }
    }
  </style>
</noscript>

</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-CN">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">whiledoing</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">喜欢一切简单且美的事物，包括人。</p>
      
  </div>

  <div class="site-nav-toggle">
    <button aria-label="切换导航栏">
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>




<nav class="site-nav">
  
    <ul id="menu" class="menu">
      
        
        
        
          
          <li class="menu-item menu-item-home">
    <a href="/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-home"></i> <br />首页</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-tags">
    <a href="/tags/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />标签</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-archives">
    <a href="/archives/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />归档</a>
  </li>

      
      
    </ul>
  

  
    

  

  
</nav>



  



</div>
    </header>

    


    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://whiledoing.me/2016/08/07/book-change-the-conversation-learn-note/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="whiledoing">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/images/avatar.jpeg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="whiledoing">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">《解决冲突的关键技巧》读书笔记
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">

            
            
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              

              
                
              

              <time title="创建于：2016-08-07 17:07:05" itemprop="dateCreated datePublished" datetime="2016-08-07T17:07:05+08:00">2016-08-07</time>
            

            
              

              
                
                <span class="post-meta-divider">|</span>
                

                <span class="post-meta-item-icon">
                  <i class="fa fa-calendar-check-o"></i>
                </span>
                
                <time title="更新于：2017-11-30 15:12:46" itemprop="dateModified" datetime="2017-11-30T15:12:46+08:00">2017-11-30</time>
              
            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body han-init-context" itemprop="articleBody">

      
      

      
        <p>&#x8FD9;&#x672C;&#x4E66;&#x662F;&#x5076;&#x7136;&#x673A;&#x4F1A;&#x4E0B;&#x770B;&#x5230;&#x522B;&#x4EBA;&#x4E66;&#x8BC4;&#x4E2D;&#x63A8;&#x8350;&#x7684;&#xFF0C;&#x521A;&#x597D;&#x6700;&#x8FD1;&#x4E5F;&#x7ECF;&#x5E38;&#x4F1A;&#x56E0;&#x4E3A;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#x548C;&#x522B;&#x4EBA;&#x8FDB;&#x884C;&#x300C;&#x65AF;&#x6BD4;&#x300D;&#xFF0C;&#x54C8;&#x54C8;&#xFF0C;&#x800C;&#x4E14;<a href="https://book.douban.com/subject/26782094/" target="_blank" rel="noopener">&#x8C46;&#x74E3;&#x8BC4;&#x5206;</a>8.5&#x4E5F;&#x975E;&#x5E38;&#x7684;&#x9AD8;&#xFF0C;&#x5C31;&#x7D22;&#x6027;&#x4E70;&#x4E86;&#x4E00;&#x672C;&#x770B;&#x4E86;&#x8D77;&#x6765;&#x3002;&#x4E66;&#x6709;&#x4E09;&#x767E;&#x591A;&#x9875;&#xFF0C;&#x4F46;&#x5176;&#x5B9E;&#x5185;&#x5BB9;&#x4E0D;&#x591A;&#xFF0C;&#x5F88;&#x591A;&#x9875;&#x90FD;&#x662F;&#x4E00;&#x9875;&#x7EB8;&#x5C31;&#x4E00;&#x53E5;&#x8BDD;&#x7684;&#x7C7B;&#x4F3C;ppt&#x6837;&#x5F0F;&#x7684;&#x7ED3;&#x8BBA;&#x6587;&#x5B57;&#x3002;&#x4F46;&#x770B;&#x4E86;&#x4E4B;&#x540E;&#x5F88;&#x662F;&#x559C;&#x6B22;&#xFF0C;&#x5F88;&#x591A;&#x9053;&#x7406;&#xFF08;&#x6216;&#x8005;&#x8BF4;&#x662F;&#x89E3;&#x51B3;&#x51B2;&#x7A81;&#xFF0C;&#x793E;&#x4EA4;&#xFF0C;&#x6C9F;&#x901A;&#x7684;&#x6709;&#x6548;&#x65B9;&#x6CD5;&#xFF09;&#x90FD;&#x6216;&#x591A;&#x6216;&#x5C11;&#x77E5;&#x9053;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x4F55;&#x5C06;&#x5176;&#x7CFB;&#x7EDF;&#x6027;&#x7684;&#x5E94;&#x7528;&#x5230;&#x300C;&#x51B2;&#x7A81;&#x89E3;&#x51B3;&#x300D;&#x8FD9;&#x4E2A;&#x4E8B;&#x60C5;&#x4E0A;&#xFF0C;&#x8FDB;&#x800C;&#x8FBE;&#x5230;&#x66F4;&#x52A0;&#x6709;&#x6548;&#x7684;&#x6C9F;&#x901A;&#xFF0C;&#x672C;&#x4E66;&#x7ED9;&#x51FA;&#x4E86;&#x975E;&#x5E38;&#x597D;&#x7684;&#x603B;&#x7ED3;&#x3002;</p>
<a id="more"></a>
<p>&#x4E66;&#x7C4D;&#x6700;&#x5F00;&#x59CB;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#x5C31;&#x6982;&#x62EC;&#x4E86;&#x672C;&#x4E66;&#x7684;&#x4E3B;&#x8981;&#x9053;&#x4E49;&#xFF1A;</p>
<blockquote>
<p>&#x4F60;&#x65E0;&#x6CD5;&#x907F;&#x514D;&#x51B2;&#x7A81;&#xFF0C;&#x4E5F;&#x5F88;&#x96BE;&#x6539;&#x53D8;&#x522B;&#x4EBA;&#x5728;&#x51B2;&#x7A81;&#x4E2D;&#x7684;&#x8868;&#x73B0;&#xFF0C;<strong>&#x4F46;&#xFF0C;&#x4F60;&#x80FD;&#x6539;&#x53D8;&#x81EA;&#x5DF1;&#x7684;&#x8868;&#x73B0;&#x3002;</strong></p>
</blockquote>
<p>&#x6B63;&#x5E38;&#x6211;&#x4EEC;&#x9762;&#x5BF9;&#x51B2;&#x7A81;&#x53EF;&#x80FD;&#x5982;&#x4E0B;&#x51E0;&#x4E2A;&#x8868;&#x73B0;&#xFF1A;</p>
<ol>
<li>&#x5FFD;&#x89C6;&#x51B2;&#x7A81;</li>
<li>&#x8FC1;&#x5C31;&#x522B;&#x4EBA;</li>
<li>&#x5F3A;&#x8FEB;&#x522B;&#x4EBA;</li>
<li>&#x59A5;&#x534F;</li>
</ol>
<p>&#x4F46;&#x5176;&#x5B9E;&#x8FD9;&#x90FD;&#x662F;&#x300C;&#x65E0;&#x6548;&#x7684;&#x793E;&#x4EA4;&#x65B9;&#x5F0F;&#x300D;&#xFF0C;&#x6709;&#x6548;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x300C;&#x534F;&#x540C;&#x300D;&#xFF0C;&#x901A;&#x8FC7;&#x5766;&#x8BDA;&#x7684;&#x6C9F;&#x901A;&#xFF0C;&#x4E86;&#x89E3;&#x53CC;&#x65B9;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x52AA;&#x529B;&#x627E;&#x5230;&#x53CC;&#x8D62;&#x7684;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x4E66;&#x4E2D;&#x6838;&#x5FC3;&#x7684;&#x89C2;&#x70B9;&#x53EF;&#x4EE5;&#x603B;&#x7ED3;&#x4E3A;&#x4E24;&#x70B9;&#xFF08;&#x989D;&#x5916;&#x53C2;&#x8003;&#x4F5C;&#x8005;&#x7684;<a href="https://www.youtube.com/watch?v=WfQeH3092Sc" target="_blank" rel="noopener">TED&#x6F14;&#x8BB2;</a>&#xFF09;</p>
<ol>
<li>&#x5FFD;&#x7565;&#x51B2;&#x7A81;&#xFF0C;&#x4E0D;&#x8981;&#x8BA9;&#x4F60;&#x7684;&#x8C08;&#x8BDD;&#x53D7;&#x5230;&#x60C5;&#x7EEA;&#x548C;&#x51B2;&#x7A81;&#x7684;&#x5F71;&#x54CD;&#x3002;</li>
<li>&#x4FDD;&#x6301;&#x597D;&#x5947;&#x5FC3;&#xFF0C;&#x6301;&#x7EED;&#x7684;&#x4E86;&#x89E3;&#x5BF9;&#x65B9;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x4EA7;&#x751F;&#x60C5;&#x7EEA;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x8FDB;&#x800C;&#x627E;&#x5230;&#x66F4;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</li>
</ol>
<p>&#x7B2C;&#x4E00;&#x70B9;&#x662F;&#x4E00;&#x79CD;&#x300C;&#x51FA;&#x300D;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x8DF3;&#x51FA;&#x60C5;&#x7EEA;&#x7684;&#x67B7;&#x9501;&#xFF0C;&#x7B2C;&#x4E8C;&#x70B9;&#x662F;&#x4E00;&#x79CD;&#x300C;&#x5165;&#x300D;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4E3B;&#x52A8;&#x7684;&#x9700;&#x6C42;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x6211;&#x81EA;&#x5DF1;&#x7406;&#x89E3;&#x7684;&#x6700;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x89E3;&#x51B3;&#x51B2;&#x7A81;&#x7684;&#x65B9;&#x6CD5;(&#x540E;&#x8005;&#x53EB;&#x516C;&#x5F0F;)&#xFF1A;</p>
<ol>
<li>&#x7406;&#x89E3;&#x5BF9;&#x65B9;&#x7684;&#x9700;&#x6C42;&#x548C;&#x5229;&#x76CA;&#x3002;</li>
<li>&#x591A;&#x8046;&#x542C;&#xFF0C;&#x591A;&#x8BE2;&#x95EE;&#xFF0C;&#x6316;&#x51FA;&#x5176;&#x6838;&#x5FC3;&#x9700;&#x6C42;&#x3002;</li>
<li>&#x4E0D;&#x8F7B;&#x6613;&#x4E0B;&#x7ED3;&#x8BBA;&#xFF08;&#x7ED3;&#x8BBA;&#x6027;&#x5185;&#x5BB9;&#xFF0C;&#x6BD4;&#x5982;&#x7ED9;&#x7ED3;&#x8BBA;&#xFF0C;&#x5EFA;&#x8BAE;&#xFF0C;&#x8BC4;&#x4EF7;&#x7B49;&#xFF09;&#xFF0C;&#x800C;&#x662F;&#x7ED9;&#x51FA;&#x89C2;&#x5BDF;&#x7ED3;&#x8BBA;&#xFF0C;&#x5BA2;&#x89C2;&#x60C5;&#x51B5;&#x548C;&#x81EA;&#x5DF1;&#x7684;&#x6001;&#x5EA6;&#x3002;</li>
<li>&#x660E;&#x786E;&#x7ED3;&#x8BBA;&#x3002;</li>
</ol>
<h3 id="&#x7406;&#x89E3;&#x5BF9;&#x65B9;&#x7684;&#x9700;&#x6C42;&#x548C;&#x5229;&#x76CA;">&#x7406;&#x89E3;&#x5BF9;&#x65B9;&#x7684;&#x9700;&#x6C42;&#x548C;&#x5229;&#x76CA;</h3>
<p>&#x672C;&#x4E66;&#x6211;&#x89C9;&#x5F97;&#x6700;&#x4F18;&#x4EF7;&#x503C;&#x7684;&#x90E8;&#x5206;&#x5C31;&#x662F;&#x7B2C;&#x56DB;&#x4E2A;principle&#xFF1A;&#x300C;&#x533A;&#x5206;&#x9700;&#x6C42;&#xFF0C;&#x5229;&#x76CA;&#x548C;&#x884C;&#x52A8;&#x8BA1;&#x5212;&#x300D;&#x3002;&#x4EBA;&#x4EEC;&#x4E00;&#x822C;&#x505A;&#x4E8B;&#x60C5;&#xFF0C;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x884C;&#x52A8;&#x8BA1;&#x5212;&#x6216;&#x7ED3;&#x8BBA;&#x591A;&#x6570;&#x6709;&#x5176;&#x80CC;&#x540E;&#x7684;&#x4E00;&#x5957;&#x9700;&#x6C42;&#x548C;&#x5229;&#x76CA;&#x505A;&#x652F;&#x6491;&#x3002;&#x6309;&#x4E66;&#x4E2D;&#x7684;&#x7FFB;&#x8BD1;&#x6765;&#x8BB2;&#xFF0C;&#x300C;&#x9700;&#x6C42;&#x300D;&#x662F;&#x6700;&#x5BBD;&#x6CDB;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6BD4;&#x5982;&#x60F3;&#x8981;&#x5F97;&#x5230;&#x523A;&#x6FC0;&#x7684;&#x751F;&#x6D3B;&#xFF1B;&#x300C;&#x5229;&#x76CA;&#x300D;&#x8FDB;&#x4E00;&#x6B65;&#x7EC6;&#x5316;&#x76EE;&#x6807;&#xFF0C;&#x6BD4;&#x5982;&#x60F3;&#x8981;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x57CE;&#x5E02;&#x751F;&#x6D3B;&#xFF1B;&#x4E4B;&#x540E;&#x624D;&#x6709;&#x5BF9;&#x5E94;&#x7684;&#x884C;&#x52A8;&#x3002;&#x6211;&#x4EEC;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x90FD;&#x5728;<strong>&#x4E0D;&#x4E86;&#x89E3;&#x5BF9;&#x65B9;&#x9700;&#x6C42;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x53BB;&#x4E89;&#x6267;&#x5BF9;&#x65B9;&#x7684;&#x884C;&#x52A8;&#x662F;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;</strong>&#x3002;</p>
<p>&#x57FA;&#x4E8E;&#x8FD9;&#x6837;&#x5B50;&#x5206;&#x6790;&#x6709;&#x51E0;&#x4E2A;&#x89C2;&#x70B9;&#xFF1A;</p>
<ol>
<li>
<p>&#x533A;&#x522B;&#x9700;&#x6C42;&#xFF0C;&#x5229;&#x76CA;&#xFF0C;&#x548C;&#x8BA1;&#x5212;&#x3002;</p>
</li>
<li>
<p>&#x60F3;&#x529E;&#x6CD5;&#x4E86;&#x89E3;&#x5230;&#x80CC;&#x540E;&#x5B9E;&#x9645;&#x7684;&#x9700;&#x6C42;&#x548C;&#x5229;&#x76CA;&#x3002;</p>
<p>&#x591A;&#x7528;&#x8BE2;&#x95EE;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4E0D;&#x8981;&#x6B66;&#x65AD;&#x5BF9;&#x65B9;&#x7684;&#x9700;&#x6C42;&#x548C;&#x5229;&#x76CA;&#xFF0C;&#x6BD4;&#x5982;&#x53EF;&#x4EE5;&#x7ECF;&#x5E38;&#x8FD9;&#x4E48;&#x95EE;&#x300C;&#x6240;&#x4EE5;&#xFF0C;&#x4F60;&#x662F;&#x60F3;&#x8FD9;&#x6837;&#x5B50;&#x505A;&#x5BF9;&#x5417;&#xFF1F;&#x4F60;&#x7684;&#x91CD;&#x70B9;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x300D;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4EA4;&#x6D41;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E5F;&#x8981;&#x60F3;&#x529E;&#x6CD5;&#x544A;&#x8BC9;&#x522B;&#x4EBA;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x6C42;&#x3002;</p>
</li>
<li>
<p>&#x5BFB;&#x6C42;&#x7B26;&#x5408;&#x53CC;&#x65B9;&#x9700;&#x6C42;&#x7684;&#x8BA1;&#x5212;&#x3002;</p>
<p>&#x8981;&#x77E5;&#x9053;&#x9700;&#x6C42;&#x548C;&#x5229;&#x76CA;&#x4E0D;&#x592A;&#x5BB9;&#x6613;&#x6539;&#x53D8;&#xFF0C;&#x4F46;&#x662F;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x76EE;&#x7684;&#x7684;&#x884C;&#x52A8;&#x8BA1;&#x5212;&#x5374;&#x6709;&#x5F88;&#x591A;&#x53EF;&#x80FD;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x7ECF;&#x5E38;&#x95EE;&#x4E00;&#x4E0B;<strong>&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x6709;&#x522B;&#x7684;&#x66F4;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x6216;&#x8005;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#x5462;&#xFF1F;</strong></p>
</li>
</ol>
<h3 id="&#x591A;&#x8046;&#x542C;&#x591A;&#x8BE2;&#x95EE;">&#x591A;&#x8046;&#x542C;&#xFF0C;&#x591A;&#x8BE2;&#x95EE;</h3>
<p>&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x4E86;&#x6838;&#x5FC3;&#x7684;&#x76EE;&#x7684;&#x6216;&#x8005;&#x9700;&#x6C42;&#xFF0C;&#x4E0B;&#x9762;&#x5C31;&#x662F;&#x6C9F;&#x901A;&#x6280;&#x5DE7;&#x548C;&#x6280;&#x827A;&#x7684;&#x95EE;&#x9898;&#x4E86;&#x3002;</p>
<p>&#x591A;&#x8046;&#x542C;&#x5C31;&#x4E0D;&#x591A;&#x8BF4;&#x4E86;&#xFF0C;&#x4E0D;&#x8981;&#x8F7B;&#x6613;&#x6253;&#x65AD;&#x522B;&#x4EBA;&#x7684;&#x5BF9;&#x8BDD;&#xFF0C;&#x8FD9;&#x6837;&#x5B50;&#x4E0D;&#x4EC5;&#x7ED9;&#x522B;&#x4EBA;&#x5C0A;&#x91CD;&#xFF0C;&#x4E5F;&#x5927;&#x5927;&#x964D;&#x4F4E;&#x522B;&#x4EBA;&#x53EF;&#x80FD;&#x4E0D;&#x6109;&#x60A6;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x70B9;&#x4E5F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x5C31;&#x662F;&#x8981;&#x7ED9;&#x51FA;&#x6B63;&#x9762;&#x7684;&#x786E;&#x8BA4;&#x3002;&#x6458;&#x5F55;&#x4E66;&#x4E2D;&#x539F;&#x8BDD;&#xFF1A;</p>
<blockquote>
<p>&#x5373;&#x4FBF;&#x4F60;&#x5B8C;&#x5168;&#x4E0D;&#x8D5E;&#x540C;&#x5BF9;&#x65B9;&#x6240;&#x8BF4;&#x7684;&#x8BDD;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x786E;&#x8BA4;&#x4ED6;/&#x5979;&#x7684;&#x7ACB;&#x573A;&#x6216;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#xFF0C;&#x9996;&#x5148;&#x8981;&#x8BA9;&#x5BF9;&#x65B9;&#x77E5;&#x9053;&#xFF0C;&#x4F60;&#x51C6;&#x786E;&#x63A5;&#x6536;&#x5230;&#x4E86;&#x4ED6;/&#x5979;&#x4F20;&#x9012;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4F60;&#x542C;&#x61C2;&#x4E86;&#x4ED6;&#x4EEC;&#x7684;&#x8BDD;&#xFF0C;&#x8FD9;&#x6837;&#x4ED6;&#x4EEC;&#x624D;&#x80FD;&#x505C;&#x6B62;&#x5411;&#x4F60;&#x8BC9;&#x8BF4;&#xFF0C;&#x800C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x6295;&#x5165;&#x5230;&#x4E00;&#x6BB5;&#x66F4;&#x6709;&#x6210;&#x6548;&#x7684;&#x5BF9;&#x8BDD;&#x4E2D;&#x3002;</p>
</blockquote>
<p>&#x5176;&#x5B9E;&#x6C9F;&#x901A;&#x7684;&#x76EE;&#x7684;&#x4E0D;&#x5C31;&#x662F;&#x4F20;&#x9012;&#x89C2;&#x70B9;&#x561B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x7ED9;&#x5BF9;&#x65B9;&#x65F6;&#x95F4;&#x8BF4;&#x6E05;&#x695A;&#xFF0C;&#x90A3;&#x5BF9;&#x65B9;&#x4E00;&#x5B9A;&#x4F1A;&#x4E0D;&#x8212;&#x670D;&#x3002;&#x800C;&#x9002;&#x5F53;&#x7684;&#x786E;&#x8BA4;&#x4FE1;&#x606F;&#x53EF;&#x52A0;&#x901F;&#x5BF9;&#x65B9;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x8BF4;&#x6E05;&#x695A;&#x4E86;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x8BA9;&#x5BF9;&#x65B9;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x5F97;&#x5230;&#x4E86;&#x8BE5;&#x6709;&#x7684;&#x5C0A;&#x91CD;&#xFF0C;&#x4E3A;&#x8FDB;&#x4E00;&#x6B65;&#x6709;&#x6548;&#x6C9F;&#x901A;&#x505A;&#x597D;&#x4E86;&#x51C6;&#x5907;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x4E24;&#x79CD;&#x6C9F;&#x901A;&#x65B9;&#x5F0F;&#x662F;&#x76F8;&#x8F85;&#x76F8;&#x6210;&#x7684;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x7ECF;&#x5E38;&#x7528;&#x8FD9;&#x6837;&#x5B50;&#x7684;&#x8BED;&#x53E5;&#x6765;&#x8868;&#x8FBE;&#x786E;&#x8BA4;&#xFF1A;</p>
<ol>
<li>&#x5982;&#x679C;&#x540C;&#x610F;&#x89C2;&#x70B9;&#xFF1A;&#x300C;&#x4F60;&#x8BA4;&#x4E3A;xxx&#x662F;&#x4E00;&#x79CD;&#x6709;&#x6548;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6211;&#x975E;&#x5E38;&#x8BA4;&#x540C;&#x3002;&#x300D;</li>
<li>&#x5982;&#x679C;&#x4E0D;&#x540C;&#x610F;&#x89C2;&#x70B9;&#xFF1A;&#x300C;&#x6240;&#x4EE5;&#x6211;&#x7406;&#x89E3;&#x4E00;&#x4E0B;&#x5C31;&#x662F;&#x4F60;&#x662F;xxx&#x60F3;&#x7684;&#xFF0C;&#x5BF9;&#x5427;&#xFF1F;&#x4E3A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x4F60;&#x6700;&#x5728;&#x610F;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#xFF08;&#x4E0D;&#x8868;&#x793A;&#x540C;&#x610F;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x77E5;&#x9053;&#x4F60;&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x4E14;&#x6709;&#x5174;&#x8DA3;&#x8FDB;&#x884C;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x6316;&#x6398;&#xFF09;&#x300D;</li>
</ol>
<p>&#x591A;&#x8BE2;&#x95EE;&#x548C;&#x4E0A;&#x9762;&#x8BF4;&#x7684;&#x5DEE;&#x4E0D;&#x591A;&#xFF0C;&#x4E5F;&#x548C;&#x4E0B;&#x9762;&#x8BF4;&#x7684;&#x4E0D;&#x8F7B;&#x6613;&#x4E0B;&#x7ED3;&#x8BBA;&#x8054;&#x7CFB;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E0D;&#x8981;&#x6B66;&#x65AD;&#x7684;&#x7ED9;&#x51FA;&#x7ED3;&#x8BBA;&#xFF0C;&#x591A;&#x95EE;&#x95EE;&#x5BF9;&#x65B9;&#xFF0C;&#x5F81;&#x8BE2;&#x7684;&#x65B9;&#x5F0F;&#x53BB;&#x6C9F;&#x901A;&#xFF0C;&#x6316;&#x6398;&#x66F4;&#x591A;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4E5F;&#x662F;&#x4E3A;&#x8FDB;&#x4E00;&#x6B65;&#x8FBE;&#x6210;&#x53CC;&#x8D62;&#x7684;&#x5C40;&#x9762;&#x505A;&#x597D;&#x51C6;&#x5907;&#x3002;&#x8FD9;&#x70B9;&#x5176;&#x5B9E;&#x548C;&#x4F5C;&#x8005;&#x8BF4;&#x7684;&#x597D;&#x5947;&#x5FC3;&#x5BF9;&#x5E94;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x6709;&#x60C5;&#x7EEA;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E5F;&#x8981;<strong>&#x5FCD;&#x4F4F;&#x653B;&#x51FB;&#x7684;&#x51B2;&#x52A8;&#xFF0C;&#x53D1;&#x81EA;&#x5185;&#x5FC3;&#x7684;&#x53BB;&#x6539;&#x53D8;&#x5BF9;&#x8BDD;&#xFF0C;&#x5B66;&#x4F1A;&#x53BB;&#x8BE2;&#x95EE;&#xFF0C;&#x5B66;&#x4F1A;&#x8046;&#x542C;&#xFF0C;&#x8FDB;&#x800C;&#x57F9;&#x517B;&#x6211;&#x4EEC;&#x9762;&#x5BF9;&#x81EA;&#x5DF1;&#x4E0D;&#x559C;&#x6B22;&#xFF0C;&#x6050;&#x60E7;&#x6216;&#x8005;&#x4E0D;&#x8D5E;&#x6210;&#x4E1C;&#x897F;&#x7684;&#x610F;&#x613F;&#x548C;&#x80FD;&#x529B;&#x3002;</strong></p>
<h3 id="&#x4E0D;&#x8F7B;&#x6613;&#x4E0B;&#x7ED3;&#x8BBA;">&#x4E0D;&#x8F7B;&#x6613;&#x4E0B;&#x7ED3;&#x8BBA;</h3>
<p>&#x8FD9;&#x4E2A;&#x5185;&#x5BB9;&#xFF0C;&#x4E66;&#x4E2D;&#x597D;&#x591A;&#x5EFA;&#x8BAE;&#x90FD;&#x6709;&#x6D89;&#x53CA;&#xFF0C;&#x5176;&#x5B9E;&#x6838;&#x5FC3;&#x7684;&#x6838;&#x5FC3;&#x5C31;&#x662F;&#x4EBA;&#x6027;&#xFF1A;&#x300C;&#x4EBA;&#x7C7B;&#x90FD;&#x4E0D;&#x559C;&#x6B22;&#x88AB;&#x4EBA;&#x6279;&#x8BC4;&#xFF0C;&#x88AB;&#x4EBA;&#x770B;&#x900F;&#xFF0C;&#x8D34;&#x6807;&#x7B7E;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x5584;&#x610F;&#x7684;&#x6279;&#x8BC4;&#x548C;&#x51FA;&#x4E8E;&#x597D;&#x610F;&#x7684;&#x63D0;&#x793A;&#x3002;&#x300D;</p>
<p>&#x5373;&#x4F7F;&#x662F;&#x7ED9;&#x597D;&#x7684;&#x5EFA;&#x8BAE;&#x8FD9;&#x6837;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x5176;&#x5B9E;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#x4E5F;&#x662F;&#x4E0D;&#x53D7;&#x5F85;&#x89C1;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x7ED9;&#x5EFA;&#x8BAE;&#x7B49;&#x4EF7;&#x4E8E;&#x7ED9;&#x5BF9;&#x65B9;&#x6279;&#x8BC4;&#xFF0C;&#x6709;&#x6559;&#x5BFC;&#x7684;&#x5ACC;&#x7591;&#xFF0C;&#x6240;&#x4EE5;&#x597D;&#x4E3A;&#x4EBA;&#x5E08;&#x5176;&#x5B9E;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x4E0D;&#x597D;&#x7684;&#x884C;&#x4E3A;&#x3002;&#x4E66;&#x4E2D;&#x7ED9;&#x51FA;&#x7684;&#x5EFA;&#x8BAE;&#x662F;&#xFF1A;</p>
<blockquote>
<p>&#x4E0D;&#x8981;&#x8BD5;&#x56FE;&#x7EA0;&#x6B63;&#x5BF9;&#x65B9;&#x6216;&#x8005;&#x5BF9;&#x5176;&#x63D0;&#x51FA;&#x5EFA;&#x8BAE;&#xFF0C;&#x95EE;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x6765;&#x5E2E;&#x52A9;&#x4ED6;/&#x5979;&#x628A;&#x4E8B;&#x60C5;&#x6446;&#x5728;&#x5927;&#x5BB6;&#x9762;&#x524D;&#x3002;</p>
</blockquote>
<p>&#x5176;&#x5B9E;&#x601D;&#x8DEF;&#x5C31;&#x662F;&#x4E0D;&#x8981;&#x6E05;&#x6670;&#x7ED9;&#x7ED3;&#x8BBA;&#xFF0C;&#x5EFA;&#x8BAE;&#xFF0C;&#x800C;&#x662F;&#x95EE;&#xFF1F;&#x4F60;&#x60F3;&#x8981;&#x4EC0;&#x4E48;&#xFF1F;&#x4F60;&#x662F;&#x4E0D;&#x662F;&#x8FD9;&#x6837;&#x5B50;&#x60F3;&#xFF1F;&#x4E3A;&#x5565;&#x4F60;&#x89C9;&#x5F97;&#x6709;&#x538B;&#x529B;&#x4E86;&#xFF1F;&#x8FD9;&#x6837;&#x5B50;&#x5E2E;&#x52A9;&#x5BF9;&#x65B9;&#x6316;&#x6398;&#x9700;&#x6C42;&#xFF0C;&#x628A;&#x95EE;&#x9898;&#x6446;&#x51FA;&#x6765;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8F7B;&#x6613;&#x7684;&#x7ED9;&#x51FA;&#x5EFA;&#x8BAE;&#x8BF4;&#x4F60;&#x6700;&#x597D;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x7B49;&#x5EFA;&#x8BAE;&#x6027;&#x8BED;&#x8A00;&#xFF0C;&#x5BF9;&#x4E8E;&#x6C9F;&#x901A;&#x7684;&#x521D;&#x671F;&#x8FC7;&#x7A0B;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x66F4;&#x6709;&#x5EFA;&#x8BBE;&#x6027;&#x3002;</p>
<p>&#x4E66;&#x4E2D;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;principle&#x8BF4;&#x7684;&#x975E;&#x5E38;&#x7684;&#x597D;&#xFF0C;&#x5C31;&#x662F;&#x300C;&#x533A;&#x522B;&#x8BC4;&#x4EF7;&#x548C;&#x89C2;&#x5BDF;&#x7ED3;&#x8BBA;&#x300D;&#x3002;</p>
<p>&#x8BC4;&#x4EF7;&#x5C31;&#x662F;&#x7C7B;&#x4F3C;&#x4E8E;&#x7ED3;&#x8BBA;&#x6027;&#x7684;&#x4E1C;&#x897F;&#xFF0C;<strong>&#x7ED3;&#x5408;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x4E3B;&#x89C2;&#x5224;&#x65AD;</strong>&#xFF0C;&#x8FD9;&#x6837;&#x5B50;&#x4F1A;&#x5BB9;&#x6613;&#x6FC0;&#x8D77;&#x522B;&#x4EBA;&#x7684;&#x300C;&#x653B;&#x51FB;-&#x9632;&#x536B;&#x6A21;&#x5F0F;&#x300D;&#x3002;&#x800C;&#x89C2;&#x5BDF;&#x7ED3;&#x8BBA;&#x662F;&#x4E00;&#x79CD;&#x5BA2;&#x89C2;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6BD4;&#x5982;&#x5F53;&#x4E8B;&#x4EBA;&#x7684;&#x884C;&#x4E3A;&#x5BFC;&#x81F4;&#x7684;&#x884C;&#x4E3A;&#x3002;&#x8FDB;&#x800C;&#x8868;&#x8FBE;&#x81EA;&#x5DF1;&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x4F1A;&#x66F4;&#x52A0;&#x300C;&#x6709;&#x7406;&#x6709;&#x636E;&#x300D;&#xFF0C;&#x4E5F;&#x5BB9;&#x6613;&#x8BA9;&#x4EBA;&#x63A5;&#x6536;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#xFF0C;&#x67D0;&#x4EBA;&#x8BF4;&#x8BDD;&#x603B;&#x662F;&#x627E;&#x6211;&#x9EBB;&#x70E6; : &#x300C;&#x8BC4;&#x4EF7;&#x300D;- &#x4F60;&#x8FD9;&#x4EBA;&#x8FD9;&#x4E48;&#x8FD9;&#x4E48;&#x8BA8;&#x538C;&#x603B;&#x662F;&#x7ED9;&#x6211;&#x9EBB;&#x70E6;&#xFF1B;&#x300C;&#x89C2;&#x5BDF;&#x7ED3;&#x8BBA;&#x300D;- &#x4F60;&#x4ECA;&#x5929;&#x4E0A;&#x5348;&#x5728;&#x90A3;&#x4E48;&#x591A;&#x4EBA;&#x9762;&#x524D;&#x5BF9;&#x6211;&#x5927;&#x558A;&#x5927;&#x53EB;&#xFF0C;&#x7ED9;&#x4E86;&#x6211;&#x4E0D;&#x5C11;&#x9EBB;&#x70E6;&#xFF0C;&#x6211;&#x5F88;&#x8BA8;&#x538C;&#x8FD9;&#x6837;&#x5B50;&#x3002;&#x5982;&#x679C;&#x6709;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF0C;&#x5E0C;&#x671B;&#x4F60;&#x53EF;&#x4EE5;&#x79C1;&#x4E0B;&#x548C;&#x6211;&#x4EA4;&#x8C08;&#x3002;</p>
<p>&#x603B;&#x7ED3;&#x7684;&#x8BDD;&#xFF0C;&#x76F4;&#x63A5;&#x6458;&#x5F55;&#x4E66;&#x4E2D;&#x7684;&#x539F;&#x8BDD;&#xFF0C;&#x8BF4;&#x7684;&#x975E;&#x5E38;&#x5230;&#x4F4D;&#xFF08;p122):</p>
<blockquote>
<p>&#x6291;&#x5236;&#x81EA;&#x5DF1;&#x60F3;&#x8981;&#x8BC4;&#x4EF7;&#x5BF9;&#x65B9;&#x7684;&#x610F;&#x56FE;&#x6216;&#x6027;&#x683C;&#x7684;&#x51B2;&#x52A8;&#x3002;&#x5373;&#x4F7F;&#x4F60;&#x8BA4;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x8BC4;&#x4EF7;&#x662F;&#x5BF9;&#x7684;&#xFF0C;&#x4E5F;&#x53EA;&#x4F1A;&#x8BA9;&#x5C40;&#x52BF;&#x8D8A;&#x6765;&#x8D8A;&#x7D27;&#x5F20;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x4FC3;&#x8FDB;&#x53CC;&#x65B9;&#x7684;&#x76F8;&#x4E92;&#x7406;&#x89E3;&#x3002;&#x4F60;&#x8981;&#x505A;&#x7684;&#x662F;&#x8BF4;&#x51FA;<strong>&#x4F60;&#x89C2;&#x5BDF;&#x548C;&#x4F53;&#x4F1A;&#x5230;&#x7684;&#x4E1C;</strong>&#x897F;&#xFF0C;&#x627E;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x6E05;&#x6670;&#x5730;&#x8868;&#x660E;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x8BA9;&#x4F60;&#x611F;&#x5230;&#x5F88;&#x751F;&#x6C14;&#x3002;&#x628A;&#x751F;&#x6C14;&#x7684;&#x529B;&#x6C14;&#x62FF;&#x6765;<strong>&#x51C6;&#x786E;&#x5730;&#x8868;&#x8FF0;&#x5BF9;&#x65B9;&#x7684;&#x884C;&#x4E3A;&#x5BF9;&#x4F60;&#x4EA7;&#x751F;&#x7684;&#x5F71;&#x54CD;&#x548C;&#x5176;&#x4E2D;&#x7684;&#x539F;&#x56E0;&#x3002;<strong>&#x4E0D;&#x8981;&#x7528;&#x63A7;&#x8BC9;&#xFF0C;&#x8D23;&#x5907;&#x6216;&#x8005;&#x8D34;&#x6807;&#x7B7E;&#x7B49;&#x65B9;&#x5F0F;&#x7ED9;</strong>&#x5BF9;&#x65B9;&#x4E0B;&#x7ED3;&#x8BBA;</strong>&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x4F60;&#x624D;&#x80FD;&#x4E3A;<strong>&#x53CC;&#x65B9;&#x7559;&#x6709;&#x4F59;&#x5730;</strong>&#xFF0C;&#x907F;&#x514D;&#x8FDB;&#x5165;<strong>&#x653B;&#x51FB;-&#x9632;&#x536B;&#x7684;&#x601D;&#x7EF4;&#x5B9A;&#x5F0F;</strong></p>
</blockquote>
<p>&#x8BF4;&#x7684;&#x975E;&#x5E38;&#x5230;&#x4F4D;&#xFF0C;&#x4E4B;&#x524D;&#x7684;&#x6240;&#x6709;&#x63CF;&#x8FF0;&#x90FD;&#x662F;&#x5904;&#x4E8E;&#x4E00;&#x79CD;&#x300C;&#x7167;&#x987E;&#x522B;&#x4EBA;&#xFF0C;&#x5C06;&#x5FC3;&#x6BD4;&#x5FC3;&#x300D;&#x7684;&#x601D;&#x7EF4;&#x53BB;&#x6C9F;&#x901A;&#xFF0C;&#x800C;&#x8FD9;&#x70B9;&#x5C31;&#x662F;&#x300C;&#x6709;&#x7406;&#x6709;&#x636E;&#xFF0C;&#x6709;&#x6C14;&#x6709;&#x8282;&#x300D;&#x7684;&#x8868;&#x8FBE;&#x81EA;&#x5DF1;&#x7684;&#x89C2;&#x70B9;&#x548C;&#x6001;&#x5EA6;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x8FD9;&#x70B9;&#x975E;&#x5E38;&#x503C;&#x5F97;&#x53BB;&#x4F53;&#x4F1A;&#x548C;&#x5B66;&#x4E60;&#x5E94;&#x7528;&#x3002;</p>
<h3 id="&#x8FBE;&#x6210;&#x4E00;&#x81F4;">&#x8FBE;&#x6210;&#x4E00;&#x81F4;</h3>
<p>&#x8FD9;&#x70B9;&#x6211;&#x5C31;&#x4E0D;&#x591A;&#x603B;&#x7ED3;&#x4E86;&#xFF0C;&#x6BD4;&#x8F83;&#x901A;&#x7528;&#xFF0C;&#x660E;&#x786E;&#x4E86;&#x5BF9;&#x65B9;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x57FA;&#x4E8E;&#x5C0A;&#x91CD;&#x5BF9;&#x65B9;&#x8046;&#x542C;&#x7684;&#x4EA4;&#x6D41;&#x65B9;&#x5F0F;&#xFF0C;&#x8868;&#x8FBE;&#x4E86;&#x81EA;&#x5DF1;&#x6709;&#x7406;&#x6709;&#x636E;&#x7684;&#x89C2;&#x70B9;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x662F;&#x5BFB;&#x6C42;&#x4E00;&#x79CD;&#x53CC;&#x8D62;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x5C31;&#x548C;&#x524D;&#x9762;&#x8BF4;&#x7684;&#x4E00;&#x6837;&#xFF0C;&#x5229;&#x76CA;&#x548C;&#x9700;&#x6C42;&#x53EF;&#x80FD;&#x4E0D;&#x592A;&#x5BB9;&#x6613;&#x6539;&#x53D8;&#xFF0C;&#x4F46;&#x662F;&#x884C;&#x4E3A;&#x5374;&#x53EF;&#x4EE5;&#x3002;&#x53EF;&#x4EE5;&#x591A;&#x8BE2;&#x95EE;&#xFF1A;&#x300C;&#x6211;&#x4EEC;&#x662F;&#x4E0D;&#x662F;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x5373;&#x53EF;&#x4EE5;&#x6EE1;&#x8DB3;A&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6EE1;&#x8DB3;B&#x5462;&#xFF1F;&#x300D;</p>
<p>&#x6700;&#x540E;&#x5C31;&#x662F;&#x548C;&#x5BF9;&#x65B9;&#x300C;&#x786E;&#x8BA4;&#x6700;&#x540E;&#x7684;&#x65B9;&#x6848;&#x300D;&#xFF0C;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x7684;&#x610F;&#x89C1;&#xFF0C;&#x660E;&#x786E;&#x53EF;&#x80FD;&#x7684;&#x4E0D;&#x6E05;&#x695A;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4E3A;&#x4EE5;&#x540E;&#x907F;&#x514D;&#x8FDB;&#x4E00;&#x6B65;&#x51B2;&#x7A81;&#x6253;&#x597D;&#x9884;&#x9632;&#x9488;&#x3002;&#x6BD4;&#x5982;&#x53EF;&#x4EE5;&#x591A;&#x8BF4;&#x4E00;&#x53E5;&#xFF1A;&#x300C;&#x90A3;&#x4E48;&#xFF0C;&#x8BA9;&#x6211;&#x91CD;&#x65B0;&#x6838;&#x5B9E;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x5404;&#x4F4D;&#x90FD;&#x6E05;&#x695A;&#x660E;&#x767D;&#xFF0C;&#x597D;&#x561B;&#xFF1F;&#x300D;</p>

      
    </div>

    

    
    
    

    

    

    
      <div>
        <ul class="post-copyright">
  <li class="post-copyright-author">
    <strong>本文作者： </strong>whiledoing</li>
  <li class="post-copyright-link">
    <strong>本文链接：</strong>
    <a href="http://whiledoing.me/2016/08/07/book-change-the-conversation-learn-note/" title="《解决冲突的关键技巧》读书笔记">http://whiledoing.me/2016/08/07/book-change-the-conversation-learn-note/</a>
  </li>
  <li class="post-copyright-license">
    <strong>版权声明： </strong>本博客所有文章除特别声明外，均采用 <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/" rel="external nofollow" target="_blank">CC BY-NC-SA 4.0</a> 许可协议。转载请注明出处！</li>
</ul>

      </div>
    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/自写/" rel="tag"># 自写</a>
          
            <a href="/tags/读书笔记/" rel="tag"># 读书笔记</a>
          
            <a href="/tags/心理学/" rel="tag"># 心理学</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/06/28/book-thinking-about-running-md/" rel="next" title="《当我跑步时我谈些什么》读书笔记">
                <i class="fa fa-chevron-left"></i> 《当我跑步时我谈些什么》读书笔记
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/12/03/learn-javascript/" rel="prev" title="javascript学习笔记">
                javascript学习笔记 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <img class="site-author-image" itemprop="image"
                src="/images/avatar.jpeg"
                alt="whiledoing" />
            
              <p class="site-author-name" itemprop="name">whiledoing</p>
              <p class="site-description motion-element" itemprop="description">喜欢一切简单且美的事物，包括人。</p>
          </div>

          
            <nav class="site-state motion-element">
              
                <div class="site-state-item site-state-posts">
                
                  <a href="/archives/">
                
                    <span class="site-state-item-count">51</span>
                    <span class="site-state-item-name">日志</span>
                  </a>
                </div>
              

              

              
                
                
                <div class="site-state-item site-state-tags">
                  <a href="/tags/index.html">
                    
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                    <span class="site-state-item-count">29</span>
                    <span class="site-state-item-name">标签</span>
                  </a>
                </div>
              
            </nav>
          

          

          
            <div class="links-of-author motion-element">
              
                <span class="links-of-author-item">
                  <a href="https://github.com/whiledoing" target="_blank" title="GitHub">GitHub</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="http://www.douban.com/people/58249409" target="_blank" title="豆瓣">豆瓣</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="https://www.zhihu.com/people/whiledoing" target="_blank" title="知乎">知乎</a>
                  
                </span>
              
            </div>
          

          
          

          
          

          
            
          
          

        </div>
      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-3"><a class="nav-link" href="#理解对方的需求和利益"><span class="nav-number">1.</span> <span class="nav-text">理解对方的需求和利益</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#多聆听多询问"><span class="nav-number">2.</span> <span class="nav-text">多聆听，多询问</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#不轻易下结论"><span class="nav-number">3.</span> <span class="nav-text">不轻易下结论</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#达成一致"><span class="nav-number">4.</span> <span class="nav-text">达成一致</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; 2016 &mdash; <span itemprop="copyrightYear">2018</span>
  <span class="with-love" id="animate">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">whiledoing</span>

  

  
</div>




  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动 v3.7.1</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/theme-next/hexo-theme-next">NexT.Mist</a> v6.1.0</div>




        








        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>


























  
  
    <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  


  


  <script type="text/javascript" src="/js/src/utils.js?v=6.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=6.1.0"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=6.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=6.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=6.1.0"></script>



  



	





  





  










  





  

  

  

  
  

  
  

  


  
  

  
  
  
  <script src="/lib/pangu/dist/pangu.min.js?v=3.3"></script>
  <script type="text/javascript">pangu.spacingPage();</script>


  
  <script type="text/javascript" src="/js/src/js.cookie.js?v=6.1.0"></script>
  <script type="text/javascript" src="/js/src/scroll-cookie.js?v=6.1.0"></script>


  

  

  
  <style>
    .copy-btn {
        position: relative;
        display: inline-block;
        padding: 6px 12px;
        font-size: 13px;
        font-weight: 700;
        line-height: 20px;
        color: #333;
        white-space: nowrap;
        vertical-align: middle;
        cursor: pointer;
        background-color: #eee;
        background-image: linear-gradient(#fcfcfc, #eee);
        border: 1px solid #d5d5d5;
        border-radius: 3px;
        user-select: none;
    }

    .highlight {
        position: relative;
    }

    .highlight .copy-btn {
        transition: opacity .3s ease-in-out;
        opacity: 0;
        padding: 2px 6px;
        position: absolute;
        right: 4px;
        top: 8px;
    }

    .highlight:hover .copy-btn,
    .highlight .copy-btn:focus {
        opacity: 1
    }
  </style>
  <script>
    $('.highlight').prepend($('<button>').addClass('copy-btn').append('Copy').on('click', function(e) {
      var code = $(e.target).parent().find('.code').find('.line').map(function(i, e){
        return $(e).text()
      }).toArray().join('\n')
      var ta = document.createElement('textarea')
      document.body.appendChild(ta)
      ta.style.position = 'fixed'
      ta.style.top = 0
      ta.style.left = 0
      ta.value = code
      ta.select()
      ta.focus()
      document.execCommand('copy')
      document.body.removeChild(ta)
    }))
  </script>


</body>
</html>
