<!DOCTYPE html>






  


<html class="theme-next mist use-motion" lang="zh-CN">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=2"/>
<meta name="theme-color" content="#222">






  
  
    
    
  <script src="/lib/pace/pace.min.js?v=1.0.2"></script>
  <link href="/lib/pace/pace-theme-minimal.min.css?v=1.0.2" rel="stylesheet">




  
  
  <link rel="stylesheet" media="all" href="/lib/Han/dist/han.min.css?v=3.3">




<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />






















<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=6.2.0" rel="stylesheet" type="text/css" />


  <link rel="apple-touch-icon" sizes="180x180" href="/images/favicon.png?v=6.2.0">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon.png?v=6.2.0">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon.png?v=6.2.0">


  <link rel="mask-icon" href="/images/logo.svg?v=6.2.0" color="#222">









<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    version: '6.2.0',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":false,"onmobile":false},
    fancybox: false,
    fastclick: false,
    lazyload: false,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>


  




  <meta name="description" content="&amp;#x4ECA;&amp;#x5929;&amp;#x662F;&amp;#x7237;&amp;#x7237;&amp;#x751F;&amp;#x75C5;&amp;#x4F4F;&amp;#x9662;&amp;#x7684;&amp;#x7B2C;24&amp;#x5929;&amp;#x3002; &amp;#x65E9;&amp;#x4E0A;7&amp;#x70B9;&amp;#x8D77;&amp;#x5E8A;&amp;#x53BB;&amp;#x533B;&amp;#x9662;&amp;#xFF0C;&amp;#x5230;&amp;#x4E86;&amp;#x7">
<meta name="keywords" content="日记,爷爷">
<meta property="og:type" content="article">
<meta property="og:title" content="diary-2017-12-08-FRI">
<meta property="og:url" content="http://whiledoing.me/2017/12/11/diary/diary-2017-12-08-FRI/index.html">
<meta property="og:site_name" content="whiledoing">
<meta property="og:description" content="&amp;#x4ECA;&amp;#x5929;&amp;#x662F;&amp;#x7237;&amp;#x7237;&amp;#x751F;&amp;#x75C5;&amp;#x4F4F;&amp;#x9662;&amp;#x7684;&amp;#x7B2C;24&amp;#x5929;&amp;#x3002; &amp;#x65E9;&amp;#x4E0A;7&amp;#x70B9;&amp;#x8D77;&amp;#x5E8A;&amp;#x53BB;&amp;#x533B;&amp;#x9662;&amp;#xFF0C;&amp;#x5230;&amp;#x4E86;&amp;#x7">
<meta property="og:locale" content="zh-CN">
<meta property="og:image" content="http://static.zybuluo.com/whiledoing/4dl3iigkow0jztk86zzpjb55/image_1c10ov9a85oa1l5j18td8q81fo9.png">
<meta property="og:updated_time" content="2018-04-17T13:29:52.977Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="diary-2017-12-08-FRI">
<meta name="twitter:description" content="&amp;#x4ECA;&amp;#x5929;&amp;#x662F;&amp;#x7237;&amp;#x7237;&amp;#x751F;&amp;#x75C5;&amp;#x4F4F;&amp;#x9662;&amp;#x7684;&amp;#x7B2C;24&amp;#x5929;&amp;#x3002; &amp;#x65E9;&amp;#x4E0A;7&amp;#x70B9;&amp;#x8D77;&amp;#x5E8A;&amp;#x53BB;&amp;#x533B;&amp;#x9662;&amp;#xFF0C;&amp;#x5230;&amp;#x4E86;&amp;#x7">
<meta name="twitter:image" content="http://static.zybuluo.com/whiledoing/4dl3iigkow0jztk86zzpjb55/image_1c10ov9a85oa1l5j18td8q81fo9.png">






  <link rel="canonical" href="http://whiledoing.me/2017/12/11/diary/diary-2017-12-08-FRI/"/>



<script type="text/javascript" id="page.configurations">
  CONFIG.page = {
    sidebar: "",
  };
</script>

  <title>diary-2017-12-08-FRI | whiledoing</title>
  




<script async src="https://www.googletagmanager.com/gtag/js?id=UA-117714040-1"></script>
<script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'UA-117714040-1');
</script>



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "https://hm.baidu.com/hm.js?6de2920425778ca5a4ee717be5055e96";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>




  <noscript>
  <style type="text/css">
    .use-motion .motion-element,
    .use-motion .brand,
    .use-motion .menu-item,
    .sidebar-inner,
    .use-motion .post-block,
    .use-motion .pagination,
    .use-motion .comments,
    .use-motion .post-header,
    .use-motion .post-body,
    .use-motion .collection-title { opacity: initial; }

    .use-motion .logo,
    .use-motion .site-title,
    .use-motion .site-subtitle {
      opacity: initial;
      top: initial;
    }

    .use-motion {
      .logo-line-before i { left: initial; }
      .logo-line-after i { right: initial; }
    }
  </style>
</noscript>

</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-CN">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">whiledoing</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">喜欢一切简单且美的事物，包括人。</p>
      
  </div>

  <div class="site-nav-toggle">
    <button aria-label="切换导航栏">
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>




<nav class="site-nav">
  
    <ul id="menu" class="menu">
      
        
        
        
          
          <li class="menu-item menu-item-home">
    <a href="/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-home"></i> <br />首页</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-about">
    <a href="/about/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-user"></i> <br />关于</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-tags">
    <a href="/tags/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />标签</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-archives">
    <a href="/archives/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />归档</a>
  </li>

      
      
    </ul>
  

  
    

  

  
</nav>



  



</div>
    </header>

    


    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  
    <div class="reading-progress-bar"></div>
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://whiledoing.me/2017/12/11/diary/diary-2017-12-08-FRI/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="whiledoing">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/images/avatar.jpeg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="whiledoing">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">diary-2017-12-08-FRI
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">

            
            
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              

              
                
              

              <time title="创建时间：2017-12-11 01:53:14" itemprop="dateCreated datePublished" datetime="2017-12-11T01:53:14+08:00">2017-12-11</time>
            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body han-init-context" itemprop="articleBody">

      
      

      
        <p>&#x4ECA;&#x5929;&#x662F;&#x7237;&#x7237;&#x751F;&#x75C5;&#x4F4F;&#x9662;&#x7684;&#x7B2C;24&#x5929;&#x3002;</p>
<p>&#x65E9;&#x4E0A;7&#x70B9;&#x8D77;&#x5E8A;&#x53BB;&#x533B;&#x9662;&#xFF0C;&#x5230;&#x4E86;&#x7B2C;&#x4E00;&#x4EF6;&#x4E8B;&#x8FD8;&#x662F;&#x8BE2;&#x95EE;&#x7237;&#x7237;&#x6628;&#x591C;&#x7761;&#x89C9;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x548C;&#x6628;&#x5929;&#x4E00;&#x6837;&#xFF0C;&#x62A4;&#x5DE5;&#x53CD;&#x5E94;&#x7237;&#x7237;&#x8FD8;&#x662F;&#x4E00;&#x591C;&#x672A;&#x7761;&#x3002;&#x9694;&#x58C1;&#x5E8A;&#x7684;&#x76F4;&#x63A5;&#x4E0A;&#x6765;&#x5C31;&#x5BF9;&#x6211;&#x4EEC;&#x8FD9;&#x8FB9;&#x6709;&#x8BF4;&#x5600;&#x5495;&#xFF0C;&#x6211;&#x5FC3;&#x91CC;&#x77E5;&#x9053;&#x7406;&#x4E8F;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x53CD;&#x9A73;&#xFF0C;&#x800C;&#x662F;&#x7B49;&#x5582;&#x597D;&#x7237;&#x7237;&#x65E9;&#x996D;&#x540E;&#xFF0C;&#x624D;&#x8FC7;&#x53BB;&#x548C;&#x9694;&#x58C1;&#x9053;&#x6B49;&#x548C;&#x8BF4;&#x660E;&#x60C5;&#x51B5;&#xFF0C;&#x4F46;&#x662F;&#x4ED6;&#x4EEC;&#x66F4;&#x4E0D;&#x7406;&#x6E05;&#xFF0C;&#x8D28;&#x95EE;&#x6211;&#x9053;&#x6B49;&#x4E5F;&#x89E3;&#x51B3;&#x4E0D;&#x4E86;&#x4ED6;&#x4EEC;&#x7761;&#x89C9;&#x7684;&#x95EE;&#x9898;&#x3002;&#x6211;&#x5F53;&#x65F6;&#x5C31;&#x5FC3;&#x60F3;&#xFF0C;&#x8FD9;&#x6837;&#x5B50;&#x4E0D;&#x884C;&#xFF0C;&#x786E;&#x5B9E;&#x8981;&#x60F3;&#x4E2A;&#x529E;&#x6CD5;&#xFF0C;&#x800C;&#x4E14;&#x6211;&#x4F30;&#x8BA1;&#x7237;&#x7237;&#x665A;&#x4E0A;&#x4E5F;&#x6CA1;&#x6709;&#x7761;&#x597D;&#xFF0C;&#x5FC3;&#x91CC;&#x4E5F;&#x96BE;&#x53D7;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x544A;&#x8BC9;&#x5BF9;&#x65B9;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x60F3;&#x529E;&#x6CD5;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4ECA;&#x5929;&#x665A;&#x4E0A;&#x6211;&#x6765;&#x966A;&#x62A4;&#xFF0C;&#x800C;&#x4E14;&#x4E5F;&#x4F1A;&#x60F3;&#x529E;&#x6CD5;&#x6162;&#x6162;&#x8C03;&#x6574;&#x7237;&#x7237;&#x7684;&#x4F5C;&#x606F;&#x65F6;&#x95F4;&#xFF0C;&#x4E0D;&#x518D;&#x8BA9;&#x4ED6;&#x665A;&#x4E0A;&#x4E0D;&#x7761;&#x800C;&#x767D;&#x5929;&#x7761;&#x89C9;&#x3002;</p>
<p>&#x4E2D;&#x5348;&#x5348;&#x4F11;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7237;&#x7237;&#x53C8;&#x5927;&#x53EB;&#x4E86;&#x51E0;&#x4E0B;&#xFF0C;&#x6B63;&#x5F53;&#x6211;&#x8981;&#x53BB;&#x5B89;&#x629A;&#x7237;&#x7237;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6B63;&#x5728;&#x7761;&#x5348;&#x89C9;&#x9694;&#x58C1;&#x5E8A;&#x7684;&#x4E00;&#x4E2A;&#x5E74;&#x8F7B;&#x4EBA;&#xFF08;&#x53EF;&#x80FD;&#x662F;&#x75C5;&#x4EBA;&#x7684;&#x54E5;&#x54E5;&#xFF09;&#x6012;&#x4E0D;&#x53EF;&#x89E3;&#x7684;&#x6380;&#x5F00;&#x7A97;&#x5E18;&#x51B2;&#x6211;&#x4EEC;&#x8FD9;&#x8FB9;&#x543C;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x8BF4;&#x6211;&#x4EEC;&#x6BEB;&#x65E0;&#x826F;&#x77E5;&#xFF0C;&#x665A;&#x4E0A;&#x4E0D;&#x8BA9;&#x7761;&#xFF0C;&#x767D;&#x5929;&#x4E5F;&#x4E0D;&#x7761;&#x3002;&#x5976;&#x5976;&#x5F53;&#x65F6;&#x5C31;&#x548C;&#x5BF9;&#x9762;&#x543C;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x8BF4;&#x7237;&#x7237;&#x5979;&#x4E0D;&#x662F;&#x6B63;&#x5E38;&#x4EBA;&#xFF0C;&#x4EBA;&#x8981;&#x662F;&#x597D;&#x597D;&#x7684;&#x6765;&#x8FD9;&#x4E2A;&#x5730;&#x65B9;&#x5E72;&#x561B;&#xFF1F;&#x5BF9;&#x9762;&#x543C;&#x4E86;&#x5976;&#x5976;&#x4E00;&#x53E5;&#x501A;&#x8001;&#x5356;&#x8001;&#xFF0C;&#x76F4;&#x63A5;&#x5C06;&#x5976;&#x5976;&#x8BF4;&#x54ED;&#x3002;&#x6211;&#x5F53;&#x65F6;&#x672C;&#x6765;&#x662F;&#x60F3;&#x548C;&#x5BF9;&#x9762;&#x9053;&#x6B49;&#x5E76;&#x548C;&#x6C14;&#x8BF4;&#x4E0B;&#x60C5;&#x51B5;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x77E5;&#x9053;&#x6211;&#x4EEC;&#x7406;&#x4E8F;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x5979;&#x51B2;&#x6211;&#x5976;&#x5976;&#x543C;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x76F4;&#x63A5;&#x543C;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x4F60;tmd&#x6709;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#x51B2;&#x6211;&#x6765;&#xFF0C;&#x4F60;&#x51B2;&#x4E00;&#x4E2A;&#x8001;&#x4EBA;&#x5BB6;&#x53D1;&#x6211;&#x7B97;&#x4E2A;&#x5565;&#x3002;&#x5976;&#x5976;&#x54ED;&#x4E86;&#x4E4B;&#x540E;&#x5C31;&#x8DD1;&#x5230;&#x4E86;&#x75C5;&#x623F;&#x5916;&#x9762;&#xFF0C;&#x6211;&#x51FA;&#x53BB;&#x62B1;&#x4F4F;&#x5976;&#x5976;&#x544A;&#x8BC9;&#x5979;&#x4E0D;&#x8981;&#x54ED;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#x6211;&#x6765;&#x89E3;&#x51B3;&#xFF0C;&#x8BA9;&#x5979;&#x4E0D;&#x8981;&#x518D;&#x96BE;&#x53D7;&#x548C;&#x4F24;&#x5FC3;&#x3002;&#x521A;&#x597D;&#x5A9B;&#x5A9B;&#x7684;&#x7238;&#x7238;&#x90A3;&#x4F1A;&#x5728;&#x5916;&#x9762;&#xFF0C;&#x770B;&#x5230;&#x60C5;&#x51B5;&#x4E5F;&#x8FDB;&#x6765;&#x548C;&#x9694;&#x58C1;&#x7684;&#x5C0F;&#x4F19;&#x5B50;&#x7406;&#x8BBA;&#x3002;&#x7B49;&#x6211;&#x5B89;&#x629A;&#x597D;&#x5976;&#x5976;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x627E;&#x4E86;&#x9694;&#x58C1;&#x5C0F;&#x4F19;&#x5B50;&#x79C1;&#x4E0B;&#x8BF4;&#x9053;&#xFF1A;&#x300E;&#x6211;&#x77E5;&#x9053;&#x665A;&#x4E0A;&#x5435;&#x5F97;&#x4F60;&#x4EEC;&#x6CA1;&#x6709;&#x7761;&#x597D;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5728;&#x60F3;&#x529E;&#x6CD5;&#x89E3;&#x51B3;&#x4E2D;&#xFF0C;&#x524D;&#x4E24;&#x5929;&#x786E;&#x5B9E;&#x5F88;&#x4E0D;&#x597D;&#x610F;&#x601D;&#x3002;&#x6211;&#x5976;&#x5976;&#x516B;&#x5341;&#x591A;&#x5C81;&#xFF0C;&#x6211;&#x7237;&#x7237;&#x73B0;&#x5728;&#x8FD9;&#x4E2A;&#x72B6;&#x51B5;&#xFF0C;&#x5979;&#x5FC3;&#x91CC;&#x6BD4;&#x8C01;&#x90FD;&#x7740;&#x6025;&#xFF0C;&#x5C31;&#x7B97;&#x8001;&#x4EBA;&#x5BB6;&#x8BF4;&#x4F60;&#x51E0;&#x53E5;&#xFF0C;&#x9A82;&#x4F60;&#x51E0;&#x53E5;&#xFF0C;&#x4F60;&#x4E5F;&#x8981;&#x8BA9;&#x5979;&#xFF0C;&#x4F60;&#x6709;&#x4EC0;&#x4E48;&#x59D4;&#x5C48;&#x95EE;&#x9898;&#x4E0B;&#x6765;&#x548C;&#x6211;&#x8BF4;&#x548C;&#x6211;&#x543C;&#xFF0C;&#x6211;&#x4E5F;&#x662F;&#x8BB2;&#x9053;&#x7406;&#x7684;&#x4EBA;&#xFF0C;&#x5982;&#x679C;&#x771F;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x80AF;&#x5B9A;&#x7ED9;&#x4F60;&#x8BF4;&#x6CD5;&#x300F;&#x3002;&#x8FD8;&#x597D;&#x8FD9;&#x54E5;&#x4EEC;&#x4E5F;&#x4E0D;&#x662F;&#x65E0;&#x7406;&#x7684;&#x4EBA;&#xFF0C;&#x6211;&#x8FD9;&#x6837;&#x548C;&#x4ED6;&#x8BF4;&#xFF0C;&#x4ED6;&#x4E5F;&#x7B97;&#x540C;&#x610F;&#x4E86;&#x6211;&#x7684;&#x8BF4;&#x6CD5;&#x3002;&#x4F46;&#x4ED6;&#x4E5F;&#x6CA1;&#x6709;&#x548C;&#x6211;&#x8FC7;&#x591A;&#x8A00;&#x8BED;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#x786E;&#x5B9E;&#x8BB2;&#x518D;&#x591A;&#x4E5F;&#x8FD8;&#x662F;&#x6211;&#x4EEC;&#x8FC7;&#x5931;&#x7684;&#x591A;&#x4E9B;&#xFF0C;&#x4ED6;&#x5BB6;&#x7684;&#x75C5;&#x4EBA;&#x5E74;&#x7EAA;&#x8F7B;&#x8F7B;&#xFF0C;&#x5374;&#x4E5F;&#x5927;&#x6982;&#x534A;&#x8EAB;&#x4E0D;&#x9042;&#xFF0C;&#x60F3;&#x6765;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x7740;&#x6025;&#xFF0C;&#x7ED3;&#x679C;&#x665A;&#x4E0A;&#x8FD8;&#x7761;&#x4E0D;&#x597D;&#xFF0C;&#x80AF;&#x5B9A;&#x767D;&#x5929;&#x5EB7;&#x590D;&#x7684;&#x6548;&#x679C;&#x8981;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#x3002;&#x5728;&#x533B;&#x9662;&#x5F85;&#x4E00;&#x5929;&#x90FD;&#x662F;&#x5404;&#x79CD;&#x94B1;&#x548C;&#x5404;&#x79CD;&#x95F9;&#x5FC3;&#x7CDF;&#x5FC3;&#x554A;&#xFF0C;&#x5C06;&#x5FC3;&#x6BD4;&#x5FC3;&#xFF0C;&#x5176;&#x5B9E;&#x5927;&#x5BB6;&#x90FD;&#x4E0D;&#x5BB9;&#x6613;&#x3002;&#x533B;&#x9662;&#x771F;&#x662F;&#x770B;&#x5C3D;&#x4EBA;&#x751F;&#x51B7;&#x6696;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x4E0B;&#x5348;&#x7237;&#x7237;&#x53BB;&#x505A;&#x4E86;&#x4E00;&#x4E2A;&#x53EB;&#x505A;ROB&#x7684;&#x5EB7;&#x590D;&#x9879;&#x76EE;&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x8F85;&#x52A9;&#x52A8;&#x529B;&#x6E38;&#x620F;&#x9879;&#x76EE;&#x3002;&#x5728;&#x75C5;&#x4EBA;&#x4E0D;&#x80FD;&#x52A8;&#x7684;&#x624B;&#x81C2;&#x4E0A;&#x6346;&#x7ED1;&#x52A8;&#x529B;&#x8F85;&#x52A9;&#x673A;&#x68B0;&#x81C2;&#xFF0C;&#x7136;&#x540E;&#x5C4F;&#x5E55;&#x4E0A;&#x5F00;&#x59CB;&#x6E38;&#x620F;&#xFF0C;&#x89C4;&#x5219;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x64CD;&#x4F5C;&#x673A;&#x68B0;&#x81C2;&#x6765;&#x63A7;&#x5236;&#x6E38;&#x620F;&#x4E2D;&#x4E00;&#x4E2A;&#x5C0F;&#x7403;&#x7684;&#x79FB;&#x52A8;&#x65B9;&#x5411;&#xFF0C;&#x5982;&#x679C;&#x51FB;&#x4E2D;&#x76EE;&#x6807;&#x5C31;&#x5F97;&#x5206;&#x3002;&#x673A;&#x68B0;&#x81C2;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x662F;&#x4F7F;&#x7528;&#x4E3B;&#x52A8;&#x8FD8;&#x662F;&#x88AB;&#x52A8;&#x53D7;&#x529B;&#x6A21;&#x5F0F;&#xFF0C;&#x4E3B;&#x52A8;&#x6A21;&#x5F0F;&#x5C31;&#x662F;&#x75C5;&#x4EBA;&#x81EA;&#x5DF1;&#x64CD;&#x4F5C;&#x624B;&#x81C2;&#xFF0C;&#x800C;&#x88AB;&#x52A8;&#x5C31;&#x662F;&#x673A;&#x68B0;&#x8F85;&#x52A9;&#x79FB;&#x52A8;&#xFF0C;&#x5E26;&#x52A8;&#x75C5;&#x4EBA;&#x7684;&#x624B;&#x81C2;&#x8FDB;&#x884C;&#x79FB;&#x52A8;&#xFF0C;&#x523A;&#x6FC0;&#x808C;&#x8089;&#xFF0C;&#x5BFB;&#x627E;&#x624B;&#x81C2;&#x79FB;&#x52A8;&#x7684;&#x611F;&#x89C9;&#x3002;&#x7ED3;&#x679C;&#x4E4B;&#x524D;&#x660F;&#x660F;&#x6C89;&#x6C89;&#x7761;&#x610F;&#x7684;&#x7237;&#x7237;&#x5C45;&#x7136;&#x4E00;&#x4E0B;&#x5B50;&#x96C6;&#x4E2D;&#x8D77;&#x4E86;&#x6CE8;&#x610F;&#x529B;&#xFF0C;&#x76EF;&#x7740;&#x5C4F;&#x5E55;&#x7684;&#x5C0F;&#x7403;&#x770B;&#xFF0C;&#x8BA9;&#x6211;&#x548C;&#x5976;&#x5976;&#x90FD;&#x5F00;&#x5FC3;&#x574F;&#x4E86;&#x3002;&#x867D;&#x7136;&#x73A9;&#x5230;&#x540E;&#x9762;&#x65F6;&#x95F4;&#x7237;&#x7237;&#x5C31;&#x6CE8;&#x610F;&#x529B;&#x4E0D;&#x592A;&#x96C6;&#x4E2D;&#xFF0C;&#x4E0D;&#x600E;&#x4E48;&#x770B;&#x5C4F;&#x5E55;&#x60F3;&#x7761;&#x89C9;&#xFF0C;&#x4F46;&#x4E2D;&#x95F4;&#x6709;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x7237;&#x7237;&#x8FD8;&#x662F;&#x5F88;&#x914D;&#x5408;&#x7684;&#x770B;&#x7740;&#x5C4F;&#x5E55;&#x300C;&#x73A9;&#x4E86;&#x300D;&#x8D77;&#x6765;&#xFF0C;&#x8FD9;&#x8BA9;&#x6211;&#x4EEC;&#x90FD;&#x5F88;&#x5F00;&#x5FC3;&#xFF0C;&#x4E5F;&#x7A81;&#x7136;&#x8BA9;&#x6211;&#x89C9;&#x5F97;&#x6211;&#x4E4B;&#x524D;&#x505A;&#x7684;&#x6E38;&#x620F;&#x884C;&#x4E1A;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x6709;&#x793E;&#x4F1A;&#x4EF7;&#x503C;&#x7684;&#x3002;</p>
<p>&#x665A;&#x4E0A;&#xFF0C;&#x62A4;&#x5DE5;&#x5582;&#x7237;&#x7237;&#x5403;&#x996D;&#xFF0C;&#x5582;&#x5B8C;&#x7237;&#x7237;&#x4E00;&#x52FA;&#x996D;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x770B;&#x4E00;&#x4F1A;&#x7535;&#x89C6;&#xFF0C;&#x5982;&#x6B64;&#x597D;&#x51E0;&#x6B21;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x975E;&#x5E38;&#x4E0D;&#x5F00;&#x5FC3;&#x5730;&#x8BF4;&#x4E86;&#x53E5;&#x300E;&#x4F60;&#x5582;&#x996D;&#x80FD;&#x4E0D;&#x80FD;&#x4E13;&#x5FC3;&#x70B9;&#xFF1F;&#x300F;&#xFF0C;&#x800C;&#x5979;&#x89E3;&#x91CA;&#x9053;&#x300E;&#x8001;&#x7237;&#x5B50;&#x56BC;&#x996D;&#x9700;&#x8981;&#x82B1;&#x65F6;&#x95F4;&#x7684;&#x300F;&#xFF0C;&#x6211;&#x9887;&#x751F;&#x6C14;&#x5F97;&#x56DE;&#x5979;&#x4E00;&#x53E5;&#x300E;&#x8001;&#x7237;&#x5B50;&#x5403;&#x996D;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x80FD;&#x545B;&#x5230;&#x6216;&#x8005;&#x5410;&#x4E1C;&#x897F;&#x51FA;&#x6765;&#xFF0C;&#x4F60;&#x4E0D;&#x770B;&#x8FD9;&#x70B9;&#xFF0C;&#x53D1;&#x751F;&#x95EE;&#x9898;&#x600E;&#x4E48;&#x641E;&#xFF1F;&#x300F;&#x3002;&#x5979;&#x88AB;&#x545B;&#x5F97;&#x6CA1;&#x8BDD;&#x8BF4;&#xFF0C;&#x4E5F;&#x5C31;&#x4E13;&#x5FC3;&#x4E86;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x540E;&#x6765;&#x59D1;&#x59D1;&#x6765;&#x4E86;&#x7535;&#x8BDD;&#xFF0C;&#x8BE2;&#x95EE;&#x4E86;&#x4ECA;&#x5929;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x5C31;&#x548C;&#x5979;&#x8BF4;&#x660E;&#x4E86;&#x4E00;&#x4E0B;&#x72B6;&#x51B5;&#xFF0C;&#x4E5F;&#x4E00;&#x5E76;&#x544A;&#x8BC9;&#x5979;&#x6211;&#x665A;&#x4E0A;&#x7559;&#x4E0B;&#x6765;&#x770B;&#x62A4;&#x7237;&#x7237;&#x7684;&#x51B3;&#x5B9A;&#x3002;&#x5979;&#x5F53;&#x65F6;&#x6709;&#x4E9B;&#x751F;&#x6C14;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x786E;&#x5B9E;&#x6CA1;&#x6709;&#x63D0;&#x524D;&#x548C;&#x5979;&#x8BF4;&#x660E;&#x8FD9;&#x4E2A;&#x51B3;&#x5B9A;&#xFF0C;&#x800C;&#x6211;&#x4E5F;&#x5FD9;&#x7684;&#x6CA1;&#x6709;&#x7EC6;&#x60F3;&#x7559;&#x4E0B;&#x6765;&#x5176;&#x5B9E;&#x8FD8;&#x662F;&#x5F88;&#x591A;&#x5B89;&#x6392;&#x8981;&#x5904;&#x7406;&#xFF1A;&#x6BD4;&#x5982;&#x665A;&#x4E0A;&#x7559;&#x4E0B;&#x6765;&#x7761;&#x5F97;&#x88AB;&#x5B50;&#x8FD8;&#x6CA1;&#x6709;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x5904;&#x7406;&#x597D;&#x548C;&#x8FD9;&#x4E2A;&#x4E00;&#x5BF9;&#x4E00;&#x62A4;&#x5DE5;&#x7684;&#x770B;&#x62A4;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x540E;&#x6765;&#x59D1;&#x59D1;&#x4E0B;&#x4E86;&#x73ED;&#x4E4B;&#x540E;&#xFF0C;&#x6298;&#x817E;&#x4E86;&#x4E00;&#x5708;&#xFF0C;&#x53C8;&#x56DE;&#x5BB6;&#x7ED9;&#x6211;&#x9001;&#x88AB;&#x5B50;&#x8FC7;&#x6765;&#x3002;&#x5F53;&#x65F6;&#x5927;&#x6982;&#x665A;&#x4E0A;10&#x70B9;&#x591A;&#xFF0C;&#x6211;&#x548C;&#x62A4;&#x5DE5;&#x5F20;&#x963F;&#x59E8;&#x8BF4;&#xFF0C;&#x665A;&#x4E0A;&#x6211;&#x6765;&#x770B;&#x62A4;&#xFF0C;&#x4F60;&#x627E;&#x5730;&#x65B9;&#x7761;&#x89C9;&#xFF0C;&#x6211;&#x6709;&#x4E8B;&#x60C5;&#x6253;&#x7535;&#x8BDD;&#x53EB;&#x4F60;&#x3002;&#x4E0D;&#x8FC7;&#x4F60;&#x73B0;&#x5728;&#x7A0D;&#x5FAE;&#x8FDF;&#x4E9B;&#x65F6;&#x5019;&#x7761;&#x89C9;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x59D1;&#x59D1;&#x7ED9;&#x6211;&#x62FF;&#x88AB;&#x5B50;&#x53BB;&#x4E86;&#xFF0C;&#x6211;&#x4E00;&#x4F1A;&#x53EF;&#x80FD;&#x4E0B;&#x6765;&#x53BB;&#x53D6;&#xFF0C;&#x5979;&#x4F30;&#x8BA1;&#x534A;&#x5C0F;&#x65F6;&#x5DE6;&#x53F3;&#x8FC7;&#x6765;&#xFF0C;&#x5230;&#x65F6;&#x5019;&#x6211;&#x7ED9;&#x4F60;&#x7535;&#x8BDD;&#xFF0C;&#x4F60;&#x5E2E;&#x6211;&#x8FC7;&#x6765;&#x770B;&#x7740;&#x4E00;&#x4F1A;&#x7237;&#x7237;&#x3002;&#x8FC7;&#x4E86;&#x534A;&#x5C0F;&#x65F6;&#xFF0C;&#x6211;&#x59D1;&#x59D1;&#x8FD8;&#x6CA1;&#x6709;&#x5230;&#xFF0C;&#x5979;&#x4E3B;&#x52A8;&#x8FC7;&#x6765;&#x770B;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x95EE;&#x4E86;&#x6211;&#x59D1;&#x59D1;&#x662F;&#x5426;&#x6765;&#x4E86;&#xFF0C;&#x6211;&#x8BF4;&#x8FD8;&#x6CA1;&#x6709;&#xFF0C;&#x6765;&#x4E86;&#x7ED9;&#x5979;&#x6253;&#x7535;&#x8BDD;&#x3002;&#x5979;&#x8BF4;&#xFF1A;&#x300E;&#x4F60;&#x7237;&#x7237;&#x73B0;&#x5728;&#x7761;&#x5F97;&#x633A;&#x597D;&#x7684;&#xFF0C;&#x4E00;&#x4F1A;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x600E;&#x4E48;&#x770B;&#x62A4;&#xFF0C;&#x6CA1;&#x5565;&#x592A;&#x5927;&#x95EE;&#x9898;&#x3002;&#x300F;&#xFF0C;&#x6211;&#x4E00;&#x542C;&#x8FD9;&#x8BDD;&#x6709;&#x4E9B;&#x70B8;&#xFF0C;&#x6211;&#x7565;&#x5927;&#x58F0;&#x8BF4;&#xFF1A;&#x300E;&#x6211;&#x4EEC;&#x8BF7;&#x4F60;&#x6765;&#x7167;&#x987E;&#x5C31;&#x662F;&#x8981;&#x4F60;&#x6765;&#x770B;&#x7740;&#x8001;&#x7237;&#x5B50;&#x7684;&#xFF0C;&#x4ED6;&#x7761;&#x7740;&#x4E86;&#x4E0D;&#x4EE3;&#x8868;&#x4E0D;&#x4F1A;&#x9192;&#x6765;&#xFF0C;&#x4E0D;&#x4EE3;&#x8868;&#x6CA1;&#x6709;&#x9700;&#x6C42;&#x9700;&#x8981;&#x5904;&#x7406;&#x3002;&#x300F;&#xFF0C;&#x7ED3;&#x679C;&#x8FD9;&#x963F;&#x59E8;&#x968F;&#x53E3;&#x8BF4;&#x4E86;&#x51E0;&#x53E5;&#xFF0C;&#x5927;&#x610F;&#x662F;&#xFF1A;&#x300E;&#x8001;&#x7237;&#x5B50;&#x6709;&#x95EE;&#x9898;&#x53EB;&#x51E0;&#x58F0;&#xFF0C;&#x6162;&#x6162;&#x4E5F;&#x5C31;&#x7761;&#x7740;&#x4E0D;&#x53EB;&#x4E86;&#x3002;&#x300F;&#x3002;&#x6211;tmd&#x76F4;&#x63A5;&#x70B8;&#x88C2;&#xFF0C;&#x7EC8;&#x4E8E;&#x77E5;&#x9053;&#x5979;&#x665A;&#x4E0A;&#x662F;&#x5982;&#x4F55;&#x966A;&#x62A4;&#x7684;&#xFF0C;&#x4E5F;&#x7EC8;&#x4E8E;&#x7406;&#x89E3;&#x9694;&#x58C1;&#x5E8A;&#x7684;&#x4EBA;&#x5982;&#x6B64;&#x751F;&#x6C14;&#x7684;&#x539F;&#x56E0;&#x3002;&#x6211;&#x5F53;&#x65F6;&#x6C14;&#x4E0D;&#x6253;&#x4E00;&#x5904;&#x6765;&#xFF0C;&#x5C06;&#x5B83;&#x53EB;&#x5979;&#x95E8;&#x53E3;&#xFF0C;&#x8BAD;&#x65A5;&#x4E86;&#x4E00;&#x901A;&#x3002;&#x6211;&#x672C;&#x6765;&#x60F3;&#x597D;&#x597D;&#x7684;&#x548C;&#x5979;&#x8BF4;&#x8BF4;&#x6211;&#x5FC3;&#x91CC;&#x5404;&#x79CD;&#x4E0D;&#x6EE1;&#x548C;&#x751F;&#x6C14;&#x7684;&#x4E8B;&#x60C5;&#x4EE5;&#x53CA;&#x544A;&#x8BC9;&#x5979;&#x6211;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x4E0D;&#x8FC7;&#x8BAD;&#x65A5;&#x4E86;&#x5979;&#x51E0;&#x4E0B;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x60F3;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x6709;&#x4E9B;&#x4EBA;&#x8BAD;&#x65A5;&#x4E5F;&#x6CA1;&#x7528;&#xFF0C;&#x5979;&#x8FD9;&#x79CD;&#x4EBA;&#x672C;&#x6765;&#x5C31;&#x662F;&#x81EA;&#x79C1;&#x548C;&#x80FD;&#x5077;&#x61D2;&#x5C31;&#x5077;&#x61D2;&#x672C;&#x6027;&#x7684;&#x4EBA;&#xFF0C;&#x4E0D;&#x662F;&#x4F60;&#x8BAD;&#x65A5;&#x540E;&#x5C31;&#x80FD;&#x6539;&#x6389;&#x7684;&#x3002;&#x6211;&#x867D;&#x7136;&#x80FD;&#x611F;&#x89C9;&#x5230;&#x8BAD;&#x65A5;&#x540E;&#x5979;&#x6001;&#x5EA6;&#x6709;&#x4E9B;&#x8F6F;&#x4E0B;&#x6765;&#xFF0C;&#x4E5F;&#x4F30;&#x8BA1;&#x5230;&#x5979;&#x6001;&#x5EA6;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x6240;&#x8F6C;&#x53D8;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x6211;&#x4EEC;&#x4E0D;&#x5728;&#x7684;&#x591C;&#x91CC;&#xFF0C;&#x5979;&#x8FD9;&#x6837;&#x5B50;&#x54C1;&#x884C;&#x7684;&#x4EBA;&#x4E00;&#x5B9A;&#x8FD8;&#x4F1A;&#x7EE7;&#x7EED;&#x300E;&#x4E0D;&#x8BA4;&#x771F;&#x300F;&#x4E0B;&#x53BB;&#xFF0C;&#x90A3;&#x8981;&#x4F60;&#x4F55;&#x7528;&#xFF1F;&#x6211;&#x5FC3;&#x91CC;&#x90A3;&#x65F6;&#x5DF2;&#x7ECF;&#x4E0B;&#x5B9A;&#x51B3;&#x5FC3;&#xFF0C;&#x7B2C;&#x4E8C;&#x5929;&#x627E;&#x4ED6;&#x4EEC;&#x8D1F;&#x8D23;&#x4EBA;&#x8BF4;&#xFF0C;&#x6362;&#x4EBA;&#x3002;&#x4F46;&#x73B0;&#x5728;&#x8FD8;&#x4E0D;&#x80FD;&#x5173;&#x7CFB;&#x76F4;&#x63A5;&#x6311;&#x7834;&#x95F9;&#x50F5;&#xFF0C;&#x4E0D;&#x7136;&#x7237;&#x7237;&#x591C;&#x91CC;&#x5982;&#x679C;&#x8981;&#x662F;&#x5927;&#x4FBF;&#x4E4B;&#x7C7B;&#x95EE;&#x9898;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x62A4;&#x5DE5;&#x6765;&#x89E3;&#x51B3;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x8BAD;&#x65A5;&#x4E86;&#x51E0;&#x53E5;&#x4E4B;&#x540E;&#x4E5F;&#x5C31;&#x8BA9;&#x5979;&#x56DE;&#x53BB;&#x7761;&#x89C9;&#x5427;&#xFF0C;&#x665A;&#x4E0A;&#x6211;&#x6765;&#x770B;&#x62A4;&#x3002;</p>
<p>&#x540E;&#x6765;&#x59D1;&#x59D1;&#x548C;&#x59D1;&#x7237;&#x4E00;&#x8D77;&#x8FC7;&#x6765;&#x4E86;&#xFF0C;&#x76F4;&#x63A5;&#x5C06;&#x88AB;&#x5B50;&#x9001;&#x5230;&#x4E86;&#x75C5;&#x623F;&#x3002;&#x59D1;&#x59D1;&#x4E0A;&#x6765;&#x5C31;&#x548C;&#x6211;&#x9053;&#x6B49;&#x8BF4;&#x665A;&#x4E0A;&#x4E0D;&#x5E94;&#x8BE5;&#x751F;&#x6C14;&#xFF0C;&#x6211;&#x62B1;&#x7740;&#x59D1;&#x59D1;&#x8BF4;&#xFF0C;&#x6211;&#x90FD;&#x7406;&#x89E3;&#x3002;&#x672C;&#x6765;&#x59D1;&#x59D1;&#x4E0A;&#x73ED;&#x5C31;&#x5F88;&#x8F9B;&#x82E6;&#xFF0C;&#x538B;&#x529B;&#x5F88;&#x5927;&#xFF0C;&#x7237;&#x7237;&#x7684;&#x4E8B;&#x60C5;&#x4E5F;&#x662F;&#x4E00;&#x5806;&#x95EE;&#x9898;&#x8981;&#x5979;&#x534F;&#x8C03;&#x5904;&#x7406;&#x3002;&#x6211;&#x8BF4;&#x5176;&#x5B9E;&#x5927;&#x5BB6;&#x5FC3;&#x91CC;&#x90FD;&#x96BE;&#x53D7;&#x548C;&#x7740;&#x6025;&#xFF0C;&#x6211;&#x90FD;&#x80FD;&#x7406;&#x89E3;&#x3002;&#x6211;&#x73B0;&#x5728;&#x662F;&#x770B;&#x62A4;&#x7237;&#x7237;&#x7684;&#x6392;&#x5934;&#x5175;&#xFF0C;&#x4E0D;&#x8BBA;&#x5FC3;&#x91CC;&#x600E;&#x4E48;&#x7740;&#x6025;&#xFF0C;&#x6211;&#x90FD;&#x4F1A;&#x7A33;&#x4F4F;&#x3002;&#x4E4B;&#x540E;&#x6211;&#x5C31;&#x548C;&#x59D1;&#x59D1;&#x8BF4;&#x4E86;&#x62A4;&#x5DE5;&#x7684;&#x4E8B;&#x60C5;&#x4EE5;&#x53CA;&#x6211;&#x4E3A;&#x5565;&#x6CA1;&#x600E;&#x4E48;&#x8003;&#x8651;&#x6E05;&#x695A;&#x5C31;&#x8FD9;&#x4E48;&#x51B3;&#x5B9A;&#x8BF4;&#x665A;&#x4E0A;&#x7559;&#x4E0B;&#x6765;&#x3002;&#x5C31;&#x5728;&#x6211;&#x4EEC;&#x804A;&#x7740;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9694;&#x58C1;&#x5E8A;&#x7684;&#x770B;&#x62A4;&#x75C5;&#x4EBA;&#x7684;&#x53D4;&#x53D4;&#x8FC7;&#x6765;&#x548C;&#x6211;&#x8BF4;&#xFF0C;&#x4F60;&#x4EEC;&#x5BB6;&#x5C5E;&#x770B;&#x62A4;&#x6BD4;&#x90A3;&#x4E2A;&#x62A4;&#x5DE5;&#x8981;&#x597D;&#x4E00;&#x767E;&#x500D;&#x3002;&#x90A3;&#x4E2A;&#x62A4;&#x5DE5;&#x665A;&#x4E0A;&#x770B;&#x62A4;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x7237;&#x7237;&#x5404;&#x79CD;&#x53EB;&#xFF0C;&#x5979;&#x5404;&#x79CD;&#x7761;&#x5F97;&#x6DF1;&#xFF0C;&#x6211;&#x7237;&#x7237;&#x53EB;&#x7684;&#x5927;&#x58F0;&#x4E86;&#xFF0C;&#x5979;&#x53CD;&#x800C;&#x5C06;&#x88AB;&#x5B50;&#x628A;&#x5934;&#x4E00;&#x8499;&#xFF0C;&#x8FD9;&#x4E00;&#x8BF4;&#x6C14;&#x5F97;&#x6211;&#x4EEC;&#x76F4;&#x7259;&#x75D2;&#x75D2;&#x3002;</p>
<p>&#x665A;&#x4E0A;&#x7237;&#x7237;&#x786E;&#x5B9E;&#x8FD8;&#x662F;&#x4E09;&#x73ED;&#x5012;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x4E0B;&#x534A;&#x591C;1&#x70B9;&#x5230;4&#x70B9;&#x5DE6;&#x53F3;&#x4E0D;&#x592A;&#x56F0;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x534A;&#x5C0F;&#x65F6;&#x4E00;&#x4E2A;&#x9700;&#x6C42;&#xFF0C;&#x591A;&#x6570;&#x662F;&#x8981;&#x559D;&#x6C34;&#x548C;&#x7FFB;&#x8EAB;&#x3002;&#x4ED6;&#x89C6;&#x542C;&#x529F;&#x80FD;&#x53D7;&#x5230;&#x4E86;&#x5F71;&#x54CD;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x8BF4;&#x8BDD;&#x8BF4;&#x4E0D;&#x6E05;&#x695A;&#xFF0C;&#x6211;&#x4EEC;&#x8BF4;&#x8BDD;&#x4ED6;&#x4E5F;&#x4E0D;&#x751A;&#x660E;&#x767D;&#xFF0C;&#x4ED6;&#x7684;&#x9700;&#x6C42;&#x57FA;&#x672C;&#x9760;&#x731C;&#x548C;&#x5BF9;&#x4ED6;&#x8EAB;&#x4F53;&#x52A8;&#x4F5C;&#x7684;&#x7ECF;&#x9A8C;&#x76F4;&#x89C9;&#x3002;&#x90A3;&#x5929;&#x591C;&#x91CC;&#x6211;&#x5C31;&#x518D;&#x60F3;&#x7740;&#x54EA;&#x5929;&#x62BD;&#x7A7A;&#x8981;&#x6574;&#x7406;&#x4E00;&#x4EFD;&#x5173;&#x4E8E;&#x7167;&#x987E;&#x7237;&#x7237;&#x7684;&#x7ECF;&#x9A8C;&#x624B;&#x518C;&#x3002;</p>
<p>&#x53C8;&#x53CA;&#xFF0C;&#x7237;&#x7237;&#x73A9;ROB&#x7684;&#x573A;&#x666F;&#xFF1A;</p>
<p><img src="http://static.zybuluo.com/whiledoing/4dl3iigkow0jztk86zzpjb55/image_1c10ov9a85oa1l5j18td8q81fo9.png" alt="image_1c10ov9a85oa1l5j18td8q81fo9.png-1324.6kB"></p>

      
    </div>

    
      

  <div class="popular-posts-header">相关文章</div>
  <ul class="popular-posts">
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/16/diary/diary-2017-12-13-WED/" rel="bookmark">diary-2017-12-13-WED</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/19/diary/diary-2016-12-14-THU/" rel="bookmark">diary-2016-12-14-THU</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/11/diary/diary-2017-12-07-THU/" rel="bookmark">diary-2017-12-07-THU</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/12/diary/diary-2017-12-09-SAT/" rel="bookmark">diary-2017-12-09-SAT</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/12/diary/diary-2017-12-10-SUN/" rel="bookmark">diary-2017-12-10-SUN</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/12/diary/diary-2017-12-11-MON/" rel="bookmark">diary-2017-12-11-MON</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/16/diary/diary-2017-12-12-TUE/" rel="bookmark">diary-2017-12-12-TUE</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/21/diary/diary-2017-12-15-FRI/" rel="bookmark">diary-2017-12-15-FRI</a></div>
      
    </li>
  
  </ul>


    

    
    
    

    

    

    
      <div>
        <ul class="post-copyright">
  <li class="post-copyright-author">
    <strong>本文作者： </strong>whiledoing</li>
  <li class="post-copyright-link">
    <strong>本文链接：</strong>
    <a href="http://whiledoing.me/2017/12/11/diary/diary-2017-12-08-FRI/" title="diary-2017-12-08-FRI">http://whiledoing.me/2017/12/11/diary/diary-2017-12-08-FRI/</a>
  </li>
  <li class="post-copyright-license">
    <strong>版权声明： </strong>本博客所有文章除特别声明外，均采用 <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/" rel="external nofollow" target="_blank">CC BY-NC-SA 4.0</a> 许可协议。转载请注明出处！</li>
</ul>

      </div>
    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/日记/" rel="tag"># 日记</a>
          
            <a href="/tags/爷爷/" rel="tag"># 爷爷</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2017/12/11/diary/diary-2017-12-07-THU/" rel="next" title="diary-2017-12-07-THU">
                <i class="fa fa-chevron-left"></i> diary-2017-12-07-THU
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2017/12/12/diary/diary-2017-12-09-SAT/" rel="prev" title="diary-2017-12-09-SAT">
                diary-2017-12-09-SAT <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      

      <section class="site-overview-wrap sidebar-panel sidebar-panel-active">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <img class="site-author-image" itemprop="image"
                src="/images/avatar.jpeg"
                alt="whiledoing" />
            
              <p class="site-author-name" itemprop="name">whiledoing</p>
              <p class="site-description motion-element" itemprop="description">喜欢一切简单且美的事物，包括人。</p>
          </div>

          
            <nav class="site-state motion-element">
              
                <div class="site-state-item site-state-posts">
                
                  <a href="/archives/">
                
                    <span class="site-state-item-count">59</span>
                    <span class="site-state-item-name">日志</span>
                  </a>
                </div>
              

              

              
                
                
                <div class="site-state-item site-state-tags">
                  <a href="/tags/index.html">
                    
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                    <span class="site-state-item-count">31</span>
                    <span class="site-state-item-name">标签</span>
                  </a>
                </div>
              
            </nav>
          

          

          
            <div class="links-of-author motion-element">
              
                <span class="links-of-author-item">
                  <a href="https://github.com/whiledoing" target="_blank" title="GitHub">GitHub</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="http://www.douban.com/people/58249409" target="_blank" title="豆瓣">豆瓣</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="https://www.zhihu.com/people/whiledoing" target="_blank" title="知乎">知乎</a>
                  
                </span>
              
            </div>
          

          
          

          
          

          
            
          
          

        </div>
      </section>

      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; 2016 &mdash; <span itemprop="copyrightYear">2018</span>
  <span class="with-love" id="animate">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">whiledoing</span>

  

  
</div>




  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动 v3.7.1</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/theme-next/hexo-theme-next">NexT.Mist</a> v6.2.0</div>




        








        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>
























  



  
  
    <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/reading_progress/reading_progress.js"></script>
  


  


  <script type="text/javascript" src="/js/src/utils.js?v=6.2.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=6.2.0"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=6.2.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=6.2.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=6.2.0"></script>



  



	





  





  










  





  

  

  
<script>
(function(){
    var bp = document.createElement('script');
    var curProtocol = window.location.protocol.split(':')[0];
    if (curProtocol === 'https') {
        bp.src = 'https://zz.bdstatic.com/linksubmit/push.js';        
    }
    else {
        bp.src = 'http://push.zhanzhang.baidu.com/push.js';
    }
    var s = document.getElementsByTagName("script")[0];
    s.parentNode.insertBefore(bp, s);
})();
</script>


  
  

  
  

  


  
  

  
  
  
  <script src="/lib/pangu/dist/pangu.min.js?v=3.3"></script>
  <script type="text/javascript">pangu.spacingPage();</script>


  
  <script type="text/javascript" src="/js/src/js.cookie.js?v=6.2.0"></script>
  <script type="text/javascript" src="/js/src/scroll-cookie.js?v=6.2.0"></script>


  

  

  
  <style>
      .copy-btn {
          display: inline-block;
          padding: 6px 12px;
          font-size: 13px;
          font-weight: 700;
          line-height: 20px;
          color: #333;
          white-space: nowrap;
          vertical-align: middle;
          cursor: pointer;
          background-color: #eee;
          background-image: linear-gradient(#fcfcfc, #eee);
          border: 1px solid #d5d5d5;
          border-radius: 3px;
          user-select: none;
      }

      .highlight-wrap .copy-btn {
          transition: opacity .3s ease-in-out;
          opacity: 0;
          padding: 2px 6px;
          position: absolute;
          right: 4px;
          top: 8px;
      }

      .highlight-wrap:hover .copy-btn,
      .highlight-wrap .copy-btn:focus {
          opacity: 1
      }

      .highlight-wrap {
          position: relative;
      }
  </style>
  <script>
      $('.highlight').each(function(i, e) {
          var $wrap = $('<div>').addClass('highlight-wrap')
          $(e).after($wrap)
          $wrap.append($('<button>').addClass('copy-btn').append('复制').on('click', function(e) {
              var code = $(e.target).parent().find('.code').find('.line').map(function(i, e) {
                  return $(e).text()
              }).toArray().join('\n')
              var ta = document.createElement('textarea')
              document.body.appendChild(ta)
              ta.style.position = 'fixed'
              ta.style.top = 0
              ta.style.left = 0
              ta.value = code
              ta.select()
              ta.focus()
              document.execCommand('copy')
              document.body.removeChild(ta)
          })).append(e)
      })
  </script>


</body>
</html>
