<!DOCTYPE html>












  


<html class="theme-next mist use-motion" lang="zh-CN">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=2"/>
<meta name="theme-color" content="#222">






  
  
    
    
  <script src="/lib/pace/pace.min.js?v=1.0.2"></script>
  <link href="/lib/pace/pace-theme-minimal.min.css?v=1.0.2" rel="stylesheet">




  
  
  <link rel="stylesheet" media="all" href="/lib/Han/dist/han.min.css?v=3.3">




<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />






















<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=6.4.0" rel="stylesheet" type="text/css" />


  <link rel="apple-touch-icon" sizes="180x180" href="/images/favicon.png?v=6.4.0">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon.png?v=6.4.0">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon.png?v=6.4.0">


  <link rel="mask-icon" href="/images/logo.svg?v=6.4.0" color="#222">









<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    version: '6.4.0',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":false,"onmobile":false},
    fancybox: false,
    fastclick: false,
    lazyload: false,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>


  




  <meta name="description" content="爷爷生病不知不觉已经有130多天了，算上我中间休息的时间，我陪同照顾了他约有120天时间。期间我经历了诸多困难，内心常常充满了纠结，难受，困惑，焦虑，但却又都一直坚相「功不唐捐」，明天一定会变得更好。这120天对我而言，可能是我人生中最痛苦却又最乐观的一段日子。现在爷爷的状况已经大好于从前，生活和治疗情况也都趋于稳定，所以我也就抽手不再一直照顾，而是回到杭州开始忙自己的工作。 从去年八月份离职算起">
<meta name="keywords" content="总结,爷爷">
<meta property="og:type" content="article">
<meta property="og:title" content="照顾爷爷的这120天">
<meta property="og:url" content="http://whiledoing.me/2018/04/09/summary/summary-take-care-of-grandpa/index.html">
<meta property="og:site_name" content="whiledoing">
<meta property="og:description" content="爷爷生病不知不觉已经有130多天了，算上我中间休息的时间，我陪同照顾了他约有120天时间。期间我经历了诸多困难，内心常常充满了纠结，难受，困惑，焦虑，但却又都一直坚相「功不唐捐」，明天一定会变得更好。这120天对我而言，可能是我人生中最痛苦却又最乐观的一段日子。现在爷爷的状况已经大好于从前，生活和治疗情况也都趋于稳定，所以我也就抽手不再一直照顾，而是回到杭州开始忙自己的工作。 从去年八月份离职算起">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2018-04-17T13:29:53.038Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="照顾爷爷的这120天">
<meta name="twitter:description" content="爷爷生病不知不觉已经有130多天了，算上我中间休息的时间，我陪同照顾了他约有120天时间。期间我经历了诸多困难，内心常常充满了纠结，难受，困惑，焦虑，但却又都一直坚相「功不唐捐」，明天一定会变得更好。这120天对我而言，可能是我人生中最痛苦却又最乐观的一段日子。现在爷爷的状况已经大好于从前，生活和治疗情况也都趋于稳定，所以我也就抽手不再一直照顾，而是回到杭州开始忙自己的工作。 从去年八月份离职算起">






  <link rel="canonical" href="http://whiledoing.me/2018/04/09/summary/summary-take-care-of-grandpa/"/>



<script type="text/javascript" id="page.configurations">
  CONFIG.page = {
    sidebar: "",
  };
</script>

  <title>照顾爷爷的这120天 | whiledoing</title>
  




<script async src="https://www.googletagmanager.com/gtag/js?id=UA-117714040-1"></script>
<script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'UA-117714040-1');
</script>



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "https://hm.baidu.com/hm.js?6de2920425778ca5a4ee717be5055e96";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>




  <noscript>
  <style type="text/css">
    .use-motion .motion-element,
    .use-motion .brand,
    .use-motion .menu-item,
    .sidebar-inner,
    .use-motion .post-block,
    .use-motion .pagination,
    .use-motion .comments,
    .use-motion .post-header,
    .use-motion .post-body,
    .use-motion .collection-title { opacity: initial; }

    .use-motion .logo,
    .use-motion .site-title,
    .use-motion .site-subtitle {
      opacity: initial;
      top: initial;
    }

    .use-motion {
      .logo-line-before i { left: initial; }
      .logo-line-after i { right: initial; }
    }
  </style>
</noscript>

</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-CN">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">whiledoing</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
    
      
        <p class="site-subtitle">喜欢一切简单且美的事物，包括人。</p>
      
    
  </div>

  <div class="site-nav-toggle">
    <button aria-label="切换导航栏">
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>



<nav class="site-nav">
  
    <ul id="menu" class="menu">
      
        
        
        
          
          <li class="menu-item menu-item-home">
    <a href="/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-home"></i> <br />首页</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-about">
    <a href="/about/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-user"></i> <br />关于</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-tags">
    <a href="/tags/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />标签</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-archives">
    <a href="/archives/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />归档</a>
  </li>

      
      
    </ul>
  

  
    

  

  
</nav>



  



</div>
    </header>

    


    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  
    <div class="reading-progress-bar"></div>
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://whiledoing.me/2018/04/09/summary/summary-take-care-of-grandpa/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="whiledoing">
      <meta itemprop="description" content="喜欢一切简单且美的事物，包括人。">
      <meta itemprop="image" content="/images/avatar.jpeg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="whiledoing">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">照顾爷爷的这120天
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">

            
            
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              

              
                
              

              <time title="创建时间：2018-04-09 13:22:09" itemprop="dateCreated datePublished" datetime="2018-04-09T13:22:09+08:00">2018-04-09</time>
            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body han-init-context" itemprop="articleBody">

      
      

      
        <p>&#x7237;&#x7237;&#x751F;&#x75C5;&#x4E0D;&#x77E5;&#x4E0D;&#x89C9;&#x5DF2;&#x7ECF;&#x6709;130&#x591A;&#x5929;&#x4E86;&#xFF0C;&#x7B97;&#x4E0A;&#x6211;&#x4E2D;&#x95F4;&#x4F11;&#x606F;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x6211;&#x966A;&#x540C;&#x7167;&#x987E;&#x4E86;&#x4ED6;&#x7EA6;&#x6709;120&#x5929;&#x65F6;&#x95F4;&#x3002;&#x671F;&#x95F4;&#x6211;&#x7ECF;&#x5386;&#x4E86;&#x8BF8;&#x591A;&#x56F0;&#x96BE;&#xFF0C;&#x5185;&#x5FC3;&#x5E38;&#x5E38;&#x5145;&#x6EE1;&#x4E86;&#x7EA0;&#x7ED3;&#xFF0C;&#x96BE;&#x53D7;&#xFF0C;&#x56F0;&#x60D1;&#xFF0C;&#x7126;&#x8651;&#xFF0C;&#x4F46;&#x5374;&#x53C8;&#x90FD;&#x4E00;&#x76F4;&#x575A;&#x76F8;&#x300C;&#x529F;&#x4E0D;&#x5510;&#x6350;&#x300D;&#xFF0C;&#x660E;&#x5929;&#x4E00;&#x5B9A;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x597D;&#x3002;&#x8FD9;120&#x5929;&#x5BF9;&#x6211;&#x800C;&#x8A00;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x6211;&#x4EBA;&#x751F;&#x4E2D;&#x6700;&#x75DB;&#x82E6;&#x5374;&#x53C8;&#x6700;&#x4E50;&#x89C2;&#x7684;&#x4E00;&#x6BB5;&#x65E5;&#x5B50;&#x3002;&#x73B0;&#x5728;&#x7237;&#x7237;&#x7684;&#x72B6;&#x51B5;&#x5DF2;&#x7ECF;&#x5927;&#x597D;&#x4E8E;&#x4ECE;&#x524D;&#xFF0C;&#x751F;&#x6D3B;&#x548C;&#x6CBB;&#x7597;&#x60C5;&#x51B5;&#x4E5F;&#x90FD;&#x8D8B;&#x4E8E;&#x7A33;&#x5B9A;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4E5F;&#x5C31;&#x62BD;&#x624B;&#x4E0D;&#x518D;&#x4E00;&#x76F4;&#x7167;&#x987E;&#xFF0C;&#x800C;&#x662F;&#x56DE;&#x5230;&#x676D;&#x5DDE;&#x5F00;&#x59CB;&#x5FD9;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x4ECE;&#x53BB;&#x5E74;&#x516B;&#x6708;&#x4EFD;&#x79BB;&#x804C;&#x7B97;&#x8D77;&#xFF0C;&#x6211;&#x5DF2;&#x7ECF;&#x534A;&#x5E74;&#x6CA1;&#x5DE5;&#x4F5C;&#xFF0C;&#x662F;&#x65F6;&#x5019;&#x5F00;&#x59CB;&#x81EA;&#x5DF1;&#x7684;&#x65B0;&#x6311;&#x6218;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x518D;&#x91CD;&#x65B0;&#x51FA;&#x53D1;&#x4E4B;&#x524D;&#xFF0C;&#x60F3;&#x7740;&#x5199;&#x7BC7;&#x535A;&#x5BA2;&#x8BB0;&#x5F55;&#x4E0B;&#x81EA;&#x5DF1;&#x8FD9;&#x75DB;&#x82E6;&#x5374;&#x53C8;&#x575A;&#x5B9A;&#x7684;120&#x5929;&#xFF0C;&#x662F;&#x4E3A;&#x7EAA;&#x5FF5;&#x3002;</p>
<a id="more"></a>
<h2 id="&#x533B;&#x9662;">&#x533B;&#x9662;</h2>
<p>&#x6211;&#x4E4B;&#x524D;&#x5F88;&#x5C11;&#x53BB;&#x533B;&#x9662;&#xFF0C;&#x4E00;&#x822C;&#x4E5F;&#x90FD;&#x5C0F;&#x6BDB;&#x75C5;&#xFF0C;&#x81EA;&#x5DF1;&#x625B;&#x4E00;&#x625B;&#x5403;&#x70B9;&#x836F;&#x5C31;&#x597D;&#x4E86;&#xFF0C;&#x751A;&#x81F3;&#x8FDE;&#x533B;&#x9662;&#x7684;&#x770B;&#x75C5;&#x6D41;&#x7A0B;&#x90FD;&#x4E0D;&#x662F;&#x5F88;&#x719F;&#x6089;&#x3002;&#x7ED3;&#x679C;&#x901A;&#x8FC7;&#x5728;&#x5357;&#x4EAC;&#x5927;&#x5927;&#x5C0F;&#x5C0F;&#xFF0C;&#x4E0D;&#x540C;&#x5C5E;&#x6027;&#x7684;&#x4E94;&#x5BB6;&#x533B;&#x9662;&#x5FD9;&#x4E86;120&#x5929;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x8BF4;&#x5BF9;&#x533B;&#x9662;&#x7684;&#x7EC4;&#x7EC7;&#x67B6;&#x6784;&#xFF0C;&#x533B;&#x62A4;&#x5173;&#x7CFB;&#xFF0C;&#x533B;&#x60A3;&#x5173;&#x7CFB;&#xFF0C;&#x73B0;&#x5B9E;&#x5229;&#x76CA;&#x51B2;&#x7A81;&#x7B49;&#x60C5;&#x51B5;&#x90FD;&#x6709;&#x4E86;&#x66F4;&#x6DF1;&#x523B;&#x7684;&#x8BA4;&#x8BC6;&#x3002;&#x800C;&#x66F4;&#x6DF1;&#x523B;&#x7684;&#x8BA4;&#x8BC6;&#x6709;&#x5229;&#x4E8E;&#x81EA;&#x5DF1;&#x66F4;&#x597D;&#x7684;&#x5904;&#x7406;&#x5728;&#x533B;&#x9662;&#x6CBB;&#x7597;&#x8FC7;&#x7A0B;&#x4E2D;&#x9047;&#x5230;&#x7684;&#x65B9;&#x65B9;&#x9762;&#x9762;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6240;&#x4EE5;&#x7406;&#x89E3;&#x6E38;&#x620F;&#x89C4;&#x5219;&#x5728;&#x4EC0;&#x4E48;&#x60C5;&#x5883;&#x4E0B;&#x90FD;&#x5F88;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x5F00;&#x59CB;&#x7237;&#x7237;&#x662F;&#x5728;&#x4EBA;&#x6C11;&#x533B;&#x9662;&#x795E;&#x7ECF;&#x5185;&#x79D1;&#x8FDB;&#x884C;&#x6EB6;&#x6813;&#x6CBB;&#x7597;&#xFF0C;&#x6CBB;&#x7597;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x53C8;&#x51FA;&#x73B0;&#x4E86;&#x8111;&#x51FA;&#x8840;&#xFF0C;&#x4E3B;&#x4EFB;&#x8BF4;&#x5F88;&#x591A;&#x6CBB;&#x7597;&#x65B9;&#x6848;&#x90FD;&#x662F;&#x77DB;&#x76FE;&#x7684;&#xFF1A;&#x5982;&#x679C;&#x6EB6;&#x6813;&#x8BA1;&#x91CF;&#x4E0D;&#x591F;&#xFF0C;&#x5C31;&#x4F1A;&#x5BFC;&#x81F4;&#x8111;&#x6897;&#x6D88;&#x4E0D;&#x4E86;&#xFF0C;&#x6897;&#x7684;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x3002;&#x4F46;&#x662F;&#x4E0A;&#x4E86;&#x6EB6;&#x6813;&#x8BA1;&#x91CF;&#xFF0C;&#x53C8;&#x5BB9;&#x6613;&#x5BFC;&#x81F4;&#x8111;&#x51FA;&#x8840;&#xFF0C;&#x6240;&#x4EE5;&#x6CBB;&#x7597;&#x65B9;&#x6848;&#x5C31;&#x662F;&#x627E;&#x5E73;&#x8861;&#x3002;&#x540E;&#x6765;&#x6211;&#x5728;&#x7167;&#x987E;&#x7237;&#x7237;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x624D;&#x6DF1;&#x523B;&#x5730;&#x7406;&#x89E3;&#x5230;&#x300C;&#x77DB;&#x76FE;&#x8BBA;&#x300D;&#x4E4B;&#x6DF1;&#x523B;&#xFF0C;&#x6240;&#x8C13;&#x7684;&#x5E73;&#x8861;&#x7EDD;&#x975E;&#x6613;&#x4E8B;&#xFF0C;&#x800C;&#x5E73;&#x8861;&#x5374;&#x53C8;&#x4F53;&#x73B0;&#x5728;&#x751F;&#x6D3B;&#x7684;&#x65B9;&#x65B9;&#x9762;&#x9762;&#x3002;</p>
<p>&#x7EA6;&#x4E00;&#x4E2A;&#x6708;&#x540E;&#xFF0C;&#x7237;&#x7237;&#x7684;&#x8111;&#x6897;&#x5DF2;&#x7ECF;&#x758F;&#x901A;&#x5F97;&#x5DEE;&#x4E0D;&#x591A;&#x4E86;&#xFF0C;&#x6BCF;&#x5929;&#x6302;&#x6C34;&#x4E3B;&#x8981;&#x662F;&#x6D88;&#x9664;&#x8111;&#x6C34;&#x80BF;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x8F6C;&#x79FB;&#x5230;&#x7701;&#x4EBA;&#x533B;&#x7684;&#x5EB7;&#x590D;&#x79D1;&#x6CBB;&#x7597;&#x3002;&#x5F53;&#x65F6;&#x6211;&#x548C;&#x5BB6;&#x4EBA;&#x90FD;&#x89C9;&#x5F97;&#x4FE1;&#x5FC3;&#x6EE1;&#x6EE1;&#xFF0C;&#x89C9;&#x5F97;&#x901A;&#x8FC7;&#x4E00;&#x5B9A;&#x7684;&#x5EB7;&#x590D;&#x53EF;&#x4EE5;&#x8BA9;&#x7237;&#x7237;&#x6062;&#x590D;&#x8EAB;&#x4F53;&#x7684;&#x884C;&#x52A8;&#x80FD;&#x529B;&#x548C;&#x5927;&#x8111;&#x7684;&#x8BA4;&#x77E5;&#xFF0C;&#x751A;&#x81F3;&#x53D8;&#x6210;&#x75C5;&#x524D;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x4F46;&#x73B0;&#x5B9E;&#x6DF1;&#x523B;&#x5730;&#x7ED9;&#x6211;&#x4E0A;&#x4E86;&#x4E00;&#x8BFE;&#x3002;&#x4E00;&#x6765;&#x7237;&#x7237;&#x7684;&#x60C5;&#x51B5;&#x5176;&#x5B9E;&#x6BD4;&#x8F83;&#x91CD;&#xFF0C;&#x8111;&#x5B50;&#x53D7;&#x5F71;&#x54CD;&#x533A;&#x57DF;&#x8F83;&#x591A;&#x3002;&#x4E8C;&#x6765;&#x4ED6;&#x4E5D;&#x5341;&#x4E86;&#xFF0C;&#x6062;&#x590D;&#x8D77;&#x6765;&#x4E5F;&#x6BD4;&#x8F83;&#x6162;&#x3002;&#x90A3;&#x4F1A;&#x6211;&#x6BCF;&#x5929;&#x5934;&#x75BC;&#x7684;&#x4E8B;&#x60C5;&#x5F88;&#x591A;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x5982;&#x4F55;&#x6709;&#x6548;&#x5730;&#x5B89;&#x6392;&#x597D;&#x6CBB;&#x7597;&#x548C;&#x4F5C;&#x606F;&#xFF1B;&#x5982;&#x4F55;&#x5582;&#x98DF;&#xFF1B;&#x5982;&#x4F55;&#x534F;&#x8C03;&#x597D;&#x548C;&#x540C;&#x75C5;&#x623F;&#x7684;&#x4EBA;&#x5458;&#x5173;&#x7CFB;&#x7B49;&#x3002;&#x4E5F;&#x662F;&#x90A3;&#x6BB5;&#x65F6;&#x95F4;&#x6BCF;&#x5929;&#x90FD;&#x4F1A;&#x8BB0;&#x5F55;&#x65E5;&#x8BB0;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x5929;&#x4E00;&#x65E9;&#x4E0A;&#x8D77;&#x6765;&#x4E0D;&#x4EC5;&#x662F;&#x8EAB;&#x4F53;&#x7684;&#x75B2;&#x60EB;&#x4E5F;&#x662F;&#x5FC3;&#x7075;&#x7684;&#x75B2;&#x60EB;&#xFF0C;&#x7167;&#x987E;&#x7237;&#x7237;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x9700;&#x8981;&#x4E0D;&#x505C;&#x53BB;&#x601D;&#x8003;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x3002;&#x8BB0;&#x5F55;&#x6709;&#x65F6;&#x5019;&#x7ED9;&#x81EA;&#x5DF1;&#x7406;&#x987A;&#x4E86;&#x601D;&#x8DEF;&#xFF0C;&#x540C;&#x6837;&#x4E5F;&#x7406;&#x987A;&#x4E86;&#x4FE1;&#x5FF5;&#x3002;</p>
<p>&#x53C8;&#x8FC7;&#x4E86;&#x4E00;&#x4E2A;&#x6708;&#xFF0C;&#x5728;&#x4EBA;&#x6C11;&#x533B;&#x9662;&#x7684;&#x5EB7;&#x590D;&#x5DF2;&#x7ECF;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x7279;&#x6B8A;&#x6CBB;&#x7597;&#xFF0C;&#x4F46;&#x7237;&#x7237;&#x6062;&#x590D;&#x5176;&#x5B9E;&#x6CA1;&#x6709;&#x592A;&#x5927;&#x8D77;&#x8272;&#xFF0C;&#x5BB6;&#x91CC;&#x4EBA;&#x8BA8;&#x8BBA;&#x540E;&#x51B3;&#x5B9A;&#x53BB;&#x8BD5;&#x8BD5;&#x770B;&#x4E2D;&#x533B;&#x9488;&#x7078;&#xFF1A;&#x636E;&#x8BF4;&#x9488;&#x7078;&#x6CBB;&#x7597;&#x4E2D;&#x98CE;&#x8FD9;&#x5757;&#x662F;&#x4E2A;&#x5F3A;&#x9879;&#x3002;&#x4E8E;&#x662F;&#x6211;&#x4EEC;&#x8F6C;&#x79FB;&#x5230;&#x4E86;&#x7701;&#x4E2D;&#x533B;&#x9662;&#x7684;&#x9488;&#x7078;&#x5EB7;&#x590D;&#x79D1;&#x8FDB;&#x884C;&#x6CBB;&#x7597;&#x3002;&#x4E3B;&#x4EFB;&#x548C;&#x6211;&#x4EEC;&#x804A;&#x75C5;&#x60C5;&#x65F6;&#x5C31;&#x8BF4;&#xFF1A;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x662F;&#x4E0D;&#x8981;&#x6709;&#x76EE;&#x6807;&#xFF0C;&#x80FD;&#x63D0;&#x9AD8;&#x4E00;&#x70B9;&#x5C31;&#x63D0;&#x9AD8;&#x4E00;&#x70B9;&#xFF0C;&#x5FC3;&#x7406;&#x4E0A;&#x8981;&#x6709;&#x9884;&#x671F;&#x3002;&#x7237;&#x7237;&#x73B0;&#x5728;&#x8FD9;&#x4E2A;&#x60C5;&#x51B5;&#x8981;&#x6062;&#x590D;&#x662F;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#xFF0C;&#x57FA;&#x672C;&#x4E0D;&#x73B0;&#x5B9E;&#xFF0C;&#x6240;&#x4EE5;&#x4E3B;&#x8981;&#x76EE;&#x6807;&#x662F;&#x63D0;&#x9AD8;&#x4E00;&#x4E0B;&#x5750;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x8170;&#x7684;&#x529B;&#x91CF;&#x3002;&#x4EE5;&#x540E;&#x53EF;&#x4EE5;&#x66F4;&#x4E45;&#x5730;&#x5750;&#x8F6E;&#x6905;&#xFF0C;&#x8170;&#x90E8;&#x6709;&#x529B;&#x91CF;&#x7684;&#x8BDD;&#xFF0C;&#x89E3;&#x5927;&#x4FBF;&#x4E5F;&#x66F4;&#x987A;&#x7545;&#x4E9B;&#x3002;&#x867D;&#x8BF4;&#x542C;&#x4E86;&#x8FD9;&#x8BDD;&#x5FC3;&#x7406;&#x4E0A;&#x5F88;&#x96BE;&#x53D7;&#xFF0C;&#x4F46;&#x56DE;&#x5F52;&#x5230;&#x73B0;&#x5B9E;&#x53C8;&#x786E;&#x662F;&#x5982;&#x6B64;&#x3002;&#x5927;&#x8111;&#x7684;&#x53D7;&#x635F;&#x4E0D;&#x7B49;&#x4E8E;&#x5176;&#x4ED6;&#x7684;&#x53D7;&#x635F;&#xFF0C;&#x5B83;&#x662F;&#x4E0D;&#x53EF;&#x9006;&#x7684;&#x3002;&#x4F46;&#x5728;&#x7701;&#x4E2D;&#x533B;&#x9662;&#x5E76;&#x6CA1;&#x6709;&#x4F4F;&#x5F88;&#x4E45;&#x6211;&#x4EEC;&#x5C31;&#x53C8;&#x8F6C;&#x79FB;&#x4E86;&#x3002;&#x4E00;&#x6765;&#x662F;&#x56E0;&#x4E3A;&#x7701;&#x4E2D;&#x533B;&#x9662;&#x7684;&#x5EB7;&#x590D;&#x79D1;&#x662F;&#x8001;&#x697C;&#xFF0C;&#x4F4F;&#x623F;&#x6761;&#x4EF6;&#x975E;&#x5E38;&#x6709;&#x9650;&#xFF0C;&#x4E8C;&#x6765;&#x662F;&#x6211;&#x7237;&#x7237;&#x591C;&#x91CC;&#x4F1A;&#x95F9;&#xFF0C;&#x800C;&#x4E14;&#x95F9;&#x7684;&#x8FD8;&#x6BD4;&#x8F83;&#x5389;&#x5BB3;&#x3002;&#x4E3A;&#x6B64;&#x6709;&#x4E00;&#x5929;&#x665A;&#x4E0A;&#x6211;&#x88AB;&#x540C;&#x75C5;&#x623F;&#x516D;&#x5341;&#x6765;&#x5C81;&#x7684;&#x5927;&#x53D4;&#x9A82;&#x4E86;&#x534A;&#x4E2A;&#x5C0F;&#x65F6;&#x2014;&#x2014;&#x8138;&#x90FD;&#x9A82;&#x7684;&#x901A;&#x7EA2;&#xFF0C;&#x6211;&#x4E00;&#x53E5;&#x8BDD;&#x4E5F;&#x6CA1;&#x8BF4;&#x4E5F;&#x6CA1;&#x6709;&#x9876;&#x649E;&#xFF0C;&#x53EA;&#x80FD;&#x5FCD;&#x53D7;&#x3002;&#x56E0;&#x4E3A;&#x672C;&#x6765;&#x786E;&#x5B9E;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x95EE;&#x9898;&#x5BFC;&#x81F4;&#x522B;&#x4EBA;&#x591C;&#x91CC;&#x7761;&#x4E0D;&#x4E86;&#xFF0C;&#x9A82;&#x9A82;&#x5C31;&#x9A82;&#x9A82;&#x3002;&#x767D;&#x5929;&#x6211;&#x5C31;&#x548C;&#x522B;&#x4EBA;&#x8BF4;&#x6211;&#x4EEC;&#x5728;&#x8C03;&#x836F;&#x89E3;&#x51B3;&#xFF0C;&#x4F46;&#x5176;&#x5B9E;&#x57FA;&#x672C;&#x4E0A;&#x665A;&#x4E0A;&#x7ED9;&#x7684;&#x5B89;&#x7720;&#x836F;&#x80FD;&#x4E0D;&#x5403;&#x5C31;&#x4E0D;&#x5403;&#xFF0C;&#x672C;&#x6765;&#x7237;&#x7237;&#x7684;&#x8111;&#x795E;&#x7ECF;&#x5C31;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#xFF0C;&#x5982;&#x679C;&#x5403;&#x5B89;&#x7720;&#x7C7B;&#x7684;&#x7CBE;&#x795E;&#x836F;&#x7269;&#xFF0C;&#x66F4;&#x52A0;&#x5F71;&#x54CD;&#x5927;&#x8111;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x4E2D;&#x533B;&#x9662;&#x65F6;&#x5019;&#xFF0C;&#x591C;&#x91CC;&#x6211;&#x57FA;&#x672C;&#x4E0D;&#x600E;&#x4E48;&#x7761;&#xFF0C;&#x53EA;&#x8981;&#x4ED6;&#x95F9;&#x4E86;&#x6211;&#x5C31;&#x5728;&#x65C1;&#x8FB9;&#x5B89;&#x629A;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x77E5;&#x9053;&#x5B89;&#x629A;&#x7684;&#x4F5C;&#x7528;&#x751A;&#x5FAE;&#xFF0C;&#x56E0;&#x4E3A;&#x7237;&#x7237;&#x4ED6;&#x60F3;&#x95F9;&#x662F;&#x4E0D;&#x53D7;&#x5927;&#x8111;&#x63A7;&#x5236;&#x7684;&#xFF0C;&#x6211;&#x7684;&#x5B89;&#x629A;&#x66F4;&#x591A;&#x662F;&#x5B89;&#x629A;&#x522B;&#x4EBA;&#xFF0C;&#x4E0D;&#x8FD9;&#x6837;&#x5B50;&#x7684;&#x8BDD;&#xFF0C;&#x4F30;&#x8BA1;&#x6BCF;&#x5929;&#x90FD;&#x8981;&#x6709;&#x4EBA;&#x6765;&#x8BF4;&#x4E0D;&#x662F;&#x4E86;&#x3002;&#x60F3;&#x6765;&#xFF0C;&#x770B;&#x75C5;&#x771F;&#x7684;&#x4E0D;&#x5BB9;&#x6613;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x5C31;&#x8F6C;&#x5230;&#x4E86;&#x4E00;&#x5BB6;&#x793E;&#x533A;&#x533B;&#x9662;&#xFF0C;&#x4E00;&#x5BB6;&#x533B;&#x517B;&#x7ED3;&#x5408;&#x7684;&#x533B;&#x9662;&#x3002;&#x793E;&#x533A;&#x533B;&#x9662;&#x7684;&#x597D;&#x5904;&#x5C31;&#x662F;&#xFF0C;&#x4EBA;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x591A;&#xFF0C;&#x8D39;&#x7528;&#x4E5F;&#x76F8;&#x5BF9;&#x4FBF;&#x5B9C;&#xFF0C;&#x81F3;&#x5C11;&#x4E0D;&#x4F1A;&#x592A;&#x5F71;&#x54CD;&#x522B;&#x4EBA;&#x3002;&#x4F46;&#x793E;&#x533A;&#x533B;&#x9662;&#x7684;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#x533B;&#x751F;&#x6C34;&#x5E73;&#x6709;&#x9650;&#xFF0C;&#x7528;&#x836F;&#x4E5F;&#x6709;&#x9650;&#xFF0C;&#x5982;&#x679C;&#x51FA;&#x73B0;&#x5927;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x8F6C;&#x79FB;&#x5230;&#x4E0A;&#x7EA7;&#x533B;&#x9662;&#x3002;&#x7ED3;&#x679C;&#x4E5F;&#x5982;&#x6B64;&#xFF0C;&#x6CA1;&#x4F4F;&#x591A;&#x4E45;&#x7237;&#x7237;&#x5C31;&#x80BA;&#x90E8;&#x611F;&#x67D3;&#xFF0C;&#x5F97;&#x4E86;&#x80BA;&#x708E;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5728;&#x8FC7;&#x5E74;&#x524D;&#x53C8;&#x8F6C;&#x5230;&#x4E86;&#x660E;&#x57FA;&#x533B;&#x9662;&#xFF0C;&#x4E00;&#x5BB6;&#x79C1;&#x7ACB;&#x6C11;&#x8425;&#x6027;&#x8D28;&#x7684;&#x533B;&#x9662;&#x3002;</p>
<p>&#x79C1;&#x7ACB;&#x533B;&#x9662;&#x7684;&#x7279;&#x70B9;&#xFF1A;&#x4E00;&#x6D41;&#x7684;&#x786C;&#x4EF6;&#xFF0C;&#x4F46;&#x662F;&#x76F8;&#x5BF9;&#x4E8C;&#x6D41;&#x7684;&#x533B;&#x751F;&#x3002;&#x672C;&#x6765;&#x6211;&#x4EEC;&#x662F;&#x6253;&#x7B97;&#x53BB;&#x4EBA;&#x6C11;&#x533B;&#x9662;&#xFF0C;&#x4E3A;&#x6B64;&#x6211;&#x8FD8;&#x8DD1;&#x4E86;&#x4EBA;&#x6C11;&#x533B;&#x9662;&#x597D;&#x51E0;&#x6B21;&#xFF0C;&#x533B;&#x751F;&#x544A;&#x8BC9;&#x6211;&#xFF0C;&#x8FC7;&#x5E74;&#x671F;&#x95F4;&#x8FDE;&#x8D70;&#x5ECA;&#x7684;&#x75C5;&#x5E8A;&#x90FD;&#x6EE1;&#x4E86;&#xFF0C;&#x63A8;&#x8350;&#x6211;&#x6765;&#x660E;&#x57FA;&#x533B;&#x9662;&#xFF0C;&#x4EBA;&#x5C11;&#x75C5;&#x623F;&#x53C8;&#x5BBD;&#x655E;&#x3002;&#x6765;&#x4E86;&#x540E;&#x53D1;&#x73B0;&#x679C;&#x7136;&#x5982;&#x6B64;&#xFF0C;&#x75C5;&#x623F;&#x975E;&#x5E38;&#x5F97;&#x5BBD;&#x655E;&#xFF0C;&#x91C7;&#x5149;&#x4E5F;&#x597D;&#xFF0C;&#x4EBA;&#x76F8;&#x5BF9;&#x4E5F;&#x4E0D;&#x591A;&#x3002;&#x4F46;&#x79C1;&#x7ACB;&#x533B;&#x9662;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x6CA1;&#x6709;&#x597D;&#x533B;&#x751F;&#xFF0C;&#x597D;&#x7684;&#x533B;&#x751F;&#x4E00;&#x822C;&#x90FD;&#x5728;&#x516C;&#x7ACB;&#x4E09;&#x7532;&#x533B;&#x9662;&#x624E;&#x5806;&#x3002;&#x75C5;&#x4EBA;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x5B81;&#x613F;&#x624E;&#x5806;&#x4EBA;&#x6EE1;&#x4E3A;&#x60A3;&#x7684;&#x516C;&#x7ACB;&#x533B;&#x9662;&#xFF0C;&#x4E5F;&#x4E0D;&#x613F;&#x610F;&#x5230;&#x522B;&#x7684;&#x5730;&#x65B9;&#x53BB;&#x770B;&#x75C5;&#x3002;&#x8FD9;&#x662F;&#x8D44;&#x6E90;&#x914D;&#x7F6E;&#x4E0D;&#x5E73;&#x8861;&#x548C;&#x9519;&#x4F4D;&#x7684;&#x73B0;&#x5B9E;&#x65E0;&#x5948;&#x3002;&#x8FD8;&#x597D;&#x5728;&#x660E;&#x57FA;&#x533B;&#x9662;&#x547C;&#x5438;&#x79D1;&#x7684;&#x4E3B;&#x6CBB;&#x533B;&#x751F;&#x975E;&#x5E38;&#x597D;&#xFF0C;&#x6BCF;&#x5929;&#x90FD;&#x6765;&#x67E5;&#x623F;&#x770B;&#x770B;&#x6211;&#x5BB6;&#x7237;&#x7237;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x751A;&#x81F3;&#x5728;&#x8FC7;&#x5E74;&#x671F;&#x95F4;&#x4E5F;&#x6CA1;&#x6709;&#x843D;&#x4E0B;&#x3002;&#x5F00;&#x59CB;&#x5230;&#x660E;&#x57FA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x8FD8;&#x62C5;&#x5FC3;&#x7237;&#x7237;&#x591C;&#x91CC;&#x4F1A;&#x95F9;&#xFF0C;&#x7ED3;&#x679C;&#x6765;&#x4E86;&#x4E4B;&#x540E;&#x4ED6;&#x591C;&#x91CC;&#x7761;&#x5F97;&#x5C31;&#x6709;&#x6240;&#x6539;&#x5584;&#xFF0C;&#x4E0D;&#x592A;&#x4F1A;&#x95F9;&#x4EBA;&#x4E86;&#xFF0C;&#x8FD9;&#x771F;&#x662F;&#x975E;&#x5E38;&#x795E;&#x5947;&#x548C;&#x4E0D;&#x5BB9;&#x6613;&#x7684;&#x8FDB;&#x6B65;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x6709;&#x610F;&#x601D;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#x548C;&#x6211;&#x4EEC;&#x540C;&#x4F4F;&#x4E00;&#x4E2A;&#x75C5;&#x623F;&#x7684;&#x4EBA;&#x90FD;&#x662F;&#x7279;&#x522B;&#x4E0A;&#x5E74;&#x7EAA;&#x6216;&#x8005;&#x75C5;&#x91CD;&#x7684;&#x8001;&#x4EBA;&#xFF0C;&#x6240;&#x4EE5;&#x5927;&#x5BB6;&#x4E5F;&#x90FD;&#x5728;&#x7406;&#x89E3;&#x4E2D;&#x5F97;&#x5230;&#x4E86;&#x5E73;&#x8861;&#x3002;</p>
<p>&#x5728;&#x660E;&#x57FA;&#x4F4F;&#x4E86;&#x4E00;&#x4E2A;&#x6708;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x53C8;&#x8F6C;&#x5230;&#x53E6;&#x5916;&#x4E00;&#x5BB6;&#x793E;&#x533A;&#x533B;&#x9662;&#xFF0C;&#x4E3B;&#x8981;&#x517B;&#x8001;&#xFF0C;&#x5E26;&#x7740;&#x5EB7;&#x590D;&#x3002;&#x73B0;&#x5728;&#x6162;&#x6162;&#x7684;&#xFF0C;&#x7237;&#x7237;&#x8BA4;&#x8BC6;&#x6C34;&#x5E73;&#x4E0A;&#x6765;&#x4E86;&#x4E0D;&#x5C11;&#xFF0C;&#x548C;&#x6211;&#x4EEC;&#x4E5F;&#x80FD;&#x6709;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x987A;&#x7545;&#x7684;&#x6C9F;&#x901A;&#xFF0C;&#x867D;&#x7136;&#x5927;&#x591A;&#x6570;&#x65F6;&#x5019;&#x8BF4;&#x7684;&#x8FD8;&#x4E0D;&#x662F;&#x5F88;&#x6E05;&#x695A;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x53EA;&#x8A00;&#x7247;&#x8BED;&#x95F4;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x7406;&#x89E3;&#x5C31;&#x975E;&#x5E38;&#x4F7F;&#x4EBA;&#x6B23;&#x6170;&#x4E86;&#xFF1B;&#x665A;&#x4E0A;&#x4E5F;&#x4E0D;&#x90A3;&#x4E48;&#x95F9;&#x4EBA;&#xFF1B;&#x6700;&#x5F00;&#x5FC3;&#x7684;&#x662F;&#xFF0C;&#x524D;&#x51E0;&#x5929;&#x53BB;&#x6389;&#x4E86;&#x7559;&#x7F6E;&#x5C3F;&#x7BA1;&#xFF0C;&#x4ED6;&#x81EA;&#x5DF1;&#x53EF;&#x4EE5;&#x5C0F;&#x4FBF;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x8981;&#x5C0F;&#x4FBF;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x53EF;&#x4EE5;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#xFF0C;&#x8FD9;&#x771F;&#x662F;&#x8BA9;&#x4EBA;&#x5F00;&#x5FC3;&#x4E0D;&#x5DF2;&#x3002;&#x548C;&#x5927;&#x5C0F;&#x4FBF;&#x300C;&#x6297;&#x6218;&#x300D;&#x4E86;4&#x4E2A;&#x6708;&#xFF0C;&#x8FD9;&#x624D;&#x7B97;&#x662F;&#x53D6;&#x5F97;&#x4E86;&#x51B3;&#x5B9A;&#x6027;&#x7684;&#x80DC;&#x5229;&#x3002;&#x1F603;</p>
<h2 id="&#x751F;&#x547D;&#x4EBA;&#x6027;">&#x751F;&#x547D;&amp;&#x4EBA;&#x6027;</h2>
<p>&#x5982;&#x679C;&#x8BF4;&#x6709;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x6700;&#x80FD;&#x4F53;&#x73B0;&#x4EBA;&#x6027;&#xFF0C;&#x90A3;&#x7EDD;&#x5BF9;&#x662F;&#x533B;&#x9662;&#x4E86;&#x3002;&#x5728;&#x533B;&#x9662;&#x5F85;&#x4E86;&#x8FD9;&#x4E48;&#x4E45;&#xFF0C;&#x771F;&#x662F;&#x770B;&#x4E86;&#x975E;&#x5E38;&#x591A;&#x7684;&#x4EBA;&#x95F4;&#x60B2;&#x6B22;&#x79BB;&#x5408;&#x3002;&#x6709;&#x8111;&#x888B;&#x7F3A;&#x4E86;&#x534A;&#x8FB9;&#x7684;&#x4EBA;&#xFF0C;&#x6709;&#x4E8C;&#x5341;&#x6765;&#x5C81;&#x5C31;&#x8111;&#x6897;&#x4E0D;&#x80FD;&#x52A8;&#x7684;&#xFF0C;&#x6709;&#x6BCF;&#x5929;&#x665A;&#x4E0A;&#x4E0D;&#x505C;&#x95F9;&#x817E;&#x7684;&#xFF0C;&#x6709;&#x6CA1;&#x6709;&#x4EBA;&#x7BA1;&#x7684;&#x8001;&#x5E74;&#x4EBA;&#xFF0C;&#x6709;&#x5BB6;&#x5C5E;&#x6BCF;&#x5929;&#x5728;&#x533B;&#x9662;&#x89D2;&#x843D;&#x91CC;&#x9762;&#x54ED;&#x6CE3;&#x7684;&#xFF0C;&#x6709;&#x5BB6;&#x5C5E;&#x548C;&#x75C5;&#x4EBA;&#x5435;&#x67B6;&#x7684;&#xFF0C;&#x6709;&#x5BB6;&#x5C5E;&#x4E3A;&#x4E86;&#x94B1;&#x76F8;&#x4E92;&#x5435;&#x67B6;&#x7684;&#xFF0C;&#x6709;&#x5BB6;&#x5C5E;&#x4E00;&#x76F4;&#x7B49;&#x5728;&#x4E3B;&#x4EFB;&#x529E;&#x516C;&#x5BA4;&#x95E8;&#x53E3;&#x6E34;&#x6C42;&#x75C5;&#x5E8A;&#x7684;&#xFF0C;&#x6709;&#x5BB6;&#x5C5E;&#x5728;&#x8D70;&#x5ECA;&#x4E0A;&#x5927;&#x58F0;&#x8FB1;&#x9A82;&#x533B;&#x751F;&#x7684;&#xFF0C;&#x6709;&#x88AB;&#x75C5;&#x4EBA;&#x8FB1;&#x9A82;&#x54ED;&#x7684;&#x62A4;&#x58EB;&#xFF0C;&#x6709;&#x591C;&#x91CC;&#x6C14;&#x5598;&#x5401;&#x5401;&#x62A2;&#x6551;&#x75C5;&#x4EBA;&#x7684;&#x533B;&#x751F;&#xFF0C;&#x6709;&#x6BCF;&#x5929;&#x67E5;&#x623F;&#x8FC7;&#x6765;&#x5C31;&#x662F;&#x6577;&#x884D;&#x7684;&#x533B;&#x751F;&#xFF0C;&#x6709;&#x521D;&#x4E00;&#x5230;&#x521D;&#x4E03;&#x90FD;&#x6765;&#x67E5;&#x623F;&#x7684;&#x533B;&#x751F;&#x3002;&#x4EBA;&#x6027;&#xFF0C;&#x53EF;&#x80FD;&#x5927;&#x4F53;&#x5982;&#x6B64;&#x3002;</p>
<p>&#x5728;&#x660E;&#x57FA;&#x533B;&#x9662;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6709;&#x6BB5;&#x65F6;&#x95F4;&#x6BCF;&#x5929;&#x665A;&#x4E0A;&#x6211;&#x90FD;&#x770B;<a href="https://movie.douban.com/subject/26815163/" target="_blank" rel="noopener">&#x300A;&#x4EBA;&#x95F4;&#x4E16;&#x300B;&#x7EAA;&#x5F55;&#x7247;</a>&#x3002;&#x8BE5;&#x7247;&#x771F;&#x5B9E;&#x5730;&#x8BB0;&#x5F55;&#x548C;&#x8BA8;&#x8BBA;&#x4E86;&#x533B;&#x60A3;&#x5173;&#x7CFB;&#xFF0C;&#x6BCF;&#x96C6;&#x90FD;&#x6233;&#x52A8;&#x6CEA;&#x70B9;&#x3002;&#x5176;&#x4E2D;&#x6709;&#x4E00;&#x96C6;&#x8BB2;&#x4E34;&#x7EC8;&#x5173;&#x6000;&#xFF0C;&#x6211;&#x770B;&#x7684;&#x6CEA;&#x6D41;&#x6EE1;&#x9762;&#xFF0C;&#x6CA1;&#x60F3;&#x5230;&#x90A3;&#x5929;&#x591C;&#x91CC;&#xFF0C;&#x540C;&#x4E00;&#x4E2A;&#x75C5;&#x623F;&#x7684;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x8001;&#x4EBA;&#x5BB6;&#x5C31;&#x79BB;&#x5F00;&#x4E86;&#x4EBA;&#x4E16;&#x3002;</p>
<p>&#x90A3;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x6BCF;&#x5929;&#x665A;&#x4E0A;&#xFF0C;&#x6211;&#x90FD;&#x8EBA;&#x5728;&#x533B;&#x9662;&#x4E2D;&#x95F4;&#x6CA1;&#x6709;&#x75C5;&#x4EBA;&#x7684;&#x75C5;&#x5E8A;&#x4E0A;&#x7761;&#x89C9;&#xFF0C;&#x5DE6;&#x4FA7;&#x7761;&#x7740;&#x6211;&#x7237;&#x7237;&#xFF0C;&#x53F3;&#x4FA7;&#x7761;&#x7740;&#x4E00;&#x4F4D;96&#x5C81;&#x7684;&#x8001;&#x4EBA;&#x5BB6;&#x3002;&#x4ED6;&#x8EAB;&#x4E0A;&#x63D2;&#x7740;&#x76D1;&#x62A4;&#x4EEA;&#xFF0C;&#x6CA1;&#x8FC7;&#x4E00;&#x4F1A;&#x5C31;&#x4F1A;&#x53D1;&#x51FA;biubiu&#x7684;&#x8B66;&#x544A;&#x58F0;&#x97F3;&#x3002;&#x6211;&#x90A3;&#x6BB5;&#x65F6;&#x95F4;&#x591C;&#x91CC;&#x8981;&#x7ED9;&#x7237;&#x7237;&#x5BFC;&#x5C3F;&#xFF0C;&#x6240;&#x4EE5;&#x7761;&#x5F97;&#x6BD4;&#x8F83;&#x8FDF;&#x3002;&#x800C;&#x6211;&#x6BCF;&#x5929;&#x7761;&#x89C9;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x4F1A;&#x987A;&#x5E26;&#x770B;&#x4E0B;&#x8FD9;&#x4E2A;&#x8001;&#x7237;&#x5B50;&#x7684;&#x6307;&#x8109;&#x6C27;&#xFF0C;&#x5982;&#x679C;&#x8FC7;&#x4F4E;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x6C14;&#x5598;&#x4E0D;&#x4E0A;&#x6765;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x4ED6;&#x5BB6;&#x62A4;&#x5DE5;&#x7761;&#x7740;&#x6CA1;&#x6CE8;&#x610F;&#xFF0C;&#x6211;&#x5C31;&#x4F1A;&#x53BB;&#x901A;&#x77E5;&#x533B;&#x62A4;&#x4EBA;&#x5458;&#x6765;&#x8DDF;&#x8FDB;&#x5904;&#x7406;&#x3002;&#x90A3;&#x5929;&#x665A;&#x4E0A;&#x6211;&#x770B;&#x5B8C;&#x7EAA;&#x5F55;&#x7247;&#xFF0C;&#x7ED9;&#x6211;&#x5BB6;&#x7237;&#x7237;&#x5BFC;&#x5B8C;&#x5C3F;&#xFF0C;&#x987A;&#x9053;&#x770B;&#x4E86;&#x90A3;&#x4E2A;&#x8001;&#x7237;&#x5B50;&#x7684;&#x4F53;&#x5F81;&#x6570;&#x636E;&#x90FD;&#x633A;&#x597D;&#xFF0C;&#x5C31;&#x7761;&#x89C9;&#x4E86;&#x3002;&#x6CA1;&#x60F3;&#x5230;&#xFF0C;&#x591C;&#x91CC;&#x542C;&#x5230;&#x58F0;&#x97F3;&#x8D77;&#x6765;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53D1;&#x73B0;&#x8001;&#x7237;&#x5B50;&#x7684;&#x4EEA;&#x5668;&#x5DF2;&#x7ECF;&#x5168;&#x90E8;&#x64A4;&#x6389;&#xFF0C;&#x53EA;&#x6709;&#x8001;&#x4EBA;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x5F88;&#x5B89;&#x8BE6;&#x5730;&#x8EBA;&#x5728;&#x5E8A;&#x4E0A;&#x3002;&#x6211;&#x5927;&#x59D1;&#x544A;&#x8BC9;&#x6211;&#x665A;&#x4E0A;&#x533B;&#x751F;&#x6765;&#x62A2;&#x6551;&#xFF0C;&#x6211;&#x7761;&#x5F97;&#x592A;&#x6C89;&#x4E86;&#xFF0C;&#x60F3;&#x53EB;&#x9192;&#x6211;&#x90FD;&#x6CA1;&#x6709;&#x53EB;&#x9192;&#x3002;&#x540E;&#x6765;&#x591C;&#x91CC;&#x4ED6;&#x5BB6;&#x4EBA;&#x4E5F;&#x90FD;&#x8FC7;&#x6765;&#xFF0C;&#x7ED9;&#x8001;&#x4EBA;&#x7A7F;&#x4E0A;&#x65B0;&#x7684;&#x8863;&#x670D;&#xFF0C;&#x63A8;&#x5012;&#x4E86;&#x533B;&#x9662;&#x7684;&#x592A;&#x5E73;&#x95F4;&#x3002;&#x7B2C;&#x4E8C;&#x5929;&#x65E9;&#x4E0A;&#x540C;&#x4E00;&#x4E2A;&#x75C5;&#x5E8A;&#x53C8;&#x8F6C;&#x6765;&#x4E86;&#x4E00;&#x4E2A;&#x75C5;&#x4EBA;&#xFF0C;&#x5F53;&#x7136;&#x6211;&#x6CA1;&#x6709;&#x544A;&#x8BC9;&#x4ED6;&#x4EEC;&#x6628;&#x5929;&#x591C;&#x91CC;&#x4E00;&#x4E2A;&#x8001;&#x4EBA;&#x5BB6;&#x5C31;&#x5728;&#x8FD9;&#x4E2A;&#x5E8A;&#x4E0A;&#x8D70;&#x6389;&#xFF0C;&#x56E0;&#x4E3A;&#x5BF9;&#x4E8E;&#x533B;&#x9662;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x662F;&#x975E;&#x5E38;&#x666E;&#x904D;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x4F46;&#x5BF9;&#x6211;&#x800C;&#x8A00;&#xFF0C;&#x5374;&#x975E;&#x5E38;&#x9707;&#x64BC;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x7B2C;&#x4E00;&#x6B21;&#x76F4;&#x9762;&#x4EBA;&#x7684;&#x6B7B;&#x4EA1;&#x3002;&#x6628;&#x5929;&#x65E9;&#x4E0A;&#x8FD8;&#x5403;&#x4E1C;&#x897F;&#x597D;&#x597D;&#x7684;&#x8001;&#x4EBA;&#x5BB6;&#xFF0C;&#x665A;&#x4E0A;&#x5C31;&#x4E0D;&#x5728;&#x4E86;&#xFF0C;&#x800C;&#x7B2C;&#x4E8C;&#x5929;&#x53C8;&#x6362;&#x6765;&#x4E86;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x4ECE;ICU&#x8F6C;&#x8FC7;&#x6765;&#x7684;&#x8001;&#x4EBA;&#x5BB6;&#xFF0C;&#x8EAB;&#x4E0A;&#x4E5F;&#x63D2;&#x7740;&#x5404;&#x79CD;&#x7EBF;&#xFF0C;&#x5404;&#x79CD;&#x76D1;&#x63A7;&#x5668;&#x6750;&#x3002;&#x4EC0;&#x4E48;&#x770B;&#x4F3C;&#x6CA1;&#x6709;&#x53D8;&#xFF0C;&#x5374;&#x53C8;&#x90FD;&#x53D8;&#x5316;&#x4E86;&#x3002;&#x751F;&#x547D;&#x7684;&#x8F6E;&#x56DE;&#x5728;&#x8FD9;24&#x5C0F;&#x65F6;&#x5185;&#xFF0C;&#x5728;&#x8FD9;&#x5C0F;&#x5C0F;&#x7684;&#x75C5;&#x623F;&#x91CC;&#xFF0C;&#x4F53;&#x73B0;&#x5F97;&#x6DCB;&#x6F13;&#x5C3D;&#x81F4;&#x3002;&#x5C0A;&#x91CD;&#x6B7B;&#x4EA1;&#x4E5F;&#x5C31;&#x662F;&#x5C0A;&#x91CD;&#x751F;&#x547D;&#x3002;</p>
<p>&#x7EAA;&#x5F55;&#x7247;&#x4E2D;&#x8BF4;&#x5230;&#x8FC7;&#x533B;&#x751F;&#x7684;&#x5893;&#x5FD7;&#x94ED;&#xFF0C;&#x5F88;&#x6709;&#x610F;&#x601D;&#xFF1A;</p>
<blockquote>
<p>&#x6709;&#x65F6;&#xFF0C;&#x53BB;&#x6CBB;&#x6108;&#xFF1B;&#x5E38;&#x5E38;&#xFF0C;&#x53BB;&#x5E2E;&#x52A9;&#xFF1B;&#x603B;&#x662F;&#xFF0C;&#x53BB;&#x5B89;&#x6170;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x5C31;&#x662F;&#x771F;&#x5B9E;&#x7684;&#x4E16;&#x754C;&#x2014;&#x2014;&#x5373;&#x4F7F;&#x73B0;&#x5728;&#x533B;&#x5B66;&#x5DF2;&#x7ECF;&#x5982;&#x6B64;&#x53D1;&#x8FBE;&#xFF0C;&#x4F46;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x533B;&#x5B66;&#x89E3;&#x51B3;&#x4E0D;&#x4E86;&#x6240;&#x6709;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8BB0;&#x5F97;&#x4EE5;&#x524D;&#x770B;&#x8FC7;&#x8BF4;&#xFF1A;&#x75BE;&#x75C5;&#x662F;&#x4E0A;&#x5E1D;&#x521B;&#x9020;&#x7684;&#x4E00;&#x79CD;&#x8FDB;&#x5316;&#x6DD8;&#x6C70;&#x673A;&#x5236;&#x3002;&#x8FD9;&#x542C;&#x8D77;&#x6765;&#x786E;&#x5B9E;&#x6709;&#x4E9B;&#x6B8B;&#x9177;&#xFF0C;&#x5374;&#x53C8;&#x53D1;&#x4EBA;&#x6DF1;&#x7701;&#x3002;&#x4E0D;&#x8981;&#x7B49;&#x5230;&#x751F;&#x75C5;&#x4E86;&#xFF0C;&#x624D;&#x77E5;&#x9053;&#x5065;&#x5EB7;&#x7684;&#x91CD;&#x8981;&#x3002;&#x9632;&#x5FAE;&#x675C;&#x6E10;&#x5728;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x90FD;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x8EAB;&#x4F53;&#x624D;&#x662F;&#x9769;&#x547D;&#x7684;&#x672C;&#x94B1;&#xFF01;</p>
<h2 id="&#x73B0;&#x5B9E;">&#x73B0;&#x5B9E;</h2>
<p>&#x6CA1;&#x7ECF;&#x5386;&#x8FC7;&#x771F;&#x4E0D;&#x77E5;&#x9053;&#x627E;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x62A4;&#x5DE5;&#x662F;&#x591A;&#x4E48;&#x7684;&#x4E0D;&#x5BB9;&#x6613;&#x3002;&#x4E00;&#x65B9;&#x9762;&#x62A4;&#x5DE5;&#x4EBA;&#x6570;&#x4E25;&#x91CD;&#x4E0D;&#x8DB3;&#xFF0C;&#x5C31;&#x6C5F;&#x82CF;&#x7701;&#x800C;&#x8A00;&#xFF0C;&#x62A4;&#x5DE5;&#x7F3A;&#x5DE5;&#x5C31;&#x6709;&#x4E0A;&#x767E;&#x4E07;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x62A4;&#x5DE5;&#x7684;&#x95E8;&#x69DB;&#x6BD4;&#x8F83;&#x4F4E;&#xFF0C;&#x62A4;&#x7406;&#x6C34;&#x5E73;&#x975E;&#x5E38;&#x6709;&#x9650;&#x3002;&#x62A4;&#x5DE5;&#x5F88;&#x591A;&#x90FD;&#x56DB;&#x4E94;&#x5341;&#x5C81;&#xFF0C;&#x6765;&#x81EA;&#x519C;&#x6751;&#xFF0C;&#x6709;&#x7684;&#x751A;&#x81F3;&#x5B57;&#x4E5F;&#x4E0D;&#x8BA4;&#x8BC6;&#xFF0C;&#x5728;&#x7B80;&#x5355;&#x5730;&#x57F9;&#x8BAD;&#x4E86;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x770B;&#x62A4;&#x6280;&#x80FD;&#x540E;&#x5C31;&#x4E0A;&#x5C97;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x8981;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x6709;&#x7ECF;&#x9A8C;&#xFF0C;&#x4F1A;&#x62A4;&#x7406;&#xFF0C;&#x53C8;&#x5BCC;&#x6709;&#x8D23;&#x4EFB;&#x7684;&#x62A4;&#x5DE5;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x62A4;&#x5DE5;&#x7684;&#x62A4;&#x7406;&#x8D39;&#x7528;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x4F4E;&#xFF0C;&#x56E0;&#x4E3A;&#x62A4;&#x7406;&#x8D39;&#x5E76;&#x4E0D;&#x80FD;&#x533B;&#x4FDD;&#x6216;&#x8005;&#x62A5;&#x9500;&#xFF0C;&#x90FD;&#x662F;&#x81EA;&#x8D39;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x793E;&#x4F1A;&#x653F;&#x7B56;&#x6216;&#x8005;&#x673A;&#x5236;&#x53EF;&#x4EE5;&#x627F;&#x62C5;&#x6216;&#x964D;&#x4F4E;&#x98CE;&#x9669;&#x3002;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x75C5;&#x4EBA;&#x5BB6;&#x5C5E;&#x800C;&#x8A00;&#x786E;&#x5B9E;&#x5F88;&#x75DB;&#x82E6;&#xFF0C;&#x8981;&#x4E48;&#x82B1;&#x4E86;&#x94B1;&#x53C8;&#x4E0D;&#x653E;&#x5FC3;&#xFF0C;&#x8981;&#x4E48;&#x8BF7;&#x4E0D;&#x8D77;&#x62A4;&#x5DE5;&#x6216;&#x8005;&#x514B;&#x6263;&#x62A4;&#x5DE5;&#x3002;&#x56E0;&#x4E3A;&#x8BF7;&#x4E0D;&#x8D77;&#xFF0C;&#x62A4;&#x5DE5;&#x5DE5;&#x8D44;&#x5F97;&#x4E0D;&#x5230;&#x4FDD;&#x8BC1;&#xFF0C;&#x4E5F;&#x66F4;&#x6CA1;&#x6709;&#x4EBA;&#x613F;&#x610F;&#x6765;&#x505A;&#x8FD9;&#x4E00;&#x884C;&#x3002;</p>
<p>&#x5230;2030&#x5E74;&#x524D;&#x540E;&#xFF0C;&#x4E2D;&#x56FD;&#x7684;&#x8001;&#x9F84;&#x5316;&#x4EBA;&#x53E3;&#x5C06;&#x8D85;&#x8FC7;30%&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x72EC;&#x751F;&#x5B50;&#x5973;&#x8FD9;&#x4E00;&#x4EE3;&#x800C;&#x8A00;&#xFF0C;&#x4EE5;&#x540E;&#x8981;&#x9762;&#x5BF9;&#x7684;&#x7236;&#x6BCD;&#x517B;&#x8001;&#x95EE;&#x9898;&#x5C06;&#x975E;&#x5E38;&#x7684;&#x4E25;&#x5CFB;&#x3002;&#x4E4B;&#x524D;&#x6211;&#x548C;&#x5BB6;&#x91CC;&#x4ECE;&#x4E8B;&#x533B;&#x7597;&#x76F8;&#x5173;&#x5DE5;&#x4F5C;&#x7684;&#x5BB6;&#x4EBA;&#x8BA8;&#x8BBA;&#x8FC7;&#xFF0C;&#x4E2D;&#x56FD;&#x533B;&#x7597;&#x95EE;&#x9898;&#x7684;&#x6E90;&#x5934;&#x662F;&#x9876;&#x5C42;&#x8BBE;&#x8BA1;&#x548C;&#x94B1;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4E2D;&#x56FD;&#x7684;&#x533B;&#x7597;&#x5065;&#x5EB7;&#x5F00;&#x652F;&#x5360;GDP&#x7684;&#x6BD4;&#x91CD;&#x53EA;&#x6709;5.26%&#xFF0C;&#x8FDC;&#x8FDC;&#x4F4E;&#x4E8E;&#x5168;&#x7403;&#x7684;&#x5E73;&#x5747;&#x6C34;&#x5E73;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x94B1;&#xFF0C;&#x600E;&#x4E48;&#x4F1A;&#x6709;&#x597D;&#x7684;&#x533B;&#x751F;&#xFF0C;&#x600E;&#x4E48;&#x4F1A;&#x6709;&#x5065;&#x5EB7;&#x7684;&#x4EA7;&#x4E1A;&#x53D1;&#x5C55;&#xFF1F;&#x4F46;&#x5BF9;&#x4E0A;&#x9762;&#x7684;&#x4EBA;&#x800C;&#x8A00;&#xFF0C;&#x4ED6;&#x4EEC;&#x770B;&#x75C5;&#x90FD;&#x662F;&#x5E72;&#x90E8;&#x75C5;&#x623F;&#xFF0C;&#x4E5F;&#x65E0;&#x751A;&#x82B1;&#x9500;&#xFF08;&#x90FD;&#x62A5;&#x9500;&#xFF09;&#xFF0C;&#x5F53;&#x7136;&#x4E0D;&#x5BB9;&#x6613;&#x4ECE;&#x9876;&#x5C42;&#x8BBE;&#x8BA1;&#x4E0A;&#x8FDB;&#x884C;&#x52A8;&#x5200;&#x3002;&#x4E0D;&#x8FC7;&#x867D;&#x7136;&#x5982;&#x6B64;&#xFF0C;&#x6211;&#x8FD8;&#x662F;&#x5BF9;&#x672A;&#x6765;&#x5145;&#x6EE1;&#x4E86;&#x4FE1;&#x5FC3;&#x3002;&#x4E00;&#x6765;&#x662F;&#x56FD;&#x5BB6;&#x7684;&#x653F;&#x7B56;&#x6B63;&#x5728;&#x8D8A;&#x6765;&#x8D8A;&#x5F00;&#x653E;&#xFF0C;&#x5E02;&#x573A;&#x5728;&#x672A;&#x6765;&#x5C06;&#x8D77;&#x5230;&#x8D8A;&#x6765;&#x8D8A;&#x51B3;&#x5B9A;&#x6027;&#x7684;&#x793E;&#x4F1A;&#x63A8;&#x52A8;&#x4F5C;&#x7528;&#x3002;&#x8FD9;&#x4E48;&#x5927;&#x7684;&#x5E02;&#x573A;&#x9700;&#x6C42;&#xFF0C;&#x4E00;&#x5B9A;&#x4F1A;&#x6709;&#x66F4;&#x591A;&#x7684;&#x8D44;&#x6E90;&#x548C;&#x8D44;&#x91D1;&#x8FDB;&#x5165;&#x3002;&#x4E8C;&#x6765;&#x505A;&#x4E3A;&#x4ECE;&#x4E8B;&#x4FE1;&#x606F;&#x6280;&#x672F;&#x884C;&#x4E1A;&#x5DE5;&#x4F5C;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x6280;&#x672F;&#x7834;&#x58C1;&#x7EDD;&#x5BF9;&#x4F1A;&#x6210;&#x4E3A;&#x63A8;&#x52A8;&#x5236;&#x5EA6;&#x521B;&#x65B0;&#x7684;&#x91CD;&#x8981;&#x529B;&#x91CF;&#x2014;&#x2014;&#x6280;&#x672F;&#x7684;&#x4E0D;&#x53EF;&#x9006;&#x6027;&#x53EF;&#x4EE5;&#x6253;&#x7834;&#x65E2;&#x5F97;&#x5229;&#x76CA;&#x96C6;&#x56E2;&#x7684;&#x8F6C;&#x5165;&#x6027;&#x58C1;&#x5792;&#x3002;&#x672A;&#x6765;&#x7684;&#x5927;&#x5065;&#x5EB7;&#x548C;&#x517B;&#x8001;&#x4EA7;&#x4E1A;&#x6709;&#x5F88;&#x591A;&#x7684;&#x56F0;&#x96BE;&#xFF0C;&#x4F46;&#x4E5F;&#x8BF4;&#x660E;&#x6709;&#x66F4;&#x591A;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x5927;&#x6709;&#x53EF;&#x4E3A;&#x3002;</p>
<h2 id="wrap">wrap</h2>
<p>&#x5E0C;&#x671B;&#x6211;&#x4EEC;&#x7684;&#x56FD;&#x5BB6;&#x53EF;&#x4EE5;&#x53D8;&#x5F97;&#x66F4;&#x597D;&#xFF0C;&#x8BA9;&#x90A3;&#x4E9B;&#x4E3A;&#x56FD;&#x5BB6;&#x594B;&#x6597;&#x4E00;&#x8F88;&#x5B50;&#x7684;&#x4EBA;&#x8001;&#x6709;&#x6240;&#x4F9D;&#x3002;</p>
<p>&#x5E0C;&#x671B;&#x5BB6;&#x4EBA;&#x7684;&#x8EAB;&#x4F53;&#x5065;&#x5EB7;&#xFF0C;&#x5E73;&#x5B89;&#x3002;</p>
<p>&#x662F;&#x4E3A;&#x7EAA;&#x5FF5;&#x6BCF;&#x5929;&#x5F80;&#x8FD4;&#x533B;&#x9662;&#xFF0C;&#x751A;&#x81F3;&#x957F;&#x671F;&#x4F4F;&#x5728;&#x533B;&#x9662;&#x7684;&#x8FD9;120&#x5929;&#x3002;</p>
<p>ps: &#x5982;&#x679C;&#x9700;&#x8981;&#x8D2D;&#x7F6E;&#x8F6E;&#x6905;&#xFF0C;&#x8BF7;&#x4E00;&#x5B9A;&#x8981;&#x8D2D;&#x4E70;&#x7ECF;&#x6D4E;&#x8303;&#x56F4;&#x627F;&#x53D7;&#x5185;&#x6700;&#x597D;&#x7684;&#x8F6E;&#x6905;&#xFF0C;&#x5426;&#x5219;&#x4F60;&#x4F1A;&#x540E;&#x6094;&#x3002;</p>

      
    </div>

    
      

  <div class="popular-posts-header">相关文章</div>
  <ul class="popular-posts">
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/16/diary/diary-2017-12-12-TUE/" rel="bookmark">diary-2017-12-12-TUE</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2018/01/01/summary-2017/" rel="bookmark">关于2017</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/07/diary/diary-2017-12-06-WED/" rel="bookmark">diary-2017-12-06-WED</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/11/diary/diary-2017-12-07-THU/" rel="bookmark">diary-2017-12-07-THU</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/11/diary/diary-2017-12-08-FRI/" rel="bookmark">diary-2017-12-08-FRI</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/12/diary/diary-2017-12-09-SAT/" rel="bookmark">diary-2017-12-09-SAT</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/12/diary/diary-2017-12-10-SUN/" rel="bookmark">diary-2017-12-10-SUN</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/12/diary/diary-2017-12-11-MON/" rel="bookmark">diary-2017-12-11-MON</a></div>
      
    </li>
  
  </ul>


    

    
    
    

    

    

    
      <div>
        <ul class="post-copyright">
  <li class="post-copyright-author">
    <strong>本文作者： </strong>whiledoing</li>
  <li class="post-copyright-link">
    <strong>本文链接：</strong>
    <a href="http://whiledoing.me/2018/04/09/summary/summary-take-care-of-grandpa/" title="照顾爷爷的这120天">http://whiledoing.me/2018/04/09/summary/summary-take-care-of-grandpa/</a>
  </li>
  <li class="post-copyright-license">
    <strong>版权声明： </strong>本博客所有文章除特别声明外，均采用 <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/" rel="external nofollow" target="_blank">CC BY-NC-SA 4.0</a> 许可协议。转载请注明出处！</li>
</ul>

      </div>
    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/总结/" rel="tag"># 总结</a>
          
            <a href="/tags/爷爷/" rel="tag"># 爷爷</a>
          
        </div>
      

      
      
        <div class="post-widgets">
        

        

        
          
          <div class="social_share">
            
               <div>
                 
  <div class="bdsharebuttonbox">
    <a href="#" class="bds_tsina" data-cmd="tsina" title="分享到新浪微博"></a>
    <a href="#" class="bds_douban" data-cmd="douban" title="分享到豆瓣网"></a>
    <a href="#" class="bds_sqq" data-cmd="sqq" title="分享到QQ好友"></a>
    <a href="#" class="bds_qzone" data-cmd="qzone" title="分享到QQ空间"></a>
    <a href="#" class="bds_weixin" data-cmd="weixin" title="分享到微信"></a>
    <a href="#" class="bds_tieba" data-cmd="tieba" title="分享到百度贴吧"></a>
    <a href="#" class="bds_twi" data-cmd="twi" title="分享到Twitter"></a>
    <a href="#" class="bds_fbook" data-cmd="fbook" title="分享到Facebook"></a>
    <a href="#" class="bds_more" data-cmd="more"></a>
    <a class="bds_count" data-cmd="count"></a>
  </div>
  <script>
    window._bd_share_config = {
      "common": {
        "bdText": "",
        "bdMini": "2",
        "bdMiniList": false,
        "bdPic": ""
      },
      "share": {
        "bdSize": "16",
        "bdStyle": "0"
      },
      "image": {
        "viewList": ["tsina", "douban", "sqq", "qzone", "weixin", "twi", "fbook"],
        "viewText": "分享到：",
        "viewSize": "16"
      }
    }
  </script>

<script>
  with(document)0[(getElementsByTagName('head')[0]||body).appendChild(createElement('script')).src='//bdimg.share.baidu.com/static/api/js/share.js?cdnversion='+~(-new Date()/36e5)];
</script>

               </div>
            
            
          </div>
        
        </div>
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2018/04/08/note/one-men's-view-of-the-world-note/" rel="next" title="《李光耀观天下》与实用主义「信仰」的思考">
                <i class="fa fa-chevron-left"></i> 《李光耀观天下》与实用主义「信仰」的思考
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2018/04/11/ml/coursera-machine-learning-course-note/" rel="prev" title="Coursera - Andrew Ng - Machine Learning - 学习笔记">
                Coursera - Andrew Ng - Machine Learning - 学习笔记 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


  </div>


          </div>
          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <img class="site-author-image" itemprop="image"
                src="/images/avatar.jpeg"
                alt="whiledoing" />
            
              <p class="site-author-name" itemprop="name">whiledoing</p>
              <p class="site-description motion-element" itemprop="description">喜欢一切简单且美的事物，包括人。</p>
          </div>

          
            <nav class="site-state motion-element">
              
                <div class="site-state-item site-state-posts">
                
                  <a href="/archives/">
                
                    <span class="site-state-item-count">60</span>
                    <span class="site-state-item-name">日志</span>
                  </a>
                </div>
              

              

              
                
                
                <div class="site-state-item site-state-tags">
                  <a href="/tags/index.html">
                    
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                    <span class="site-state-item-count">32</span>
                    <span class="site-state-item-name">标签</span>
                  </a>
                </div>
              
            </nav>
          

          

          
            <div class="links-of-author motion-element">
              
                <span class="links-of-author-item">
                  <a href="https://github.com/whiledoing" target="_blank" title="GitHub">GitHub</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="http://www.douban.com/people/58249409" target="_blank" title="豆瓣">豆瓣</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="https://www.zhihu.com/people/whiledoing" target="_blank" title="知乎">知乎</a>
                  
                </span>
              
            </div>
          

          
          

          
          

          
            
          
          

        </div>
      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#医院"><span class="nav-number">1.</span> <span class="nav-text">医院</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#生命人性"><span class="nav-number">2.</span> <span class="nav-text">生命&amp;人性</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#现实"><span class="nav-number">3.</span> <span class="nav-text">现实</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#wrap"><span class="nav-number">4.</span> <span class="nav-text">wrap</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; 2016 – <span itemprop="copyrightYear">2018</span>
  <span class="with-love" id="animate">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">whiledoing</span>

  

  
</div>




  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动 v3.7.1</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 – <a class="theme-link" target="_blank" href="https://theme-next.org">NexT.Mist</a> v6.4.0</div>




        








        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

    
	
    

    
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>
























  



  
  
    <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/reading_progress/reading_progress.js"></script>
  


  


  <script type="text/javascript" src="/js/src/utils.js?v=6.4.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=6.4.0"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=6.4.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=6.4.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=6.4.0"></script>



  



  










  





  

  

  
<script>
(function(){
    var bp = document.createElement('script');
    var curProtocol = window.location.protocol.split(':')[0];
    if (curProtocol === 'https') {
        bp.src = 'https://zz.bdstatic.com/linksubmit/push.js';        
    }
    else {
        bp.src = 'http://push.zhanzhang.baidu.com/push.js';
    }
    var s = document.getElementsByTagName("script")[0];
    s.parentNode.insertBefore(bp, s);
})();
</script>


  
  

  
  

  


  
  

  
  
  
  <script src="/lib/pangu/dist/pangu.min.js?v=3.3"></script>
  <script type="text/javascript">pangu.spacingPage();</script>


  
  <script type="text/javascript" src="/js/src/js.cookie.js?v=6.4.0"></script>
  <script type="text/javascript" src="/js/src/scroll-cookie.js?v=6.4.0"></script>


  

  

  
  <style>
    .copy-btn {
      display: inline-block;
      padding: 6px 12px;
      font-size: 13px;
      font-weight: 700;
      line-height: 20px;
      color: #333;
      white-space: nowrap;
      vertical-align: middle;
      cursor: pointer;
      background-color: #eee;
      background-image: linear-gradient(#fcfcfc, #eee);
      border: 1px solid #d5d5d5;
      border-radius: 3px;
      user-select: none;
      outline: 0;
    }

    .highlight-wrap .copy-btn {
      transition: opacity .3s ease-in-out;
      opacity: 0;
      padding: 2px 6px;
      position: absolute;
      right: 4px;
      top: 8px;
    }

    .highlight-wrap:hover .copy-btn,
    .highlight-wrap .copy-btn:focus {
      opacity: 1
    }

    .highlight-wrap {
      position: relative;
    }
  </style>
  <script>
    $('.highlight').each(function (i, e) {
      var $wrap = $('<div>').addClass('highlight-wrap')
      $(e).after($wrap)
      $wrap.append($('<button>').addClass('copy-btn').append('复制').on('click', function (e) {
        var code = $(this).parent().find('.code').find('.line').map(function (i, e) {
          return $(e).text()
        }).toArray().join('\n')
        var ta = document.createElement('textarea')
        document.body.appendChild(ta)
        ta.style.position = 'absolute'
        ta.style.top = '0px'
        ta.style.left = '0px'
        ta.value = code
        ta.select()
        ta.focus()
        var result = document.execCommand('copy')
        document.body.removeChild(ta)
        
        $(this).blur()
      })).on('mouseleave', function (e) {
        var $b = $(this).find('.copy-btn')
        setTimeout(function () {
          $b.text('复制')
        }, 300)
      }).append(e)
    })
  </script>


</body>
</html>
