<!DOCTYPE html>






  


<html class="theme-next mist use-motion" lang="zh-CN">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=2"/>
<meta name="theme-color" content="#222">






  
  
    
    
  <script src="/lib/pace/pace.min.js?v=1.0.2"></script>
  <link href="/lib/pace/pace-theme-minimal.min.css?v=1.0.2" rel="stylesheet">




  
  
  <link rel="stylesheet" media="all" href="/lib/Han/dist/han.min.css?v=3.3">




<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />






















<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=6.2.0" rel="stylesheet" type="text/css" />


  <link rel="apple-touch-icon" sizes="180x180" href="/images/favicon.png?v=6.2.0">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon.png?v=6.2.0">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon.png?v=6.2.0">


  <link rel="mask-icon" href="/images/logo.svg?v=6.2.0" color="#222">









<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    version: '6.2.0',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":false,"onmobile":false},
    fancybox: false,
    fastclick: false,
    lazyload: false,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>


  




  <meta name="description" content="记录一下我阅读《结网》的读书笔记。 整本书组织结构其实比较零散，所以我也就按照零散的方式组织记录。基本我将自己觉得有意思的案例和内容都整理了一下，摘录内容重点集中于产品经理职位本身的技能知识，操作方法论上。而书中关于团队管理，团队合作，向上/向下管理的内容，因为说的并不很深入，我就没多摘录。总的说来，这本书从头到尾读一遍会对产品经理的工作方法论有个更加清晰的认识。">
<meta name="keywords" content="读书笔记,产品">
<meta property="og:type" content="article">
<meta property="og:title" content="《结网 @改变世界的互联网产品经理》 - 读书笔记">
<meta property="og:url" content="http://whiledoing.me/2018/04/19/note/making-net-pm-note/index.html">
<meta property="og:site_name" content="whiledoing">
<meta property="og:description" content="记录一下我阅读《结网》的读书笔记。 整本书组织结构其实比较零散，所以我也就按照零散的方式组织记录。基本我将自己觉得有意思的案例和内容都整理了一下，摘录内容重点集中于产品经理职位本身的技能知识，操作方法论上。而书中关于团队管理，团队合作，向上/向下管理的内容，因为说的并不很深入，我就没多摘录。总的说来，这本书从头到尾读一遍会对产品经理的工作方法论有个更加清晰的认识。">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2018-04-21T06:24:26.215Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="《结网 @改变世界的互联网产品经理》 - 读书笔记">
<meta name="twitter:description" content="记录一下我阅读《结网》的读书笔记。 整本书组织结构其实比较零散，所以我也就按照零散的方式组织记录。基本我将自己觉得有意思的案例和内容都整理了一下，摘录内容重点集中于产品经理职位本身的技能知识，操作方法论上。而书中关于团队管理，团队合作，向上/向下管理的内容，因为说的并不很深入，我就没多摘录。总的说来，这本书从头到尾读一遍会对产品经理的工作方法论有个更加清晰的认识。">






  <link rel="canonical" href="http://whiledoing.me/2018/04/19/note/making-net-pm-note/"/>



<script type="text/javascript" id="page.configurations">
  CONFIG.page = {
    sidebar: "",
  };
</script>

  <title>《结网 @改变世界的互联网产品经理》 - 读书笔记 | whiledoing</title>
  




<script async src="https://www.googletagmanager.com/gtag/js?id=UA-117714040-1"></script>
<script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'UA-117714040-1');
</script>



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "https://hm.baidu.com/hm.js?6de2920425778ca5a4ee717be5055e96";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>




  <noscript>
  <style type="text/css">
    .use-motion .motion-element,
    .use-motion .brand,
    .use-motion .menu-item,
    .sidebar-inner,
    .use-motion .post-block,
    .use-motion .pagination,
    .use-motion .comments,
    .use-motion .post-header,
    .use-motion .post-body,
    .use-motion .collection-title { opacity: initial; }

    .use-motion .logo,
    .use-motion .site-title,
    .use-motion .site-subtitle {
      opacity: initial;
      top: initial;
    }

    .use-motion {
      .logo-line-before i { left: initial; }
      .logo-line-after i { right: initial; }
    }
  </style>
</noscript>

</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-CN">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">whiledoing</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">喜欢一切简单且美的事物，包括人。</p>
      
  </div>

  <div class="site-nav-toggle">
    <button aria-label="切换导航栏">
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>




<nav class="site-nav">
  
    <ul id="menu" class="menu">
      
        
        
        
          
          <li class="menu-item menu-item-home">
    <a href="/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-home"></i> <br />首页</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-tags">
    <a href="/tags/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />标签</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-archives">
    <a href="/archives/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />归档</a>
  </li>

      
      
    </ul>
  

  
    

  

  
</nav>



  



</div>
    </header>

    


    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  
    <div class="reading-progress-bar"></div>
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://whiledoing.me/2018/04/19/note/making-net-pm-note/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="whiledoing">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/images/avatar.jpeg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="whiledoing">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">《结网 @改变世界的互联网产品经理》 - 读书笔记
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">

            
            
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              

              
                
              

              <time title="创建时间：2018-04-19 17:19:45" itemprop="dateCreated datePublished" datetime="2018-04-19T17:19:45+08:00">2018-04-19</time>
            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body han-init-context" itemprop="articleBody">

      
      

      
        <p>&#x8BB0;&#x5F55;&#x4E00;&#x4E0B;&#x6211;&#x9605;&#x8BFB;<a href="https://book.douban.com/subject/24305938/" target="_blank" rel="noopener">&#x300A;&#x7ED3;&#x7F51;&#x300B;</a>&#x7684;&#x8BFB;&#x4E66;&#x7B14;&#x8BB0;&#x3002;</p>
<p>&#x6574;&#x672C;&#x4E66;&#x7EC4;&#x7EC7;&#x7ED3;&#x6784;&#x5176;&#x5B9E;&#x6BD4;&#x8F83;&#x96F6;&#x6563;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4E5F;&#x5C31;&#x6309;&#x7167;&#x96F6;&#x6563;&#x7684;&#x65B9;&#x5F0F;&#x7EC4;&#x7EC7;&#x8BB0;&#x5F55;&#x3002;&#x57FA;&#x672C;&#x6211;&#x5C06;&#x81EA;&#x5DF1;&#x89C9;&#x5F97;&#x6709;&#x610F;&#x601D;&#x7684;&#x6848;&#x4F8B;&#x548C;&#x5185;&#x5BB9;&#x90FD;&#x6574;&#x7406;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x6458;&#x5F55;&#x5185;&#x5BB9;&#x91CD;&#x70B9;&#x96C6;&#x4E2D;&#x4E8E;<strong>&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x804C;&#x4F4D;&#x672C;&#x8EAB;&#x7684;&#x6280;&#x80FD;&#x77E5;&#x8BC6;&#xFF0C;&#x64CD;&#x4F5C;&#x65B9;&#x6CD5;&#x8BBA;&#x4E0A;</strong>&#x3002;&#x800C;&#x4E66;&#x4E2D;&#x5173;&#x4E8E;&#x56E2;&#x961F;&#x7BA1;&#x7406;&#xFF0C;&#x56E2;&#x961F;&#x5408;&#x4F5C;&#xFF0C;&#x5411;&#x4E0A;/&#x5411;&#x4E0B;&#x7BA1;&#x7406;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x56E0;&#x4E3A;&#x8BF4;&#x7684;&#x5E76;&#x4E0D;&#x5F88;&#x6DF1;&#x5165;&#xFF0C;&#x6211;&#x5C31;&#x6CA1;&#x591A;&#x6458;&#x5F55;&#x3002;&#x603B;&#x7684;&#x8BF4;&#x6765;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x4ECE;&#x5934;&#x5230;&#x5C3E;&#x8BFB;&#x4E00;&#x904D;&#x4F1A;&#x5BF9;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x6CD5;&#x8BBA;&#x6709;&#x4E2A;&#x66F4;&#x52A0;&#x6E05;&#x6670;&#x7684;&#x8BA4;&#x8BC6;&#x3002;</p>
<a id="more"></a>
<blockquote>
<p>p17 &#x4E2A;&#x4EBA;&#x80FD;&#x529B;&#x65B9;&#x9762;&#xFF0C;<strong>&#x89C2;&#x5BDF;&#x80FD;&#x529B;&#x548C;&#x63A8;&#x7406;&#x80FD;&#x529B;</strong>&#x5BF9;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;</p>
</blockquote>
<p>&#x7075;&#x611F;&#x6765;&#x6E90;&#x4E8E;&#x89C2;&#x5BDF;&#xFF0C;&#x800C;&#x63A8;&#x7406;&#x5C06;&#x7075;&#x611F;&#x53D8;&#x4E3A;&#x6A21;&#x5F0F;&#x3002;&#x4FDD;&#x6301;&#x597D;&#x5947;&#x5FC3;&#xFF0C;&#x5173;&#x6CE8;&#x7EC6;&#x8282;&#x3002;</p>
<blockquote>
<p>p24 &#x4EA7;&#x54C1;&#x7684;&#x521B;&#x4F5C;&#x7EF4;&#x5EA6;&#xFF1A;&#x6982;&#x5FF5;=&#x300B;&#x5F62;&#x5F0F;=&#x300B;&#x98CE;&#x683C;=&#x300B;&#x7ED3;&#x6784;=&#x300B;&#x5DE5;&#x827A;=&#x300B;&#x5916;&#x89C2;</p>
</blockquote>
<p>&#x6982;&#x5FF5;&#x5148;&#x884C;&#xFF0C;&#x641E;&#x6E05;&#x695A;&#x4EA7;&#x54C1;&#x53EF;&#x4EE5;&#x521B;&#x9020;&#x4EC0;&#x4E48;&#x4EF7;&#x503C;&#xFF0C;&#x6EE1;&#x8DB3;&#x4E86;&#x54EA;&#x4E9B;&#x7528;&#x6237;&#x7684;&#x90A3;&#x4E9B;&#x9700;&#x6C42;&#x3002;&#x5F62;&#x5F0F;&#x5BF9;&#x5E94;&#x4E8E;&#x5177;&#x4F53;&#x4EA7;&#x54C1;&#x7684;&#x5F62;&#x6001;&#x3002;&#x98CE;&#x683C;&#x5BF9;&#x5E94;&#x5B9A;&#x4F4D;&#x3002;&#x7ED3;&#x6784;&#x5BF9;&#x5E94;&#x4EA7;&#x54C1;&#x529F;&#x80FD;&#x7ED3;&#x6784;&#x3002;&#x5DE5;&#x827A;&#x5BF9;&#x5E94;&#x4E8E;&#x5DE5;&#x7A0B;&#x5B9E;&#x73B0;&#xFF0C;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x3002;&#x5916;&#x89C2;&#x5BF9;&#x5E94;&#x4E8E;GUI/UI&#x3002;</p>
<blockquote>
<p>p33 web2.0&#x7684;&#x6982;&#x5FF5;&#xFF1A;1&#xFF09;&#x670D;&#x52A1;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6253;&#x5305;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x6280;&#x672F;&#x67B6;&#x6784;&#x5177;&#x6709;&#x9AD8;&#x6210;&#x672C;&#x6548;&#x76CA;&#x7684;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x3002;2&#xFF09;&#x63A7;&#x5236;&#x72EC;&#x7279;&#x7684;&#x3001;&#x96BE;&#x4EE5;&#x518D;&#x9020;&#x7684;&#x6570;&#x636E;&#x6E90;&#xFF0C;&#x5E76;&#x4E14;&#x7528;&#x6237;&#x8D8A;&#x591A;&#x5185;&#x5BB9;&#x8D8A;&#x4E30;&#x5BCC;&#x3002;3&#xFF09;&#x628A;&#x7528;&#x6237;&#x4F5C;&#x4E3A;&#x5171;&#x540C;&#x5F00;&#x53D1;&#x8005;&#x6765;&#x4FE1;&#x4EFB;&#x3002;4&#xFF09;&#x501F;&#x529B;&#x4E8E;&#x96C6;&#x4F53;&#x667A;&#x6167;&#x3002;5&#xFF09;&#x901A;&#x8FC7;&#x7528;&#x6237;&#x7684;&#x81EA;&#x52A9;&#x670D;&#x52A1;&#x6765;&#x53D1;&#x6325;&#x957F;&#x5C3E;&#x7684;&#x529B;&#x91CF;&#x3002;6&#xFF09;&#x8D85;&#x8D8A;&#x5355;&#x4E00;&#x8BBE;&#x5907;&#x5C42;&#x6B21;&#x7684;&#x8F6F;&#x4EF6;&#x3002;</p>
</blockquote>
<p>&#x53EF;&#x4EE5;&#x5F52;&#x7EB3;&#x4E3A;&#x4E24;&#x4E2A;&#x7EF4;&#x5EA6;&#xFF1A;<strong>&#x300E;&#x5DEE;&#x5F02;&#x5316;&#x300F;&#x548C;&#x300E;&#x4F4E;&#x6210;&#x672C;&#x300F;&#x3002;</strong></p>
<blockquote>
<p>p34 &#x84DD;&#x6D77;&#x6218;&#x7565;&#x6210;&#x529F;&#x4E0E;&#x5426;&#xFF0C;&#x53D6;&#x51B3;&#x4E8E;&#x4E00;&#x6B3E;&#x4EA7;&#x54C1;&#x80FD;&#x4E0D;&#x80FD;&#x5728;&#x5B83;&#x7684;&#x84DD;&#x6D77;&#x65F6;&#x6BB5;&#x5185;&#x8FBE;&#x5230;&#x7406;&#x60F3;&#x7684;&#x7528;&#x6237;&#x89C4;&#x6A21;&#x6216;&#x7B51;&#x8D77;&#x8DB3;&#x591F;&#x9AD8;&#x7684;&#x58C1;&#x5792;&#x3002;</p>
</blockquote>
<p>&#x7A81;&#x7834;&#x53E3;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x8BA9;&#x7528;&#x6237;&#x89C9;&#x5F97;&#x4EA7;&#x54C1;&#x6709;&#x7528;&#xFF0C;&#x58C1;&#x5792;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x8BA9;&#x8FD9;&#x79CD;&#x6709;&#x7528;&#x53D8;&#x5F97;&#x96BE;&#x4EE5;&#x590D;&#x5236;&#x3002;</p>
<blockquote>
<p>p44 &#x4ECE;&#x300E;&#x6700;&#x5C0F;&#x5316;&#x53EF;&#x884C;&#x4EA7;&#x54C1;&#x300F;&#x5F00;&#x59CB;&#x9A8C;&#x8BC1;&#x6982;&#x5FF5;&#x3002;</p>
</blockquote>
<p>&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x4E2D;&#x7684;&#x66F3;&#x5149;&#x5F39;&#xFF0C;&#x7528;&#x80FD;&#x53CD;&#x5E94;&#x6982;&#x5FF5;&#x7684;&#x539F;&#x578B;&#x4EA7;&#x54C1;&#x9A8C;&#x8BC1;&#x53EF;&#x884C;&#x5EA6;&#x3002;</p>
<blockquote>
<p>p47 &#x5982;&#x679C;&#x4E00;&#x53E5;&#x8BDD;&#x8BB2;&#x4E0D;&#x6E05;&#x695A;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#x6240;&#x80FD;&#x5E26;&#x6765;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x5C31;&#x6709;&#x5927;&#x95EE;&#x9898;&#x3002;&#x7528;&#x6237;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x8010;&#x5FC3;&#x53BB;&#x7406;&#x89E3;&#x4F60;&#x7684;&#x6982;&#x5FF5;&#x3002;</p>
</blockquote>
<p>&#x60F3;&#x60F3;&#x6240;&#x6709;&#x7F51;&#x7AD9;logo&#x65C1;&#x8FB9;&#x7B80;&#x77ED;&#x7684;&#x4E00;&#x53E5;&#x8BF4;&#x660E;&#xFF0C;&#x8FD8;&#x662F;&#x6709;&#x5176;&#x9053;&#x7406;&#x7684;&#x3002;&#x5B9A;&#x4F4D;&#x8981;&#x7B80;&#x5355;&#x660E;&#x4E86;&#x3002;</p>
<blockquote>
<p>p53 &#x5982;&#x679C;&#x4F60;&#x4E3A;&#x7269;&#x54C1;&#x548C;&#x6709;&#x5F62;&#x7684;&#x4E1C;&#x897F;&#x6536;&#x8D39;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x6240;&#x4ECE;&#x4E8B;&#x7684;&#x5C31;&#x662F;&#x5546;&#x54C1;&#x4E1A;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4E3A;&#x81EA;&#x5DF1;&#x5F00;&#x5C55;&#x7684;&#x6D3B;&#x52A8;&#x6536;&#x8D39;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x4ECE;&#x4E8B;&#x7684;&#x5C31;&#x662F;&#x670D;&#x52A1;&#x4E1A;&#x3002;&#x53EA;&#x6709;&#x5F53;&#x4F60;&#x4E3A;&#x6D88;&#x8D39;&#x8005;&#x548C;&#x4F60;&#x4E00;&#x8D77;&#x7684;&#x65F6;&#x95F4;&#x6536;&#x8D39;&#x65F6;&#xFF0C;&#x4F60;&#x624D;&#x7B97;&#x8FDB;&#x5165;&#x4E86;&#x4F53;&#x9A8C;&#x4E1A;&#x3002;</p>
</blockquote>
<p>&#x6E38;&#x620F;&#x5C31;&#x662F;&#x4F53;&#x9A8C;&#x4E1A;&#xFF0C;&#x4F60;&#x5F88;&#x96BE;&#x63CF;&#x8FF0;&#x6E38;&#x620F;&#x4EA7;&#x54C1;&#x53EF;&#x4EE5;&#x7ED9;&#x4F60;&#x5E26;&#x6765;&#x600E;&#x4E48;&#x6837;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x66F4;&#x591A;&#x5C31;&#x662F;&#x5728;&#x6E38;&#x620F;&#x4E2D;&#x83B7;&#x5F97;&#x723D;&#x7684;&#x4F53;&#x9A8C;&#x3002;&#x6362;&#x4E2A;&#x6211;&#x4E2A;&#x4EBA;&#x7684;&#x7406;&#x89E3;&#x65B9;&#x5F0F;&#x2014;&#x2014;<strong>&#x5236;&#x9020;&#x4E1A;&#x6EE1;&#x8DB3;&#x4EBA;&#x7684;&#x7269;&#x8D28;&#x9700;&#x6C42;&#xFF1B;&#x670D;&#x52A1;&#x4E1A;&#x6EE1;&#x8DB3;&#x4EBA;&#x61D2;&#x60F0;&#x7684;&#x9700;&#x6C42;&#xFF1B;&#x4F53;&#x9A8C;&#x4E1A;&#x6EE1;&#x8DB3;&#x4EBA;&#x6027;&#x7684;&#x9700;&#x6C42;&#xFF08;&#x4E03;&#x5B97;&#x7F6A;&#xFF09;</strong></p>
<blockquote>
<p>p60 &#x4E00;&#x6B3E;&#x4EA7;&#x54C1;&#x7684;&#x7528;&#x6237;&#x89C4;&#x6A21;&#x662F;&#x5426;&#x4F1A;&#x53D8;&#x5F97;&#x5F88;&#x5927;&#xFF0C;&#x8981;&#x770B;&#x8FD9;&#x6B3E;&#x4EA7;&#x54C1;&#x6709;&#x6CA1;&#x6709;&#x6EE1;&#x8DB3;&#x7528;&#x6237;&#x7684;**&#x300E;&#x5F3A;&#x9700;&#x6C42;&#x300F;&#x548C;&#x300E;&#x9891;&#x53D1;&#x9700;&#x6C42;&#x300F;**&#x3002;</p>
</blockquote>
<p><a href="http://wiki.mbalib.com/wiki/%E9%A9%AC%E6%96%AF%E6%B4%9B%E4%BA%BA%E7%B1%BB%E9%9C%80%E6%B1%82%E4%BA%94%E5%B1%82%E6%AC%A1%E7%90%86%E8%AE%BA" target="_blank" rel="noopener">&#x9A6C;&#x65AF;&#x6D1B;&#x7684;&#x9700;&#x6C42;&#x7406;&#x8BBA;</a>&#xFF1A;&#x751F;&#x7406;&#x9700;&#x6C42;=&#x300B;&#x5B89;&#x5168;&#x9700;&#x6C42;=&#x300B;&#x793E;&#x4F1A;&#x9700;&#x6C42;&#xFF08;&#x7231;&#x60C5;&#xFF0C;&#x53CB;&#x60C5;&#xFF09;=&#x300B;&#x5C0A;&#x91CD;&#x9700;&#x6C42;&#xFF08;&#x5730;&#x4F4D;&#xFF09;=&#x300B;&#x81EA;&#x6211;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x300E;&#x5F3A;&#x9700;&#x6C42;&#x300F;&#x5C31;&#x662F;&#x5176;&#x4E2D;&#x9760;&#x524D;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x4EBA;&#x7C7B;&#x751F;&#x5B58;&#x6240;&#x4F9D;&#x8D56;&#x7684;&#x9700;&#x6C42;&#x3002;</p>
<blockquote>
<p>p67 &#xFF08;&#x4E2A;&#x4EBA;&#x6574;&#x7406;&#xFF09;&#x4E66;&#x4E2D;&#x63D0;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x5F88;&#x6709;&#x610F;&#x601D;&#x7684;&#x6848;&#x4F8B;&#xFF1A;&#x300A;&#x5DE8;&#x4EBA;&#x300B;&#x4E3A;&#x4E86;&#x5438;&#x5F15;&#x5973;&#x6027;&#x73A9;&#x5BB6;&#x73A9;&#x6E38;&#x620F;&#xFF0C;&#x63A8;&#x5E7F;&#x4E86;&#x4E00;&#x79CD;&#x7EBF;&#x4E0B;&#x8BA4;&#x8BC1;&#xFF0C;&#x7EBF;&#x4E0A;&#x6536;&#x76CA;&#x7684;&#x6E38;&#x620F;&#x6A21;&#x5F0F;&#x3002;&#x53EA;&#x8981;&#x5973;&#x5B69;&#x5B50;&#x957F;&#x7684;&#x8FD8;&#x53EF;&#x4EE5;&#xFF0C;&#x901A;&#x8FC7;&#x7F51;&#x5427;&#x7684;&#x7EBF;&#x4E0B;&#x8BA4;&#x8BC1;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x6E38;&#x620F;&#x4E2D;&#x5F97;&#x5230;&#x7279;&#x6743;&#x5F85;&#x9047;&#xFF0C;&#x751A;&#x81F3;&#x5728;&#x7EBF;&#x65F6;&#x957F;&#x8D85;&#x8FC7;&#x4E00;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x8FD8;&#x53EF;&#x4EE5;&#x9886;&#x53D6;&#x73B0;&#x91D1;&#x5956;&#x52B1;&#x3002;&#x6309;&#x7406;&#x8BF4;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x5438;&#x5F15;&#x4EBA;&#x7684;&#x65B9;&#x6848;&#xFF0C;&#x53EF;&#x6CA1;&#x60F3;&#x5230;&#x4E8B;&#x60C5;&#x6309;&#x7167;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x5267;&#x672C;&#x53D1;&#x5C55;&#x3002;&#x56E0;&#x4E3A;&#x6709;&#x5229;&#x76CA;&#xFF0C;&#x5C31;&#x6709;&#x4EBA;&#x60E6;&#x8BB0;&#x3002;&#x7537;&#x73A9;&#x5BB6;&#x5F00;&#x59CB;&#x9020;&#x5047;&#xFF0C;&#x6DD8;&#x5B9D;&#x4E0A;&#x5F00;&#x59CB;&#x8D29;&#x5356;&#x5973;&#x6027;&#x73A9;&#x5BB6;&#x8D26;&#x53F7;&#xFF0C;&#x7ED3;&#x679C;&#x662F;&#x5927;&#x591A;&#x6570;&#x5973;&#x6027;&#x89D2;&#x8272;&#x80CC;&#x540E;&#x662F;&#x7537;&#x6027;&#x5728;&#x64CD;&#x4F5C;&#x3002;</p>
</blockquote>
<p>&#x5F88;&#x6709;&#x542F;&#x53D1;&#x6027;&#x3002;&#x8003;&#x8651;&#x95EE;&#x9898;&#x4E0D;&#x80FD;&#x53EA;&#x5C40;&#x9650;&#x4E8E;&#x5F53;&#x4E0B;&#x8BA4;&#x77E5;&#xFF0C;&#x800C;&#x662F;&#x8981;&#x8003;&#x8651;&#x957F;&#x8FDC;&#x7684;&#x52A8;&#x6001;&#x53D1;&#x5C55;&#x3002;&#x5728;&#x8003;&#x8651;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;<strong>&#x8981;&#x8B66;&#x60D5;&#x58A8;&#x83F2;&#x5B9A;&#x5F8B;&#xFF1A;&#x6709;&#x5229;&#x76CA;&#xFF0C;&#x5C31;&#x6709;&#x4EBA;&#x94BB;&#x7A7A;&#x5B50;&#xFF1B;&#x6709;&#x8F93;&#x5165;&#x6846;&#xFF0C;&#x5C31;&#x6709;&#x4EBA;&#x704C;&#x6C34;&#xFF1B;&#x51E1;&#x6709;&#x79EF;&#x5206;&#xFF0C;&#x5C31;&#x6709;&#x4EBA;&#x4F1A;&#x5237;&#x7B49;&#x7B49;</strong>&#x3002;&#x800C;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;<strong>&#x9700;&#x8981;&#x63D0;&#x524D;&#x8003;&#x8651;&#x2014;&#x2014;&#x5982;&#x679C;&#x51FA;&#x73B0;&#x58A8;&#x83F2;&#x5B9A;&#x5F8B;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#xFF1F;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x7684;&#x4EE3;&#x4EF7;&#x662F;&#x591A;&#x5C11;&#xFF1F;&#x5982;&#x679C;&#x4E0D;&#x80FD;&#x89E3;&#x51B3;&#xFF0C;&#x4EE3;&#x4EF7;&#x53C8;&#x662F;&#x591A;&#x5C11;&#xFF1F;&#x4E0D;&#x8981;&#x8BA9;&#x58A8;&#x83F2;&#x5B9A;&#x5F8B;&#x6F14;&#x53D8;&#x4E3A;&#x7CFB;&#x7EDF;&#x6027;&#x707E;&#x96BE;&#x3002;</strong></p>
<blockquote>
<p>p74 &#x7528;&#x6237;&#x7684;&#x5386;&#x53F2;&#x884C;&#x4E3A;&#x6BD4;&#x4ED6;&#x4EEC;&#x5F53;&#x524D;&#x7684;&#x610F;&#x613F;&#x66F4;&#x6709;&#x4EF7;&#x503C;&#x3002;</p>
</blockquote>
<p>&#x8BA9;&#x7528;&#x6237;&#x53BB;&#x4F7F;&#x7528;&#x4EA7;&#x54C1;&#x800C;&#x4E0D;&#x662F;&#x53EA;&#x662F;&#x60F3;&#x60F3;&#x5C31;&#x5F97;&#x51FA;&#x7684;&#x8BC4;&#x4EF7;&#x3002;&#x53EF;&#x7528;&#x6027;&#x6D4B;&#x8BD5;&#xFF1A;&#x5BFB;&#x627E;&#x6709;&#x4EE3;&#x8868;&#x6027;&#xFF0C;&#x7B26;&#x5408;&#x4EA7;&#x54C1;&#x6F5C;&#x5728;&#x7528;&#x6237;&#x6761;&#x4EF6;&#x7684;&#x7528;&#x6237;&#xFF0C;&#x6709;&#x9488;&#x5BF9;&#x6027;&#x7684;&#x64CD;&#x4F5C;&#x4EA7;&#x54C1;&#xFF0C;&#x7ED9;&#x51FA;&#x53CD;&#x9988;&#xFF0C;&#x5206;&#x6790;&#x64CD;&#x4F5C;&#x6570;&#x636E;&#x3002;</p>
<p><strong>&#x76F8;&#x4FE1;&#x6570;&#x636E;&#x800C;&#x4E0D;&#x662F;gut feeling</strong>&#xFF08;&#x5B66;machine learning&#x65F6;&#x4E5F;&#x770B;&#x5230;&#x8FC7;&#x7C7B;&#x4F3C;&#x7ED3;&#x8BBA;&#xFF0C;&#x4F60;&#x76F4;&#x89C9;&#x7684;&#x4F18;&#x5316;&#x65B9;&#x6848;&#x5E76;&#x4E0D;&#x53EF;&#x9760;&#xFF0C;cross validation matters!&#xFF09;</p>
<p>p77 &#x4E66;&#x4E2D;&#x4F8B;&#x5B50;&#xFF0C;Picasa&#x9996;&#x9875;&#x6539;&#x7248;&#x7684;A/B&#x6D4B;&#x8BD5;&#x3002;</p>
<blockquote>
<p>p80 &#x7F51;&#x7AD9;&#x7ED3;&#x6784;&#x56FE;&#xFF0C;&#x7F51;&#x9875;&#x7EBF;&#x6846;&#x56FE;&#xFF0C;&#x7F51;&#x9875;&#x63CF;&#x8FF0;&#x8868;&#x3002;</p>
</blockquote>
<p>PRD&#x6587;&#x6863;&#x7684;&#x51E0;&#x4E2A;&#x4E3B;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF1A;</p>
<ul>
<li>&#x7F51;&#x9875;&#x7ED3;&#x6784;&#x56FE;&#x3002;&#x63CF;&#x8FF0;&#x7F51;&#x9875;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x529F;&#x80FD;&#xFF0C;&#x786E;&#x5B9A;&#x6A21;&#x5757;&#x5212;&#x5206;&#x548C;&#x7F51;&#x9875;&#x4E2A;&#x6570;&#x3002;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x529F;&#x80FD;&#x6A21;&#x5757;&#x5212;&#x5206;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x7528;&#x6237;&#x89D2;&#x8272;&#x5212;&#x5206;&#x3002;<a href="/2018/04/12/note/pyramid-thinking-note/">MECE&#x539F;&#x5219;</a>&#x3002;</li>
<li>&#x7F51;&#x9875;&#x7EBF;&#x6846;&#x56FE;&#x3002;&#x57FA;&#x672C;&#x7684;&#x4EA4;&#x4E92;&#xFF0C;&#x9875;&#x9762;&#x5143;&#x7D20;&#xFF0C;&#x5E03;&#x5C40;&#x7684;&#x63CF;&#x8FF0;&#x56FE;&#x3002;</li>
<li>&#x7F51;&#x9875;&#x63CF;&#x8FF0;&#x8868;&#x3002;&#x6570;&#x636E;&#x9879;&#x7684;&#x63CF;&#x8FF0;&#x3002;</li>
</ul>
<p>&#x6587;&#x6863;&#x7684;&#x4EFB;&#x52A1;&#x662F;&#x8BA9;&#x56E2;&#x961F;&#x660E;&#x786E;&#x4EFB;&#x52A1;&#xFF0C;&#x5907;&#x5FD8;&#x4EFB;&#x52A1;&#xFF0C;&#x800C;&#x4E0D;&#x53EA;&#x662F;&#x4E3A;&#x4E86;&#x597D;&#x770B;&#x3002;&#x8FD8;&#x6709;&#xFF0C;<strong>&#x6C9F;&#x901A;&#x6BD4;&#x6587;&#x6863;&#x91CD;&#x8981;</strong>&#x3002;</p>
<blockquote>
<p>p92 &#x7528;&#x6237;&#x4F53;&#x9A8C;&#x4E09;&#x8981;&#x7D20;&#xFF1A;<strong>&#x522B;&#x4EBA;&#x6211;&#x7B49;&#xFF01;&#x522B;&#x8BA9;&#x6211;&#x60F3;&#xFF01;&#x522B;&#x8BA9;&#x6211;&#x70E6;&#xFF01;</strong></p>
</blockquote>
<ul>
<li>&#x7528;&#x6237;&#x7684;&#x8010;&#x5FC3;&#x662F;&#x6709;&#x9650;&#x7684;&#xFF0C;&#x4E0D;&#x8981;&#x8BA9;&#x7528;&#x6237;&#x7B49;&#xFF0C;&#x7B49;&#x4E5F;&#x9700;&#x8981;&#x6709;&#x53CD;&#x9988;&#x63D0;&#x793A;&#xFF08;&#x8FDB;&#x5EA6;&#x6761;&#x7B49;&#xFF09;&#x3002;</li>
<li>&#x7528;&#x6237;&#x7684;&#x8010;&#x5FC3;&#x662F;&#x6709;&#x9650;&#x7684;&#xFF0C;&#x4E0D;&#x8981;&#x8BA9;&#x7528;&#x6237;&#x60F3;&#xFF0C;&#x4E00;&#x53E5;&#x8BDD;&#x5C31;&#x8981;&#x8BF4;&#x6E05;&#x695A;&#x4EA7;&#x54C1;&#x7684;&#x6838;&#x5FC3;&#x5B9A;&#x4F4D;&#xFF0C;&#x80FD;&#x81EA;&#x52A8;&#x7684;&#x5C31;&#x4E0D;&#x8981;&#x8BA9;&#x7528;&#x6237;&#x624B;&#x52A8;&#x64CD;&#x4F5C;&#xFF0C;&#x5C3D;&#x91CF;&#x964D;&#x4F4E;&#x7528;&#x6237;&#x7684;&#x5B66;&#x4E60;&#x548C;&#x4F7F;&#x7528;&#x6210;&#x672C;&#x3002;&#x4E66;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x6848;&#x4F8B;&#xFF1A;&#x50BB;&#x74DC;&#x5316;&#x7684;&#x4E00;&#x952E;ghost&#xFF1B;chrome&#x7684;&#x6E10;&#x8FDB;&#x663E;&#x793A;&#xFF08;progressive disclosure&#xFF09;&#xFF0C;&#x53EA;&#x663E;&#x793A;&#x5F53;&#x524D;&#x7528;&#x6237;&#x4EFB;&#x52A1;&#x76F8;&#x5173;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x9690;&#x85CF;&#x5176;&#x5B83;&#x529F;&#x80FD;&#xFF1B;&#x74F6;&#x76D6;&#x4E0A;&#x7684;&#x6761;&#x7EB9;&#x63D0;&#x793A;&#x63A8;&#x5E7F;&#x5230;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x7F29;&#x653E;&#x63D0;&#x793A;&#x56FE;&#x6807;&#xFF08;&#x89C6;&#x89C9;hint&#xFF0C;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x6620;&#x5C04;&#xFF09;&#x3002;</li>
<li>&#x7528;&#x6237;&#x7684;&#x8010;&#x5FC3;&#x662F;&#x6709;&#x9650;&#x7684;&#xFF0C;&#x4E0D;&#x8981;&#x8BA9;&#x7528;&#x6237;&#x70E6;&#xFF0C;&#x7F29;&#x77ED;&#x8DEF;&#x5F84;&#x5E2E;&#x7528;&#x6237;&#x5077;&#x61D2;&#x3002;&#x4E66;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x6848;&#x4F8B;&#xFF1A;&#x7406;&#x89E3;&#x7528;&#x6237;&#x7684;&#x9ED8;&#x8BA4;&#x8BED;&#x4E49;&#xFF1B;&#x80FD;&#x4E0D;&#x7528;&#x6CE8;&#x518C;&#x7684;&#x5C31;&#x4E0D;&#x6CE8;&#x518C;&#xFF08;&#x7ED9;&#x51FA;&#x540E;&#x7EED;&#x63D0;&#x793A;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5F3A;&#x5236;&#x6CE8;&#x518C;&#xFF0C;&#x6CE8;&#x518C;&#x662F;&#x7528;&#x6237;&#x6D41;&#x5931;&#x7387;&#x5F88;&#x5927;&#x7684;&#x73AF;&#x8282;&#xFF09;&#xFF1B;gmail&#x4E0D;&#x63D0;&#x793A;&#x662F;&#x5426;&#x786E;&#x8BA4;&#x5220;&#x9664;&#x90AE;&#x4EF6;&#xFF0C;&#x800C;&#x662F;&#x6539;&#x6210;&#x7B80;&#x5355;&#x7684;&#x6587;&#x672C;&#x63D0;&#x793A;&#xFF0C;&#x7528;&#x6237;&#x5728;&#x4E0D;&#x88AB;&#x6253;&#x65AD;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4E5F;&#x53EF;&#x4EE5;&#x64A4;&#x9500;&#x5220;&#x9664;&#xFF08;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x7406;&#x89E3;&#x7528;&#x6237;&#x7684;&#x9ED8;&#x8BA4;&#x8BED;&#x4E49;&#xFF09;&#xFF1B;&#x7528;&#x6237;&#x51FA;&#x9519;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x70E6;&#x8E81;&#xFF0C;&#x5C3D;&#x53EF;&#x80FD;&#x964D;&#x4F4E;&#x7528;&#x6237;&#x51FA;&#x9519;&#x7684;&#x6982;&#x7387;&#x3002;</li>
</ul>
<blockquote>
<p>p132 &#x8BA9;&#x6240;&#x6709;&#x4EBA;&#x4E0A;&#x8239;&#x2014;&#x2014;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x548C;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x7C7B;&#x4F3C;&#xFF0C;&#x5F00;&#x5C55;&#x5DE5;&#x4F5C;&#x90FD;&#x8981;&#x9760;&#x65E0;&#x6388;&#x6743;&#x9886;&#x5BFC;&#x529B;&#xFF0C;&#x6CA1;&#x6709;&#x5927;&#x68D2;&#x53EF;&#x7528;&#xFF0C;&#x80FD;&#x7528;&#x7684;&#x53EA;&#x6709;&#x80E1;&#x841D;&#x535C;&#x3002;&#x4F60;&#x8981;&#x7528;&#x80E1;&#x841D;&#x535C;&#x5E26;&#x9886;&#x5927;&#x5BB6;&#x4E0A;&#x8239;&#xFF0C;&#x544A;&#x8BC9;&#x4ED6;&#x4EEC;&#x8239;&#x4E0A;&#x6216;&#x8005;&#x5F7C;&#x5CB8;&#x6709;&#x4ED6;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6709;&#x4EBA;&#x53EF;&#x80FD;&#x60F3;&#x8981;&#x6F02;&#x4EAE;&#x7684;&#x5C65;&#x5386;&#xFF0C;&#x6709;&#x4EBA;&#x53EF;&#x80FD;&#x60F3;&#x8981;&#x63D0;&#x5347;&#x81EA;&#x5DF1;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x6709;&#x7406;&#x60F3;&#x7684;&#x4EBA;&#x53EF;&#x80FD;&#x60F3;&#x8BA9;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x53D8;&#x5F97;&#x66F4;&#x7F8E;&#x597D;&#x3002;&#x603B;&#x4E4B;&#xFF0C;&#x6295;&#x5176;&#x6240;&#x597D;&#x3002;</p>
</blockquote>
<p>&#x6709;&#x610F;&#x601D;&#x7684;&#x6BD4;&#x55BB;&#x3002;</p>
<blockquote>
<p>p164 &#x5F62;&#x5BB9;&#x81EA;&#x5DF1;&#x7684;&#x4EA7;&#x54C1;&#x6BD4;&#x7ADE;&#x4E89;&#x5BF9;&#x624B;&#x7684;&#x597D;&#xFF0C;&#x4E0D;&#x5916;&#x4E4E;&#x4E00;&#x53E5;&#x53E4;&#x8BDD;&#xFF1A;<strong>&#x300E;&#x4EBA;&#x65E0;&#x6211;&#x6709;&#xFF0C;&#x4EBA;&#x6709;&#x6211;&#x4F18;&#x3002;&#x300F;</strong></p>
</blockquote>
<p>&#x5DEE;&#x5F02;&#x5316;&#x548C;&#x4F53;&#x9A8C;&#x5316;&#x3002;</p>
<blockquote>
<p>p222 &#xFF08;&#x4E2A;&#x4EBA;&#x6574;&#x7406;&#xFF09;&#x4E66;&#x4E2D;&#x63CF;&#x8FF0;&#x4E0B;&#x9762;&#x89C2;&#x70B9;&#x7684;&#x89D2;&#x5EA6;&#x662F;&#x62B5;&#x5236;&#x8BF1;&#x60D1;&#xFF0C;&#x8FC7;&#x6EE4;&#x4E0D;&#x9760;&#x8C31;&#x7684;&#x60F3;&#x6CD5;&#x3002;&#x6211;&#x5012;&#x662F;&#x89C9;&#x5F97;&#x8FD9;&#x51E0;&#x70B9;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x5730;&#x5E2E;&#x52A9;&#x8BBE;&#x8BA1;&#x4EBA;&#x5458;&#x7406;&#x6E05;&#x695A;&#x4EA7;&#x54C1;&#x7684;&#x67B6;&#x6784;&#xFF1A;</p>
<ol>
<li><strong>&#x54EA;&#x4E9B;&#x7528;&#x6237;</strong>&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EA7;&#x54C1;&#x6536;&#x76CA;&#xFF0C;&#x4ED6;&#x4EEC;&#x662F;&#x7537;&#x662F;&#x5973;&#xFF0C;&#x5E74;&#x9F84;&#x591A;&#x5927;&#xFF0C;&#x6709;&#x591A;&#x5C11;&#x4EBA;&#xFF1F;</li>
<li>&#x8FD9;&#x4E2A;&#x4EA7;&#x54C1;&#x6982;&#x5FF5;&#x4E3A;&#x5B83;&#x76EE;&#x6807;&#x7528;&#x6237;&#x5E26;&#x6765;<strong>&#x4EC0;&#x4E48;&#x4EF7;&#x503C;</strong>&#xFF1F;</li>
<li>&#x4EA7;&#x54C1;&#x5B9E;&#x73B0;&#x7684;&#x4EF7;&#x503C;&#x5982;&#x4F55;<strong>&#x4F20;&#x9012;&#x7ED9;&#x7528;&#x6237;</strong>&#xFF1F;&#x5982;&#x4F55;&#x62C9;&#x52A8;&#xFF1F;&#x5982;&#x4F55;&#x8F6C;&#x5316;&#x76EE;&#x6807;&#x7528;&#x6237;&#xFF1F;</li>
<li>&#x5982;&#x4F55;&#x5EFA;&#x7ACB;&#x548C;<strong>&#x7EF4;&#x62A4;</strong>&#x4EA7;&#x54C1;&#x4E0E;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x4E4B;&#x95F4;&#x7684;<strong>&#x5173;&#x7CFB;</strong>&#xFF1F;&#x80FD;&#x5426;&#x505A;&#x5230;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x7684;&#x4F53;&#x9A8C;&#xFF1F;</li>
<li>&#x80FD;&#x83B7;&#x5F97;<strong>&#x6536;&#x5165;</strong>&#x561B;&#xFF1F;&#x80FD;&#x5426;&#x6210;&#x4E3A;&#x73B0;&#x91D1;&#x725B;&#x7684;&#x4EA7;&#x54C1;&#xFF1F;</li>
<li>&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x4EA7;&#x54C1;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x6709;&#x54EA;&#x4E9B;&#x6838;&#x5FC3;<strong>&#x8D44;&#x6E90;</strong>&#x5DF2;&#x7ECF;&#x5177;&#x5907;&#xFF0C;&#x54EA;&#x4E9B;&#x6B20;&#x7F3A;&#xFF1F;</li>
<li>&#x9700;&#x8981;&#x5B8C;&#x6210;&#x54EA;&#x4E9B;<strong>&#x5173;&#x952E;&#x4EFB;&#x52A1;</strong>&#x624D;&#x80FD;&#x8FBE;&#x5230;&#x91CC;&#x7A0B;&#x7891;&#xFF1F;&#x7A81;&#x7834;&#x53E3;&#x5728;&#x54EA;&#x91CC;&#xFF1F;</li>
<li>&#x9700;&#x8981;&#x5916;&#x90E8;&#x7684;<strong>&#x5408;&#x4F5C;&#x4F19;&#x4F34;</strong>&#x5417;&#xFF1F;</li>
<li>&#x4E0A;&#x8FF0;&#x95EE;&#x9898;&#x5171;&#x6D89;&#x53CA;&#x54EA;&#x4E9B;<strong>&#x6210;&#x672C;</strong>&#xFF1F;</li>
</ol>
</blockquote>
<p>&#x4ED4;&#x7EC6;&#x634B;&#x4E00;&#x634B;&#x4E0A;&#x8FF0;&#x95EE;&#x9898;&#xFF0C;&#x5BF9;&#x4E8E;&#x4ECE;0&#x5F00;&#x59CB;&#x8BBE;&#x8BA1;&#x4EA7;&#x54C1;&#x7684;&#x4EA7;&#x54C1;&#x4EBA;&#x5458;&#xFF0C;&#x5E94;&#x8BE5;&#x8FD8;&#x6709;&#x88E8;&#x76CA;&#x3002;</p>

      
    </div>

    
      

  <div class="popular-posts-header">相关文章</div>
  <ul class="popular-posts">
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/02/03/the-art-of-stop-learn-note-md/" rel="bookmark">《止学》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/08/07/book-change-the-conversation-learn-note/" rel="bookmark">《解决冲突的关键技巧》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/03/24/book-liaoge-linux-course-md/" rel="bookmark">《鸟哥的Linux私房菜》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/06/28/book-thinking-about-running-md/" rel="bookmark">《当我跑步时我谈些什么》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/02/02/code-complete-2-learn-note/" rel="bookmark">《Code Complete 2》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/04/01/how-to-life-learn-note/" rel="bookmark">《活法》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/02/19/how-to-measure-your-life-reading-notes/" rel="bookmark">《如何衡量你的人生》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/11/30/money-hacker-reading-note/" rel="bookmark">《富爸爸穷爸爸》&《小狗钱钱》读书笔记</a></div>
      
    </li>
  
  </ul>


    

    
    
    

    

    

    
      <div>
        <ul class="post-copyright">
  <li class="post-copyright-author">
    <strong>本文作者： </strong>whiledoing</li>
  <li class="post-copyright-link">
    <strong>本文链接：</strong>
    <a href="http://whiledoing.me/2018/04/19/note/making-net-pm-note/" title="《结网 @改变世界的互联网产品经理》 - 读书笔记">http://whiledoing.me/2018/04/19/note/making-net-pm-note/</a>
  </li>
  <li class="post-copyright-license">
    <strong>版权声明： </strong>本博客所有文章除特别声明外，均采用 <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/" rel="external nofollow" target="_blank">CC BY-NC-SA 4.0</a> 许可协议。转载请注明出处！</li>
</ul>

      </div>
    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/读书笔记/" rel="tag"># 读书笔记</a>
          
            <a href="/tags/产品/" rel="tag"># 产品</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2018/04/18/note/how-to-win-friends-and-influence-people-note/" rel="next" title="《人性的弱点》之执行套路">
                <i class="fa fa-chevron-left"></i> 《人性的弱点》之执行套路
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2018/05/01/ml/coursera-dl-course-1-nn-and-dl/" rel="prev" title="Coursera - Andrew Ng - Deep Learning - 1 - Neural Network and Deep Learning - 学习记录">
                Coursera - Andrew Ng - Deep Learning - 1 - Neural Network and Deep Learning - 学习记录 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      

      <section class="site-overview-wrap sidebar-panel sidebar-panel-active">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <img class="site-author-image" itemprop="image"
                src="/images/avatar.jpeg"
                alt="whiledoing" />
            
              <p class="site-author-name" itemprop="name">whiledoing</p>
              <p class="site-description motion-element" itemprop="description">喜欢一切简单且美的事物，包括人。</p>
          </div>

          
            <nav class="site-state motion-element">
              
                <div class="site-state-item site-state-posts">
                
                  <a href="/archives/">
                
                    <span class="site-state-item-count">58</span>
                    <span class="site-state-item-name">日志</span>
                  </a>
                </div>
              

              

              
                
                
                <div class="site-state-item site-state-tags">
                  <a href="/tags/index.html">
                    
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                    <span class="site-state-item-count">31</span>
                    <span class="site-state-item-name">标签</span>
                  </a>
                </div>
              
            </nav>
          

          

          
            <div class="links-of-author motion-element">
              
                <span class="links-of-author-item">
                  <a href="https://github.com/whiledoing" target="_blank" title="GitHub">GitHub</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="http://www.douban.com/people/58249409" target="_blank" title="豆瓣">豆瓣</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="https://www.zhihu.com/people/whiledoing" target="_blank" title="知乎">知乎</a>
                  
                </span>
              
            </div>
          

          
          

          
          

          
            
          
          

        </div>
      </section>

      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; 2016 &mdash; <span itemprop="copyrightYear">2018</span>
  <span class="with-love" id="animate">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">whiledoing</span>

  

  
</div>




  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动 v3.7.1</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/theme-next/hexo-theme-next">NexT.Mist</a> v6.2.0</div>




        








        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>
























  



  
  
    <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/reading_progress/reading_progress.js"></script>
  


  


  <script type="text/javascript" src="/js/src/utils.js?v=6.2.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=6.2.0"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=6.2.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=6.2.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=6.2.0"></script>



  



	





  





  










  





  

  

  
<script>
(function(){
    var bp = document.createElement('script');
    var curProtocol = window.location.protocol.split(':')[0];
    if (curProtocol === 'https') {
        bp.src = 'https://zz.bdstatic.com/linksubmit/push.js';        
    }
    else {
        bp.src = 'http://push.zhanzhang.baidu.com/push.js';
    }
    var s = document.getElementsByTagName("script")[0];
    s.parentNode.insertBefore(bp, s);
})();
</script>


  
  

  
  

  


  
  

  
  
  
  <script src="/lib/pangu/dist/pangu.min.js?v=3.3"></script>
  <script type="text/javascript">pangu.spacingPage();</script>


  
  <script type="text/javascript" src="/js/src/js.cookie.js?v=6.2.0"></script>
  <script type="text/javascript" src="/js/src/scroll-cookie.js?v=6.2.0"></script>


  

  

  
  <style>
      .copy-btn {
          display: inline-block;
          padding: 6px 12px;
          font-size: 13px;
          font-weight: 700;
          line-height: 20px;
          color: #333;
          white-space: nowrap;
          vertical-align: middle;
          cursor: pointer;
          background-color: #eee;
          background-image: linear-gradient(#fcfcfc, #eee);
          border: 1px solid #d5d5d5;
          border-radius: 3px;
          user-select: none;
      }

      .highlight-wrap .copy-btn {
          transition: opacity .3s ease-in-out;
          opacity: 0;
          padding: 2px 6px;
          position: absolute;
          right: 4px;
          top: 8px;
      }

      .highlight-wrap:hover .copy-btn,
      .highlight-wrap .copy-btn:focus {
          opacity: 1
      }

      .highlight-wrap {
          position: relative;
      }
  </style>
  <script>
      $('.highlight').each(function(i, e) {
          var $wrap = $('<div>').addClass('highlight-wrap')
          $(e).after($wrap)
          $wrap.append($('<button>').addClass('copy-btn').append('复制').on('click', function(e) {
              var code = $(e.target).parent().find('.code').find('.line').map(function(i, e) {
                  return $(e).text()
              }).toArray().join('\n')
              var ta = document.createElement('textarea')
              document.body.appendChild(ta)
              ta.style.position = 'fixed'
              ta.style.top = 0
              ta.style.left = 0
              ta.value = code
              ta.select()
              ta.focus()
              document.execCommand('copy')
              document.body.removeChild(ta)
          })).append(e)
      })
  </script>


</body>
</html>
