<!DOCTYPE html>












  


<html class="theme-next mist use-motion" lang="zh-CN">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=2"/>
<meta name="theme-color" content="#222">



  
  
  <link rel="stylesheet" href="/lib/needsharebutton/needsharebutton.css">




  
  
    
    
  <script src="/lib/pace/pace.min.js?v=1.0.2"></script>
  <link href="/lib/pace/pace-theme-minimal.min.css?v=1.0.2" rel="stylesheet">




  
  
  <link rel="stylesheet" media="all" href="/lib/Han/dist/han.min.css?v=3.3">




<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />






















<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=6.4.0" rel="stylesheet" type="text/css" />


  <link rel="apple-touch-icon" sizes="180x180" href="/images/favicon.png?v=6.4.0">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon.png?v=6.4.0">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon.png?v=6.4.0">


  <link rel="mask-icon" href="/images/logo.svg?v=6.4.0" color="#222">









<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    version: '6.4.0',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":false,"onmobile":false},
    fancybox: false,
    fastclick: false,
    lazyload: false,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>


  




  <meta name="description" content="&amp;#x4ECA;&amp;#x5929;&amp;#x662F;&amp;#x7237;&amp;#x7237;&amp;#x751F;&amp;#x75C5;&amp;#x4F4F;&amp;#x9662;&amp;#x7684;&amp;#x7B2C;26&amp;#x5929;&amp;#x3002; &amp;#x65E9;&amp;#x4E0A;&amp;#x5976;&amp;#x5976;&amp;#x8FC7;&amp;#x53BB;&amp;#x4E86;&amp;#xFF0C;&amp;#x8BF4;&amp;#x8BA9;&amp;#x6211;&amp;#x59">
<meta name="keywords" content="日记,爷爷">
<meta property="og:type" content="article">
<meta property="og:title" content="diary-2017-12-10-SUN">
<meta property="og:url" content="http://whiledoing.me/2017/12/12/diary/diary-2017-12-10-SUN/index.html">
<meta property="og:site_name" content="whiledoing">
<meta property="og:description" content="&amp;#x4ECA;&amp;#x5929;&amp;#x662F;&amp;#x7237;&amp;#x7237;&amp;#x751F;&amp;#x75C5;&amp;#x4F4F;&amp;#x9662;&amp;#x7684;&amp;#x7B2C;26&amp;#x5929;&amp;#x3002; &amp;#x65E9;&amp;#x4E0A;&amp;#x5976;&amp;#x5976;&amp;#x8FC7;&amp;#x53BB;&amp;#x4E86;&amp;#xFF0C;&amp;#x8BF4;&amp;#x8BA9;&amp;#x6211;&amp;#x59">
<meta property="og:locale" content="zh-CN">
<meta property="og:image" content="http://static.zybuluo.com/whiledoing/sj919w8teuxwgcxup5hd9f9x/image_1c14b6131f3r63gc6414nh5no25.png">
<meta property="og:updated_time" content="2018-04-17T13:29:53.002Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="diary-2017-12-10-SUN">
<meta name="twitter:description" content="&amp;#x4ECA;&amp;#x5929;&amp;#x662F;&amp;#x7237;&amp;#x7237;&amp;#x751F;&amp;#x75C5;&amp;#x4F4F;&amp;#x9662;&amp;#x7684;&amp;#x7B2C;26&amp;#x5929;&amp;#x3002; &amp;#x65E9;&amp;#x4E0A;&amp;#x5976;&amp;#x5976;&amp;#x8FC7;&amp;#x53BB;&amp;#x4E86;&amp;#xFF0C;&amp;#x8BF4;&amp;#x8BA9;&amp;#x6211;&amp;#x59">
<meta name="twitter:image" content="http://static.zybuluo.com/whiledoing/sj919w8teuxwgcxup5hd9f9x/image_1c14b6131f3r63gc6414nh5no25.png">






  <link rel="canonical" href="http://whiledoing.me/2017/12/12/diary/diary-2017-12-10-SUN/"/>



<script type="text/javascript" id="page.configurations">
  CONFIG.page = {
    sidebar: "",
  };
</script>

  <title>diary-2017-12-10-SUN | whiledoing</title>
  




<script async src="https://www.googletagmanager.com/gtag/js?id=UA-117714040-1"></script>
<script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'UA-117714040-1');
</script>



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "https://hm.baidu.com/hm.js?6de2920425778ca5a4ee717be5055e96";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>




  <noscript>
  <style type="text/css">
    .use-motion .motion-element,
    .use-motion .brand,
    .use-motion .menu-item,
    .sidebar-inner,
    .use-motion .post-block,
    .use-motion .pagination,
    .use-motion .comments,
    .use-motion .post-header,
    .use-motion .post-body,
    .use-motion .collection-title { opacity: initial; }

    .use-motion .logo,
    .use-motion .site-title,
    .use-motion .site-subtitle {
      opacity: initial;
      top: initial;
    }

    .use-motion {
      .logo-line-before i { left: initial; }
      .logo-line-after i { right: initial; }
    }
  </style>
</noscript>

</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-CN">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">whiledoing</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
    
      
        <p class="site-subtitle">喜欢一切简单且美的事物，包括人。</p>
      
    
  </div>

  <div class="site-nav-toggle">
    <button aria-label="切换导航栏">
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>



<nav class="site-nav">
  
    <ul id="menu" class="menu">
      
        
        
        
          
          <li class="menu-item menu-item-home">
    <a href="/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-home"></i> <br />首页</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-about">
    <a href="/about/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-user"></i> <br />关于</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-tags">
    <a href="/tags/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />标签</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-archives">
    <a href="/archives/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />归档</a>
  </li>

      
      
    </ul>
  

  
    

  

  
</nav>



  



</div>
    </header>

    


    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  
    <div class="reading-progress-bar"></div>
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://whiledoing.me/2017/12/12/diary/diary-2017-12-10-SUN/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="whiledoing">
      <meta itemprop="description" content="喜欢一切简单且美的事物，包括人。">
      <meta itemprop="image" content="/images/avatar.jpeg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="whiledoing">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">diary-2017-12-10-SUN
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">

            
            
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              

              
                
              

              <time title="创建时间：2017-12-12 11:01:27" itemprop="dateCreated datePublished" datetime="2017-12-12T11:01:27+08:00">2017-12-12</time>
            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body han-init-context" itemprop="articleBody">

      
      

      
        <p>&#x4ECA;&#x5929;&#x662F;&#x7237;&#x7237;&#x751F;&#x75C5;&#x4F4F;&#x9662;&#x7684;&#x7B2C;26&#x5929;&#x3002;</p>
<p>&#x65E9;&#x4E0A;&#x5976;&#x5976;&#x8FC7;&#x53BB;&#x4E86;&#xFF0C;&#x8BF4;&#x8BA9;&#x6211;&#x597D;&#x597D;&#x4F11;&#x606F;&#xFF0C;&#x4E0B;&#x5348;&#x548C;&#x4E09;&#x5A76;&#x4E00;&#x8D77;&#x8FC7;&#x53BB;&#x3002;&#x6240;&#x4EE5;&#x65E9;&#x4E0A;&#x6211;&#x96BE;&#x5F97;&#x7761;&#x4E86;&#x4E00;&#x4E2A;&#x61D2;&#x89C9;&#xFF0C;&#x7B97;&#x662F;&#x5077;&#x5F97;&#x6D6E;&#x751F;&#x534A;&#x65E5;&#x95F2;&#x4E86;&#x3002;&#x672C;&#x6765;&#x60F3;&#x5403;&#x8FC7;&#x5348;&#x996D;&#x8FC7;&#x53BB;&#xFF0C;&#x4F46;&#x662F;&#x4E2D;&#x5348;&#x5976;&#x5976;&#x7ED9;&#x6211;&#x6253;&#x7535;&#x8BDD;&#xFF0C;&#x8BF4;&#x4E2D;&#x5348;&#x62A4;&#x5DE5;&#x5E08;&#x5085;&#x56DE;&#x5BB6;&#x5403;&#x996D;&#x4F11;&#x606F;&#xFF0C;&#x7237;&#x7237;&#x8981;&#x7FFB;&#x8EAB;&#x5C31;&#x4E00;&#x76F4;&#x95F9;&#xFF0C;&#x5976;&#x5976;&#x627E;&#x4E86;&#x9694;&#x58C1;&#x5E8A;&#x7684;&#x5E08;&#x5085;&#x5E2E;&#x5FD9;&#x7FFB;&#x4E86;&#x4E2A;&#x8EAB;&#x3002;&#x770B;&#x6765;&#x7237;&#x7237;&#x95F9;&#x5F97;&#x6709;&#x4E9B;&#x5389;&#x5BB3;&#xFF0C;&#x5976;&#x5976;&#x6709;&#x4E9B;&#x5FC3;&#x6025;&#xFF0C;&#x6211;&#x4E5F;&#x62C5;&#x5FC3;&#x7237;&#x7237;&#x4E2D;&#x5348;&#x8981;&#x662F;&#x4E00;&#x76F4;&#x95F9;&#xFF0C;&#x9694;&#x58C1;&#x53D7;&#x4E0D;&#x4E86;&#x518D;&#x6709;&#x5565;&#x51B2;&#x7A81;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x548C;&#x4E09;&#x5A76;&#x4E09;&#x4E0B;&#x4E94;&#x9664;&#x4E8C;&#x7684;&#x5403;&#x4E86;&#x5348;&#x996D;&#x5C31;&#x53BB;&#x4E86;&#x533B;&#x9662;&#x3002;</p>
<p>&#x7237;&#x7237;&#x6628;&#x5929;&#x665A;&#x4E0A;&#x8FD8;&#x662F;&#x6CA1;&#x6709;&#x600E;&#x4E48;&#x7761;&#xFF0C;&#x6298;&#x817E;&#x7684;&#x5389;&#x5BB3;&#xFF0C;&#x770B;&#x62A4;&#x5DE5;&#x5E08;&#x5085;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x7684;&#x75B2;&#x5026;&#xFF0C;&#x60F3;&#x6765;&#x5E94;&#x8BE5;&#x5982;&#x6B64;&#xFF0C;&#x4E5F;&#x8BF4;&#x660E;&#x62A4;&#x5DE5;&#x5E08;&#x5085;&#x5E94;&#x8BE5;&#x8FD8;&#x662F;&#x7528;&#x5FC3;&#x7167;&#x6599;&#x7684;&#x3002;&#x540E;&#x6765;&#xFF0C;&#x6211;&#x53C8;&#x62BD;&#x7A7A;&#x8D81;&#x62A4;&#x5DE5;&#x5E08;&#x5085;&#x4E0D;&#x6CE8;&#x610F;&#x7684;&#x65F6;&#x5019;&#x95EE;&#x4E86;&#x4E0B;&#x65C1;&#x8FB9;&#x5E8A;&#x7684;&#x5E08;&#x5085;&#x6628;&#x5929;&#x665A;&#x4E0A;&#x60C5;&#x51B5;&#x5982;&#x4F55;&#xFF0C;&#x4ED6;&#x8BF4;&#x62A4;&#x5DE5;&#x7167;&#x6599;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x7528;&#x5FC3;&#x7684;&#xFF0C;&#x81F3;&#x5C11;&#x7237;&#x7237;&#x6709;&#x5565;&#x53EB;&#x5524;&#x90FD;&#x4F1A;&#x6BD4;&#x8F83;&#x7ACB;&#x523B;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x62A4;&#x5DE5;&#x7684;&#x4E8B;&#x60C5;&#x7EC8;&#x4E8E;&#x7B97;&#x662F;&#x5FC3;&#x91CC;&#x8E0F;&#x5B9E;&#x4E86;&#x3002;</p>
<p>&#x4ECA;&#x5929;&#x6211;&#x544A;&#x8BC9;&#x62A4;&#x5DE5;&#x674E;&#x5E08;&#x5085;&#xFF0C;&#x6211;&#x4EEC;&#x591C;&#x73ED;&#x4E0A;&#x4E0B;&#x534A;&#x573A;&#xFF0C;&#x6211;&#x4E0A;&#x534A;&#x573A;&#x503C;&#x73ED;&#x5230;10&#x70B9;&#x5DE6;&#x53F3;&#xFF0C;&#x4ED6;&#x4F11;&#x606F;&#xFF0C;&#x540E;&#x9762;&#x4ED6;&#x9876;&#x6211;&#x73ED;&#xFF0C;&#x8FD9;&#x6837;&#x5B50;&#x6211;&#x53EF;&#x4EE5;&#x56DE;&#x53BB;&#x4F11;&#x606F;&#xFF0C;&#x767D;&#x5929;&#x8FD8;&#x53EF;&#x4EE5;&#x6709;&#x7CBE;&#x795E;&#x6765;&#x966A;&#x62A4;&#x53C2;&#x4E0E;&#x5EB7;&#x590D;&#x8BAD;&#x7EC3;&#x3002;&#x5176;&#x5B9E;&#x867D;&#x7136;&#x662F;&#x662F;&#x5206;&#x4E24;&#x4E2A;&#x534A;&#x573A;&#xFF0C;&#x4F46;&#x5176;&#x5B9E;&#x538B;&#x529B;&#x5B8C;&#x5168;&#x4E0D;&#x4E00;&#x6837;&#x3002;&#x7237;&#x7237;&#x665A;&#x4E0A;&#x5403;&#x8FC7;&#x4E4B;&#x540E;&#x5230;11&#x70B9;&#x5DE6;&#x53F3;&#x5176;&#x5B9E;&#x7761;&#x5F97;&#x90FD;&#x8FD8;&#x53EF;&#x4EE5;&#xFF0C;&#x4E00;&#x822C;&#x5230;&#x540E;&#x534A;&#x591C;&#x624D;&#x7279;&#x522B;&#x7684;&#x4EA2;&#x594B;&#x4E0D;&#x60F3;&#x7761;&#x89C9;&#x3002;&#x6240;&#x4EE5;&#x540E;&#x534A;&#x591C;&#x7684;&#x538B;&#x529B;&#x548C;&#x524D;&#x534A;&#x591C;&#x5B8C;&#x5168;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x91CF;&#x7EA7;&#x7684;&#x3002;&#x665A;&#x4E0A;&#x6211;&#x5728;&#x7237;&#x7237;&#x7761;&#x5F97;&#x6BD4;&#x8F83;&#x5B89;&#x9038;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6574;&#x7406;&#x4E86;&#x4E00;&#x4E0B;&#x7167;&#x987E;&#x7237;&#x7237;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x5730;&#x65B9;&#xFF1A;</p>
<ul>
<li>&#x7237;&#x7237;&#x7684;&#x9700;&#x6C42;&#x4E3B;&#x8981;&#x6709;&#x51E0;&#x4E2A;&#x70B9;&#xFF1A;&#x559D;&#x6C34;&#x3001;&#x7FFB;&#x8EAB;&#x3001;&#x8C03;&#x6574;&#x5E8A;&#x5934;&#x9AD8;&#x5EA6;&#x3001;&#x6709;&#x4EBA;&#x300C;&#x8010;&#x5FC3;&#x300D;&#x5730;&#x542C;&#x4ED6;&#x8BF4;&#x8BDD;&#x3001;&#x6C42;&#x62B1;&#x62B1;&#x3002;</li>
<li>&#x5C3D;&#x91CF;&#x4E0D;&#x8981;&#x548C;&#x7237;&#x7237;&#x505A;&#x5177;&#x4F53;&#x5185;&#x5BB9;&#x7684;&#x5BF9;&#x8BDD;&#xFF0C;&#x800C;&#x53EA;&#x662F;&#x548C;&#x4ED6;&#x8BF4;&#x300C;&#x597D;&#x300D;&#x300C;&#x6CA1;&#x95EE;&#x9898;&#x300D;&#x4E4B;&#x7C7B;&#x80AF;&#x5B9A;&#x8BDD;&#x8BED;&#xFF0C;&#x800C;&#x4E14;&#x8981;&#x9762;&#x5E26;&#x7B11;&#x5BB9;&#xFF0C;&#x4EE5;&#x5E73;&#x548C;&#x7684;&#x8BED;&#x6C14;&#x548C;&#x4ED6;&#x8BF4;&#xFF1B;&#x540C;&#x65F6;&#x63E1;&#x63E1;&#x4ED6;&#x7684;&#x624B;&#xFF0C;&#x6478;&#x6478;&#x4ED6;&#x7684;&#x8138;&#xFF0C;&#x987A;&#x7740;&#x5FC3;&#x53E3;&#xFF0C;&#x540E;&#x80CC;&#x5411;&#x4E0B;&#x629A;&#x6478;&#xFF0C;&#x5B89;&#x629A;&#x60C5;&#x7EEA;&#x3002;&#xFF08;&#x56E0;&#x4E3A;&#x4ED6;&#x8BF4;&#x8BDD;&#x591A;&#x6570;&#x65F6;&#x5019;&#x662F;&#x903B;&#x8F91;&#x4E0D;&#x6E05;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x8BF4;&#x7684;&#x8BDD;&#x4ED6;&#x4EA6;&#x542C;&#x4E0D;&#x61C2;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x6709;&#x6548;&#x7684;&#x5BF9;&#x8BDD;&#x5728;&#x4ED6;&#x8111;&#x5B50;&#x91CC;&#x300C;&#x53CD;&#x800C;&#x53EF;&#x80FD;&#x662F;&#x4E0D;&#x597D;&#x7684;&#x56DE;&#x590D;&#x300D;&#x3002;&#x56E0;&#x6B64;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x4E0D;&#x8981;&#x5BF9;&#x8BDD;&#xFF0C;&#x4EE5;&#x5B89;&#x629A;&#x4E3A;&#x4E3B;&#xFF0C;&#x4ED6;&#x662F;&#x53EF;&#x4EE5;&#x611F;&#x53D7;&#x5230;&#x6211;&#x4EEC;&#x8BF4;&#x8BDD;&#x65F6;&#x7684;&#x8868;&#x60C5;&#x548C;&#x60C5;&#x7EEA;&#xFF0C;&#x6240;&#x4EE5;&#x7B11;&#x5BB9;&#xFF0C;&#x80AF;&#x5B9A;&#x7684;&#x8BED;&#x6C14;&#xFF0C;&#x548C;&#x9002;&#x5F53;&#x7684;&#x80A2;&#x4F53;&#x5B89;&#x629A;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#xFF01;&#xFF09;</li>
<li>&#x5982;&#x679C;&#x611F;&#x53D7;&#x5230;&#x300C;&#x4ED6;&#x8BF4;&#x8BDD;&#x5F00;&#x59CB;&#x6FC0;&#x52A8;&#x300D;&#xFF0C;&#x4F3C;&#x6709;&#x6240;&#x9700;&#x6C42;&#xFF0C;&#x76F4;&#x63A5;&#x731C;&#x6D4B;&#x53EF;&#x80FD;&#x7684;&#x9700;&#x6C42;&#x5E76;&#x884C;&#x52A8;&#x53EF;&#x80FD;&#x6BD4;&#x8BE2;&#x95EE;&#x5F0F;&#x7684;&#x5BF9;&#x8BDD;&#x66F4;&#x6709;&#x6548;&#x3002;&#xFF08;&#x7565;&#x540C;&#x4E0A;&#x4E00;&#x6761;&#x7684;&#x903B;&#x8F91;&#x3002;&#x6BD4;&#x5982;&#x7237;&#x7237;&#x6709;&#x65F6;&#x5019;&#x53EF;&#x80FD;&#x8BF4;&#x597D;&#x591A;&#x5185;&#x5BB9;&#xFF0C;&#x8BF4;&#x4EC0;&#x4E48;3&#x4E2A;&#x6708;&#xFF0C;3&#x5E74;&#x4E86;&#xFF0C;&#x4F60;&#x4EEC;&#x90FD;&#x505A;&#x4E0D;&#x5230;&#xFF1B;&#x6216;&#x8005;&#x60C5;&#x7EEA;&#x300C;&#x6709;&#x4E9B;&#x6FC0;&#x52A8;&#x300D;&#x5730;&#x8BF4;&#x4E9B;&#x80E1;&#x4E71;&#x7684;&#x8BDD;&#x8BED;&#x7B49;&#x3002;&#x53EF;&#x80FD;&#x5B9E;&#x9645;&#x7684;&#x60C5;&#x51B5;&#x5C31;&#x662F;&#x4ED6;&#x8981;&#x559D;&#x6C34;&#x4E86;&#xFF0C;&#x76F4;&#x63A5;&#x628A;&#x624B;&#x653E;&#x5230;&#x4ED6;&#x5634;&#x8FB9;&#x78B0;&#x4E00;&#x78B0;&#xFF0C;&#x6216;&#x8005;&#x8200;&#x4E00;&#x52FA;&#x5B50;&#x6C34;&#x5230;&#x4ED6;&#x5634;&#x8FB9;&#x770B;&#x770B;&#x4ED6;&#x7684;&#x53CD;&#x9988;&#xFF0C;&#x5982;&#x679C;&#x4ED6;&#x5F20;&#x5927;&#x5634;&#xFF0C;&#x57FA;&#x672C;&#x5C31;&#x731C;&#x5BF9;&#x4E86;&#x9700;&#x6C42;&#xFF0C;&#x4ED6;&#x4E5F;&#x5C31;&#x4E0D;&#x518D;&#x60C5;&#x7EEA;&#x6FC0;&#x52A8;&#x7684;&#x8BF4;&#x8BDD;&#x4E86;&#xFF09;</li>
<li>&#x5982;&#x679C;&#x4ED6;&#x6BD4;&#x8F83;&#x5E73;&#x548C;&#x7684;&#x5F00;&#x59CB;&#x8BF4;&#x4E0D;&#x5C11;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#x9700;&#x8981;&#x6709;&#x4EBA;&#x300C;&#x8010;&#x5FC3;&#x542C;&#x4ED6;&#x8BF4;&#x8BDD;&#x300D;&#xFF0C;&#x4E00;&#x8FB9;&#x5B89;&#x629A;&#x4E00;&#x8FB9;&#x7ED9;&#x4ED6;&#x80AF;&#x5B9A;&#x7684;&#x56DE;&#x590D;&#xFF0C;&#x5E76;&#x542C;&#x4ED6;&#x8BF4;&#x8BDD;&#x5373;&#x53EF;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4ED6;&#x624B;&#x653E;&#x5230;&#x5634;&#x91CC;&#xFF0C;&#x6216;&#x8005;&#x78B0;&#x78B0;&#x7259;&#x9F7F;&#xFF08;&#x50CF;&#x662F;&#x8BF4;&#x7259;&#x75BC;&#xFF09;&#xFF0C;&#x5176;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x9700;&#x6C42;&#x662F;&#x8981;&#x300C;&#x559D;&#x6C34;&#x300D;&#x3002;</li>
<li>&#x8EBA;&#x5E8A;&#x4E0A;&#x559D;&#x6C34;&#x8981;&#x7565;&#x5FAE;&#x5C06;&#x5E8A;&#x5934;&#x6447;&#x8D77;&#x6765;&#xFF0C;&#x5E76;&#x5C0F;&#x5242;&#x91CF;&#x5582;&#x6C34;&#x3002;&#xFF08;&#x533B;&#x751F;&#x8BF4;&#x7237;&#x7237;&#x6709;&#x300C;&#x8BEF;&#x5438;&#x300D;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x8FD8;&#x662F;&#x8981;&#x7559;&#x610F;&#xFF09;</li>
<li>&#x4ED6;&#x559D;&#x6C34;&#x4E4B;&#x540E;&#x4F1A;&#x6447;&#x6447;&#x624B;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x662F;&#x8981;&#x544A;&#x8BC9;&#x4F60;&#x4ED6;&#x4E0D;&#x559D;&#x4E86;&#xFF0C;&#x800C;&#x662F;&#x544A;&#x8BC9;&#x4F60;&#x300C;&#x7A0D;&#x7B49;&#x4E00;&#x4E0B;&#xFF0C;&#x6211;&#x8FD8;&#x6CA1;&#x6709;&#x559D;&#x5B8C;&#xFF0C;&#x4F11;&#x606F;&#x4E00;&#x4E0B;&#x518D;&#x559D;&#x300D;&#xFF08;&#x53EF;&#x4EE5;&#x8FC7;&#x4E00;&#x4F1A;&#x518D;&#x5582;&#x5582;&#xFF0C;&#x591A;&#x8BD5;&#x4E00;&#x4E24;&#x6B21;&#xFF0C;&#x5982;&#x679C;&#x4ED6;&#x8FD8;&#x662F;&#x62D2;&#x7EDD;&#x90A3;&#x624D;&#x662F;&#x771F;&#x7684;&#x4E0D;&#x559D;&#x3002;&#x5403;&#x996D;&#x4EA6;&#x540C;&#x7406;&#xFF0C;&#x8981;&#x591A;&#x8BD5;&#x51E0;&#x6B21;&#x3002;&#xFF09;</li>
<li>&#x5982;&#x679C;&#x4ED6;&#x8EAB;&#x4F53;&#x6709;&#x5DE6;&#x53F3;&#x6447;&#x6643;&#x503E;&#x5411;&#xFF0C;&#x6216;&#x8005;&#x624B;&#x4E0D;&#x505C;&#x7684;&#x4FA7;&#x5411;&#x4E00;&#x8FB9;&#x53D1;&#x529B;&#xFF0C;&#x591A;&#x6570;&#x662F;&#x8981;&#x7FFB;&#x8EAB;&#x3002;&#xFF08;&#x53EF;&#x4EE5;&#x8BD5;&#x7740;&#x5C06;&#x5176;&#x8EAB;&#x4F53;&#x62B1;&#x4F4F;&#xFF0C;&#x5F80;&#x5BF9;&#x5E94;&#x65B9;&#x5411;&#x6447;&#x6446;&#xFF0C;&#x4ED6;&#x4F1A;&#x7ED9;&#x51FA;&#x597D;&#x7684;&#x53CD;&#x9988;&#xFF0C;&#x90A3;&#x57FA;&#x672C;&#x5C31;&#x77E5;&#x9053;&#x4ED6;&#x662F;&#x8981;&#x7FFB;&#x8EAB;&#x4E5F;&#x77E5;&#x9053;&#x4ED6;&#x7FFB;&#x8EAB;&#x7684;&#x65B9;&#x5411;&#x4E86;&#xFF09;</li>
<li>&#x5E73;&#x7761;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8981;&#x6CE8;&#x610F;&#x4F53;&#x4F4D;&#xFF1A;&#x53F3;&#x4FA7;&#x624B;&#x81C2;&#xFF08;&#x4E0D;&#x80FD;&#x52A8;&#x7684;&#x65B9;&#x5411;&#xFF09;&#x4E0B;&#x65B9;&#x8981;&#x57AB;&#x4E00;&#x4E2A;&#x5E73;&#x6795;&#x5934;&#xFF0C;&#x7F13;&#x89E3;&#x53F3;&#x4FA7;&#x624B;&#x81C2;&#x7684;&#x538B;&#x529B;&#xFF1B;&#x53F3;&#x4FA7;&#x624B;&#x81C2;&#x9700;&#x8981;&#x653E;&#x5E73;&#xFF0C;&#x6BD4;&#x8F83;&#x81EA;&#x7136;&#x7684;&#x4F53;&#x4F4D;&#xFF0C;&#x4E14;&#x624B;&#x638C;&#x5FC3;&#x5411;&#x4E0A;&#xFF1B;&#x53F3;&#x4FA7;&#x5927;&#x817F;&#x9700;&#x8981;&#x5782;&#x76F4;&#x653E;&#x5E73;&#xFF1B;&#x53F3;&#x4FA7;&#x811A;&#x8DBE;&#x5782;&#x76F4;&#x5411;&#x4E0A;&#xFF0C;&#x811A;&#x5E95;&#x5782;&#x76F4;&#x5411;&#x4E0A;&#xFF08;&#x7528;&#x6BDB;&#x5DFE;&#x5305;&#x88F9;&#x56FA;&#x5B9A;&#xFF09;</li>
<li>&#x5E73;&#x7761;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7237;&#x7237;&#x559C;&#x6B22;&#x5C06;&#x4E24;&#x53EA;&#x624B;&#x76F8;&#x4E92;&#x63E1;&#x4F4F;&#x653E;&#x5728;&#x5934;&#x9876;&#x3002;&#xFF08;&#x5982;&#x679C;&#x4ED6;&#x6709;&#x5DE6;&#x624B;&#x62C9;&#x53F3;&#x624B;&#x81C2;&#x5E76;&#x63D0;&#x4E3E;&#x7684;&#x52A8;&#x4F5C;&#xFF0C;&#x9700;&#x8981;&#x8F85;&#x52A9;&#x4ED6;&#x4E00;&#x4E0B;&#xFF0C;&#x5C06;&#x53F3;&#x4FA7;&#x624B;&#x81C2;&#x653E;&#x5728;&#x5934;&#x9876;&#x3002;&#xFF09;</li>
<li>&#x53F3;&#x4FA7;&#x7761;&#xFF08;&#x53F3;&#x4FA7;&#x5927;&#x817F;&#x5728;&#x4E0B;&#xFF09;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8981;&#x6CE8;&#x610F;&#x4F53;&#x4F4D;&#xFF1A;&#x5DE6;&#x4FA7;&#x5927;&#x817F;&#x548C;&#x53F3;&#x4FA7;&#x5927;&#x817F;&#x9519;&#x5F00;&#xFF0C;&#x5C3D;&#x91CF;&#x4E0D;&#x8981;&#x538B;&#x7740;&#x53F3;&#x4FA7;&#x5927;&#x817F;&#xFF1B;&#x5DE6;&#x4FA7;&#x5927;&#x817F;&#x4E0B;&#x65B9;&#x653E;&#x4E00;&#x4E2A;&#x6795;&#x5934;&#xFF0C;&#x7F13;&#x89E3;&#x53F3;&#x4FA7;&#x5927;&#x817F;&#x7684;&#x538B;&#x529B;&#xFF1B;&#x540E;&#x80CC;&#x653E;&#x4E00;&#x4E2A;&#x4E09;&#x89D2;&#x9760;&#x6795;&#xFF0C;&#x7F13;&#x89E3;&#x540E;&#x80CC;&#x4FA7;&#x5012;&#x4E0B;&#x6765;&#x7684;&#x538B;&#x529B;&#xFF1B;&#x53F3;&#x4FA7;&#x624B;&#x81C2;&#x4E0B;&#x65B9;&#x653E;&#x4E00;&#x4E2A;&#x5E73;&#x6795;&#x5934;&#xFF0C;&#x5E76;&#x5C3D;&#x91CF;&#x5E73;&#x653E;&#x3002;</li>
<li>&#x5DE6;&#x4FA7;&#x7761;&#xFF08;&#x5DE6;&#x4FA7;&#x5927;&#x817F;&#x5728;&#x4E0B;&#xFF09;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8981;&#x6CE8;&#x610F;&#x4F53;&#x4F4D;&#xFF1A;&#x53F3;&#x4FA7;&#x624B;&#x81C2;&#xFF08;&#x4E0D;&#x80FD;&#x52A8;&#x7684;&#x4E00;&#x4FA7;&#xFF09;&#x4E0B;&#x65B9;&#x57AB;&#x4E00;&#x4E2A;&#x5E73;&#x6795;&#x5934;&#x3002;&#x540E;&#x80CC;&#x653E;&#x4E00;&#x4E2A;&#x4E09;&#x89D2;&#x6795;&#x3002;</li>
<li>&#x653E;&#x6795;&#x5934;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9700;&#x8981;&#x7279;&#x522B;&#x7559;&#x610F;&#x300C;&#x4E0D;&#x8981;&#x538B;&#x5012;&#x5BFC;&#x5C3F;&#x7BA1;&#x300D;&#xFF0C;&#x4E0D;&#x7136;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x4E0D;&#x80FD;&#x6B63;&#x5E38;&#x7684;&#x5C0F;&#x4FBF;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4E0D;&#x7ED9;&#x76D6;&#x88AB;&#x5B50;&#xFF0C;&#x5C31;&#x60F3;&#x529E;&#x6CD5;&#x5438;&#x5F15;&#x4ED6;&#x7684;&#x6CE8;&#x610F;&#x529B;&#xFF0C;&#x300C;&#x54C4;&#x9A97;&#x300D;&#x7684;&#x540C;&#x65F6;&#x76D6;&#x4E0A;&#x88AB;&#x5B50;&#x3002;&#x5982;&#x679C;&#x8FD8;&#x662F;&#x4E0D;&#x884C;&#xFF0C;&#x5C31;&#x8FC7;&#x4F1A;&#x518D;&#x8BD5;&#x3002;&#x5982;&#x679C;&#x8FD8;&#x662F;&#x4E0D;&#x884C;&#xFF0C;&#x5C31;&#x518D;&#x8FC7;&#x4E00;&#x4F1A;&#x3002;&#x5982;&#x679C;&#x8FD8;&#x662F;&#x4E0D;&#x884C;&#xFF0C;&#x5C31;&#x7761;&#x7740;&#x4E86;&#x4E00;&#x4F1A;&#x518D;&#x8BD5;&#x3002;</li>
<li>&#x8981;&#x5C06;&#x7237;&#x7237;&#x770B;&#x6210;&#x300C;&#x6BD4;&#x5C0F;&#x670B;&#x53CB;&#x8FD8;&#x5C0F;&#x670B;&#x53CB;&#x7684;&#x5C0F;&#x670B;&#x53CB;&#x300D;&#xFF0C;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x8010;&#x5FC3;&#xFF0C;&#x7EC6;&#x8282;&#xFF0C;&#x5B89;&#x629A;&#xFF0C;&#x4E0D;&#x8BBA;&#x5FC3;&#x91CC;&#x591A;&#x7740;&#x6025;&#xFF0C;&#x90FD;&#x5E26;&#x7740;&#x5E73;&#x548C;&#x7684;&#x60C5;&#x7EEA;&#xFF0C;&#x6302;&#x7740;&#x7B11;&#x5BB9;&#x3002;</li>
</ul>
<p>&#x6253;&#x5B8C;&#x4E86;&#x6240;&#x6709;&#x8981;&#x70B9;&#x4E4B;&#x540E;&#x60F3;&#x8D77;&#x6765;&#x4E4B;&#x524D;&#x4E66;&#x4E2D;&#x770B;&#x5230;&#x7684;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x5927;&#x81F4;&#x610F;&#x601D;&#x5982;&#x4E0B;&#xFF1A;</p>
<blockquote>
<p>&#x4E0D;&#x81EA;&#x5F8B;&#x7684;&#x4EBA;&#x6C38;&#x8FDC;&#x4E0D;&#x77E5;&#x9053;&#x7CBE;&#x795E;&#x6298;&#x78E8;&#x80CC;&#x540E;&#x7684;&#x6210;&#x5C31;&#x611F;&#xFF0C;&#x5C31;&#x5982;&#x540C;&#x4F3C;&#x662F;&#x800C;&#x975E;&#x7684;&#x4EBA;&#x6C38;&#x8FDC;&#x4E0D;&#x77E5;&#x9053;&#x4E8B;&#x65E0;&#x5DE8;&#x7EC6;&#x7684;&#x91CD;&#x8981;&#x6027;&#x4E00;&#x6837;&#x3002;</p>
</blockquote>
<p>&#x53C8;&#x53CA;&#xFF0C;&#x719F;&#x7761;&#x7684;&#x7237;&#x7237;&#xFF1A;</p>
<p><img src="http://static.zybuluo.com/whiledoing/sj919w8teuxwgcxup5hd9f9x/image_1c14b6131f3r63gc6414nh5no25.png" alt="image_1c14b6131f3r63gc6414nh5no25.png-1637.4kB"></p>

      
    </div>

    
      

  <div class="popular-posts-header">相关文章</div>
  <ul class="popular-posts">
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/16/diary/diary-2017-12-13-WED/" rel="bookmark">diary-2017-12-13-WED</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/19/diary/diary-2016-12-14-THU/" rel="bookmark">diary-2016-12-14-THU</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/11/diary/diary-2017-12-07-THU/" rel="bookmark">diary-2017-12-07-THU</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/11/diary/diary-2017-12-08-FRI/" rel="bookmark">diary-2017-12-08-FRI</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/12/diary/diary-2017-12-09-SAT/" rel="bookmark">diary-2017-12-09-SAT</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/12/diary/diary-2017-12-11-MON/" rel="bookmark">diary-2017-12-11-MON</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/16/diary/diary-2017-12-12-TUE/" rel="bookmark">diary-2017-12-12-TUE</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/12/21/diary/diary-2017-12-15-FRI/" rel="bookmark">diary-2017-12-15-FRI</a></div>
      
    </li>
  
  </ul>


    

    
    
    

    

    

    
      <div>
        <ul class="post-copyright">
  <li class="post-copyright-author">
    <strong>本文作者： </strong>whiledoing</li>
  <li class="post-copyright-link">
    <strong>本文链接：</strong>
    <a href="http://whiledoing.me/2017/12/12/diary/diary-2017-12-10-SUN/" title="diary-2017-12-10-SUN">http://whiledoing.me/2017/12/12/diary/diary-2017-12-10-SUN/</a>
  </li>
  <li class="post-copyright-license">
    <strong>版权声明： </strong>本博客所有文章除特别声明外，均采用 <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/" rel="external nofollow" target="_blank">CC BY-NC-SA 4.0</a> 许可协议。转载请注明出处！</li>
</ul>

      </div>
    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/日记/" rel="tag"># 日记</a>
          
            <a href="/tags/爷爷/" rel="tag"># 爷爷</a>
          
        </div>
      

      
      
        <div class="post-widgets">
        

        

        
          
          <div class="social_share">
            
            
               <div id="needsharebutton-postbottom">
                 <span class="btn">
                    <i class="fa fa-share-alt" aria-hidden="true"></i>
                 </span>
               </div>
            
          </div>
        
        </div>
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2017/12/12/diary/diary-2017-12-09-SAT/" rel="next" title="diary-2017-12-09-SAT">
                <i class="fa fa-chevron-left"></i> diary-2017-12-09-SAT
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2017/12/12/diary/diary-2017-12-11-MON/" rel="prev" title="diary-2017-12-11-MON">
                diary-2017-12-11-MON <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


  </div>


          </div>
          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      

      <section class="site-overview-wrap sidebar-panel sidebar-panel-active">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <img class="site-author-image" itemprop="image"
                src="/images/avatar.jpeg"
                alt="whiledoing" />
            
              <p class="site-author-name" itemprop="name">whiledoing</p>
              <p class="site-description motion-element" itemprop="description">喜欢一切简单且美的事物，包括人。</p>
          </div>

          
            <nav class="site-state motion-element">
              
                <div class="site-state-item site-state-posts">
                
                  <a href="/archives/">
                
                    <span class="site-state-item-count">60</span>
                    <span class="site-state-item-name">日志</span>
                  </a>
                </div>
              

              

              
                
                
                <div class="site-state-item site-state-tags">
                  <a href="/tags/index.html">
                    
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                    <span class="site-state-item-count">32</span>
                    <span class="site-state-item-name">标签</span>
                  </a>
                </div>
              
            </nav>
          

          

          
            <div class="links-of-author motion-element">
              
                <span class="links-of-author-item">
                  <a href="https://github.com/whiledoing" target="_blank" title="GitHub">GitHub</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="http://www.douban.com/people/58249409" target="_blank" title="豆瓣">豆瓣</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="https://www.zhihu.com/people/whiledoing" target="_blank" title="知乎">知乎</a>
                  
                </span>
              
            </div>
          

          
          

          
          

          
            
          
          

        </div>
      </section>

      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; 2016 – <span itemprop="copyrightYear">2018</span>
  <span class="with-love" id="animate">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">whiledoing</span>

  

  
</div>




  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动 v3.7.1</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 – <a class="theme-link" target="_blank" href="https://theme-next.org">NexT.Mist</a> v6.4.0</div>




        








        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

    
      <div id="needsharebutton-float">
        <span class="btn">
          <i class="fa fa-share-alt" aria-hidden="true"></i>
        </span>
      </div>
    
	
    

    
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>
























  



  
  
    <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/reading_progress/reading_progress.js"></script>
  


  


  <script type="text/javascript" src="/js/src/utils.js?v=6.4.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=6.4.0"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=6.4.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=6.4.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=6.4.0"></script>



  



  










  





  

  

  
<script>
(function(){
    var bp = document.createElement('script');
    var curProtocol = window.location.protocol.split(':')[0];
    if (curProtocol === 'https') {
        bp.src = 'https://zz.bdstatic.com/linksubmit/push.js';        
    }
    else {
        bp.src = 'http://push.zhanzhang.baidu.com/push.js';
    }
    var s = document.getElementsByTagName("script")[0];
    s.parentNode.insertBefore(bp, s);
})();
</script>


  
  

  
  

  


  
  
  
  <script src="/lib/needsharebutton/needsharebutton.js"></script>

  <script>
    
      pbOptions = {};
      
          pbOptions.iconStyle = "default";
      
          pbOptions.boxForm = "vertical";
      
          pbOptions.position = "bottomLeft";
      
          pbOptions.networks = "Weibo,Wechat,Douban";
      
      new needShareButton('#needsharebutton-postbottom', pbOptions);
    
    
      flOptions = {};
      
          flOptions.iconStyle = "box";
      
          flOptions.boxForm = "vertical";
      
          flOptions.position = "middleRight";
      
          flOptions.networks = "Weibo,Wechat,Douban,QQZone,Twitter,Facebook";
      
      new needShareButton('#needsharebutton-float', flOptions);
    
  </script>

  

  
  
  
  <script src="/lib/pangu/dist/pangu.min.js?v=3.3"></script>
  <script type="text/javascript">pangu.spacingPage();</script>


  
  <script type="text/javascript" src="/js/src/js.cookie.js?v=6.4.0"></script>
  <script type="text/javascript" src="/js/src/scroll-cookie.js?v=6.4.0"></script>


  

  

  
  <style>
    .copy-btn {
      display: inline-block;
      padding: 6px 12px;
      font-size: 13px;
      font-weight: 700;
      line-height: 20px;
      color: #333;
      white-space: nowrap;
      vertical-align: middle;
      cursor: pointer;
      background-color: #eee;
      background-image: linear-gradient(#fcfcfc, #eee);
      border: 1px solid #d5d5d5;
      border-radius: 3px;
      user-select: none;
      outline: 0;
    }

    .highlight-wrap .copy-btn {
      transition: opacity .3s ease-in-out;
      opacity: 0;
      padding: 2px 6px;
      position: absolute;
      right: 4px;
      top: 8px;
    }

    .highlight-wrap:hover .copy-btn,
    .highlight-wrap .copy-btn:focus {
      opacity: 1
    }

    .highlight-wrap {
      position: relative;
    }
  </style>
  <script>
    $('.highlight').each(function (i, e) {
      var $wrap = $('<div>').addClass('highlight-wrap')
      $(e).after($wrap)
      $wrap.append($('<button>').addClass('copy-btn').append('复制').on('click', function (e) {
        var code = $(this).parent().find('.code').find('.line').map(function (i, e) {
          return $(e).text()
        }).toArray().join('\n')
        var ta = document.createElement('textarea')
        document.body.appendChild(ta)
        ta.style.position = 'absolute'
        ta.style.top = '0px'
        ta.style.left = '0px'
        ta.value = code
        ta.select()
        ta.focus()
        var result = document.execCommand('copy')
        document.body.removeChild(ta)
        
        $(this).blur()
      })).on('mouseleave', function (e) {
        var $b = $(this).find('.copy-btn')
        setTimeout(function () {
          $b.text('复制')
        }, 300)
      }).append(e)
    })
  </script>


</body>
</html>
