<!DOCTYPE html>



  


<html class="theme-next mist use-motion" lang="zh-CN">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=2"/>
<meta name="theme-color" content="#222">






  
  
    
    
  <script src="/lib/pace/pace.min.js?v=1.0.2"></script>
  <link href="/lib/pace/pace-theme-minimal.min.css?v=1.0.2" rel="stylesheet">




  
  
  <link rel="stylesheet" media="all" href="/lib/Han/dist/han.min.css?v=3.3">




<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />






















<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=6.2.0" rel="stylesheet" type="text/css" />


  <link rel="apple-touch-icon" sizes="180x180" href="/images/favicon.png?v=6.2.0">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon.png?v=6.2.0">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon.png?v=6.2.0">


  <link rel="mask-icon" href="/images/logo.svg?v=6.2.0" color="#222">









<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    version: '6.2.0',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":false,"onmobile":false},
    fancybox: false,
    fastclick: false,
    lazyload: false,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>


  




  <meta name="description" content="记录了两本理财入门书籍的读书笔记。">
<meta name="keywords" content="读书笔记,理财">
<meta property="og:type" content="article">
<meta property="og:title" content="《富爸爸穷爸爸》&amp;《小狗钱钱》读书笔记">
<meta property="og:url" content="http://whiledoing.me/2017/11/30/money-hacker-reading-note/index.html">
<meta property="og:site_name" content="whiledoing">
<meta property="og:description" content="记录了两本理财入门书籍的读书笔记。">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2018-04-17T13:29:52.933Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="《富爸爸穷爸爸》&amp;《小狗钱钱》读书笔记">
<meta name="twitter:description" content="记录了两本理财入门书籍的读书笔记。">






  <link rel="canonical" href="http://whiledoing.me/2017/11/30/money-hacker-reading-note/"/>



<script type="text/javascript" id="page.configurations">
  CONFIG.page = {
    sidebar: "",
  };
</script>

  <title>《富爸爸穷爸爸》&《小狗钱钱》读书笔记 | whiledoing</title>
  




<script async src="https://www.googletagmanager.com/gtag/js?id=UA-117714040-1"></script>
<script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'UA-117714040-1');
</script>






  <noscript>
  <style type="text/css">
    .use-motion .motion-element,
    .use-motion .brand,
    .use-motion .menu-item,
    .sidebar-inner,
    .use-motion .post-block,
    .use-motion .pagination,
    .use-motion .comments,
    .use-motion .post-header,
    .use-motion .post-body,
    .use-motion .collection-title { opacity: initial; }

    .use-motion .logo,
    .use-motion .site-title,
    .use-motion .site-subtitle {
      opacity: initial;
      top: initial;
    }

    .use-motion {
      .logo-line-before i { left: initial; }
      .logo-line-after i { right: initial; }
    }
  </style>
</noscript>

</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-CN">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">whiledoing</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">喜欢一切简单且美的事物，包括人。</p>
      
  </div>

  <div class="site-nav-toggle">
    <button aria-label="切换导航栏">
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>




<nav class="site-nav">
  
    <ul id="menu" class="menu">
      
        
        
        
          
          <li class="menu-item menu-item-home">
    <a href="/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-home"></i> <br />首页</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-tags">
    <a href="/tags/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />标签</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-archives">
    <a href="/archives/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />归档</a>
  </li>

      
      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br />搜索</a>
        </li>
      
    </ul>
  

  
    

  

  
    <div class="site-search">
      
  <div class="popup search-popup local-search-popup">
  <div class="local-search-header clearfix">
    <span class="search-icon">
      <i class="fa fa-search"></i>
    </span>
    <span class="popup-btn-close">
      <i class="fa fa-times-circle"></i>
    </span>
    <div class="local-search-input-wrapper">
      <input autocomplete="off"
             placeholder="搜索..." spellcheck="false"
             type="text" id="local-search-input">
    </div>
  </div>
  <div id="local-search-result"></div>
</div>



    </div>
  
</nav>



  



</div>
    </header>

    


    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  
    <div class="reading-progress-bar"></div>
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://whiledoing.me/2017/11/30/money-hacker-reading-note/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="whiledoing">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/images/avatar.jpeg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="whiledoing">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">《富爸爸穷爸爸》&《小狗钱钱》读书笔记
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">

            
            
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              

              
                
              

              <time title="创建时间：2017-11-30 10:45:35" itemprop="dateCreated datePublished" datetime="2017-11-30T10:45:35+08:00">2017-11-30</time>
            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body han-init-context" itemprop="articleBody">

      
      

      
        <p>&#x8BB0;&#x5F55;&#x4E86;&#x4E24;&#x672C;&#x7406;&#x8D22;&#x5165;&#x95E8;&#x4E66;&#x7C4D;&#x7684;&#x8BFB;&#x4E66;&#x7B14;&#x8BB0;&#x3002;</p>
<a id="more"></a>
<h2 id="&#x5BCC;&#x7238;&#x7238;&#x7A77;&#x7238;&#x7238;">&#x300A;&#x5BCC;&#x7238;&#x7238;&#x7A77;&#x7238;&#x7238;&#x300B;</h2>
<p>&#x672C;&#x4E66;&#x7684;&#x4E3B;&#x4EBA;&#x516C;&#x6709;&#x4E24;&#x4E2A;&#x7238;&#x7238;&#xFF0C;&#x4E00;&#x4E2A;&#x5B89;&#x4E8E;&#x672C;&#x5206;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x5546;&#x6D77;&#x7CBE;&#x82F1;&#x3002;&#x4F5C;&#x8005;&#x901A;&#x8FC7;&#x5BF9;&#x4E24;&#x4F4D;&#x7238;&#x7238;&#x5BF9;&#x4E8E;&#x91D1;&#x94B1;&#x7684;&#x4E0D;&#x540C;&#x770B;&#x6CD5;&#x6765;&#x8BF4;&#x660E;&#x300C;&#x8D22;&#x5546;&#x300D;&#x662F;&#x591A;&#x4E48;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x6211;&#x4EEC;&#x5F88;&#x591A;&#x4EBA;&#x603B;&#x662F;&#x4E0D;&#x91CD;&#x89C6;&#x8FD9;&#x5757;&#x7684;&#x5B66;&#x4E60;&#x548C;&#x6559;&#x80B2;&#xFF0C;&#x800C;&#x89C9;&#x5F97;&#x5DE5;&#x4F5C;&#xFF0C;&#x6D88;&#x8D39;&#x624D;&#x662F;&#x751F;&#x6D3B;&#x7684;&#x5168;&#x90E8;&#x8F68;&#x8FF9;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x6211;&#x5BF9;&#x672C;&#x4E66;&#x7684;&#x5B66;&#x4E60;&#x603B;&#x7ED3;&#xFF1A;</p>
<p>&#x666E;&#x901A;&#x4EBA;&#x5BB9;&#x6613;&#x9677;&#x5165;&#x300C;&#x8001;&#x9F20;&#x8D5B;&#x8DD1;&#x300D;&#x7684;&#x9677;&#x9631;&#x4E2D;&#xFF1A;&#x6211;&#x4EEC;&#x4E0D;&#x505C;&#x7684;&#x4E3A;&#x8001;&#x677F;&#x5DE5;&#x4F5C;&#xFF0C;&#x901A;&#x8FC7;&#x4EA4;&#x7A0E;&#x4E3A;&#x653F;&#x5E9C;&#x5DE5;&#x4F5C;&#xFF0C;&#x901A;&#x8FC7;&#x507F;&#x8FD8;&#x8D37;&#x6B3E;&#x548C;&#x4FE1;&#x7528;&#x5361;&#x8D37;&#x6B3E;&#x4F4D;&#x94F6;&#x884C;&#x5DE5;&#x4F5C;&#x3002;</p>
<blockquote>
<p>&#x53EA;&#x6709;&#x7CBE;&#x901A;<strong>&#x4F1A;&#x8BA1;&#x548C;&#x6295;&#x8D44;</strong>&#x624D;&#x80FD;&#x8DF3;&#x51FA;&#x300C;&#x8001;&#x9F20;&#x8D5B;&#x8DD1;&#x300D;&#x7684;&#x9677;&#x9631;&#x4E2D;&#xFF08;&#x9700;&#x8981;&#x6709;&#x7A7A;&#x53BB;&#x5B66;&#x4E60;&#x4E00;&#x4E0B;&#x4F1A;&#x8BA1;&#x76F8;&#x5173;&#x7684;&#x77E5;&#x8BC6;&#xFF09;</p>
</blockquote>
<blockquote>
<p>&#x6211;&#x4EEC;&#x8981;&#x5F97;&#x5230;&#x66F4;&#x591A;&#x7684;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x6559;&#x80B2;&#xFF0C;&#x8981;&#x77E5;&#x9053;&#x771F;&#x5B9E;&#x751F;&#x6D3B;&#x4E2D;&#x7684;&#x6E38;&#x620F;&#x89C4;&#x5219;&#xFF0C;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x89C4;&#x5219;&#x3002;</p>
</blockquote>
<p>&#x4E66;&#x4E2D;&#x5F3A;&#x8C03;&#x6700;&#x591A;&#x7684;&#x6982;&#x5FF5;&#x5C31;&#x662F;&#xFF1A;&#x5B66;&#x4F1A;&#x8BA9;&#x300C;&#x94B1;&#x4E3A;&#x4F60;&#x5DE5;&#x4F5C;&#x300D;&#xFF1A;</p>
<ol>
<li>&#x5B66;&#x4F1A;&#x6295;&#x8D44;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x53EA;&#x4F1A;&#x6323;&#x94B1;&#xFF0C;&#x8BA9;&#x81EA;&#x5DF1;&#x4E3A;&#x94B1;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x4E86;&#x89E3;&#x548C;&#x5B66;&#x4E60;&#x91D1;&#x94B1;&#x8FD0;&#x4F5C;&#x7684;&#x89C4;&#x5F8B;&#xFF0C;&#x597D;&#x8BA9;&#x94B1;&#x4E3A;&#x6211;&#x6240;&#x7528;&#x3002;</li>
</ol>
<blockquote>
<p>&#x5927;&#x591A;&#x6570;&#x4EBA;&#x53EA;&#x662F;&#x5938;&#x5938;&#x5176;&#x8C08;&#xFF0C;&#x68A6;&#x60F3;&#x7740;&#x53D1;&#x8D22;&#x81F4;&#x5BCC;&#xFF0C;&#x800C;&#x4F60;&#x4EEC;&#x5DF2;&#x7ECF;&#x4ED8;&#x51FA;&#x4E86;&#x884C;&#x52A8;&#x3002;&#x6211;&#x771F;&#x4E3A;&#x4F60;&#x4EEC;&#x9A84;&#x50B2;&#xFF0C;&#x6211;&#x8981;&#x518D;&#x8BF4;&#x4E00;&#x904D;&#xFF0C;&#x7EE7;&#x7EED;&#x52AA;&#x529B;&#xFF0C;&#x4E0D;&#x8981;&#x653E;&#x5F03;</p>
</blockquote>
<p>&#x5927;&#x591A;&#x6570;&#x4EBA;&#x7684;&#x90FD;&#x53EA;&#x662F;&#x89C9;&#x5F97;&#x4E0D;&#x53EF;&#x80FD;&#xFF0C;&#x53EA;&#x662F;&#x8BF4;&#x8BF4;&#xFF0C;&#x800C;&#x4E0D;&#x53BB;&#x884C;&#x52A8;&#xFF0C;&#x4E00;&#x4E2A;&#x8981;&#x6210;&#x4E3A;&#x300C;&#x5BCC;&#x4EBA;&#x300D;&#x7684;&#x4EBA;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x54C1;&#x8D28;&#x5C31;&#x662F;&#x4E0D;&#x754F;&#x96BE;&#xFF0C;&#x7136;&#x540E;&#x575A;&#x5B9A;&#x7684;&#x884C;&#x52A8;&#x3002;</p>
<blockquote>
<p>&#x673A;&#x4F1A;&#x603B;&#x662F;&#x8F6C;&#x77AC;&#x5373;&#x901D;&#x7684;&#xFF0C;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x8981;&#x8FC5;&#x901F;&#x505A;&#x51FA;&#x51B3;&#x5B9A;&#x662F;&#x4E00;&#x4EF6;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x6280;&#x80FD;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x662F;&#x5927;&#x80FD;&#x529B;&#xFF0C;&#x9700;&#x8981;&#x4E0D;&#x505C;&#x7684;&#x52AA;&#x529B;&#x9020;&#x5C31;&#x3002;</p>
<blockquote>
<p>&#x6211;&#x60F3;&#x6709;&#x592A;&#x591A;&#x7684;&#x4EBA;&#x8FC7;&#x591A;&#x7684;&#x5173;&#x6CE8;&#x91D1;&#x94B1;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5173;&#x6CE8;&#x4ED6;&#x4EEC;&#x6700;&#x5927;&#x7684;&#x8D22;&#x5BCC;&#x2013;&#x6240;&#x53D7;&#x7684;&#x6559;&#x80B2;&#x3002;&#x5982;&#x679C;&#x4EBA;&#x4EEC;&#x80FD;&#x7075;&#x6D3B;&#x4E00;&#x70B9;&#xFF0C;&#x4FDD;&#x6301;&#x5F00;&#x653E;&#x7684;&#x5934;&#x8111;&#x4E0D;&#x65AD;&#x5B66;&#x4E60;&#x3002;&#x4ED6;&#x4EEC;&#x5C06;&#x5728;&#x65F6;&#x4EE3;&#x7684;&#x53D8;&#x5316;&#x4E2D;&#x4E00;&#x5929;&#x5929;&#x5730;&#x5BCC;&#x6709;&#x8D77;&#x6765;&#x3002;&#x53EA;&#x6709;&#x77E5;&#x8BC6;&#x624D;&#x80FD;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x5E76;&#x521B;&#x9020;&#x8D22;&#x5BCC;&#xFF0C;&#x90A3;&#x4E9B;&#x4E0D;&#x662F;&#x901A;&#x8FC7;&#x8D22;&#x52A1;&#x77E5;&#x8BC6;&#x6323;&#x6765;&#x7684;&#x94B1;&#x4E5F;&#x4E0D;&#x4F1A;&#x957F;&#x4E45;&#x3002;</p>
</blockquote>
<p>&#x5F88;&#x591A;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x7684;&#x4E0D;&#x5BCC;&#x88D5;&#x5176;&#x5B9E;&#x662F;&#x6211;&#x4EEC;&#x77E5;&#x8BC6;&#x7684;&#x7F3A;&#x4E4F;&#xFF0C;&#x6709;&#x4E86;&#x6838;&#x5FC3;&#x7684;&#x80FD;&#x529B;&#x4E0D;&#x4F1A;&#x7F3A;&#x4E4F;&#x94B1;&#x8D22;&#x3002;&#x540C;&#x6837;&#x6709;&#x4E86;&#x5BF9;&#x4E8E;&#x91D1;&#x94B1;&#x8FD0;&#x4F5C;&#x6709;&#x6548;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x4E0D;&#x4F1A;&#x5BB3;&#x6015;&#x94B1;&#x8D22;&#x7684;&#x4E22;&#x5931;&#x3002;&#x4E0D;&#x65AD;&#x7684;&#x5B66;&#x4E60;&#x624D;&#x662F;&#x4EBA;&#x7684;&#x6838;&#x5FC3;&#x7ADE;&#x4E89;&#x529B;&#x3002;</p>
<blockquote>
<p>&#x9700;&#x8981;&#x533A;&#x522B;&#x4EC0;&#x4E48;&#x662F;&#x300C;&#x8D44;&#x4EA7;&#x300D;&#x4EC0;&#x4E48;&#x662F;&#x300C;&#x8D1F;&#x503A;&#x300D;</p>
</blockquote>
<ol>
<li>&#x8D44;&#x4EA7;&#x662F;&#x53EF;&#x4EE5;&#x7ED9;&#x6211;&#x4EEC;&#x5E26;&#x6765;&#x6536;&#x5165;&#x7684;&#x4E1C;&#x897F;&#x3002;</li>
<li>&#x800C;&#x8D1F;&#x503A;&#x662F;&#x5C06;&#x94B1;&#x4ECE;&#x6211;&#x4EEC;&#x53E3;&#x888B;&#x62FF;&#x8D70;&#x7684;&#x4E1C;&#x897F;&#x3002;</li>
</ol>
<p>&#x5F88;&#x591A;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x90FD;&#x4F1A;&#x9519;&#x8BEF;&#x7684;&#x8BA4;&#x4E3A;&#xFF0C;&#x6211;&#x4EEC;&#x6536;&#x5165;&#x8D8A;&#x9AD8;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x8D8A;&#x5BCC;&#x6709;&#x3002;&#x5176;&#x5B9E;&#x8FD9;&#x4E2A;&#x8BBA;&#x9898;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4F1A;&#x6323;&#x94B1;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x4F1A;&#x300C;&#x82B1;&#x94B1;&#x300D;&#x3002;</p>
<p>&#x82B1;&#x94B1;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x5C06;&#x94B1;&#x7528;&#x5728;&#x7528;&#x4E86;&#x5C31;&#x4E0D;&#x503C;&#x94B1;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x800C;&#x662F;&#x8981;&#x5C06;&#x94B1;&#x53D8;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x300C;&#x8D44;&#x4EA7;&#x300D;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x6709;&#x6548;&#x4EA7;&#x751F;&#x6536;&#x76CA;&#x7684;&#x5730;&#x65B9;&#x3002;&#x4E0D;&#x7136;&#x589E;&#x52A0;&#x7684;&#x6536;&#x5165;&#xFF0C;&#x53EA;&#x662F;&#x8BA9;&#x6211;&#x4EEC;<strong>&#x63D0;&#x9AD8;&#x4E86;&#x6D88;&#x8D39;&#x6C34;&#x5E73;</strong>&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x8BA9;&#x6211;&#x4EEC;&#x53D8;&#x5F97;&#x5BCC;&#x6709;&#xFF08;&#x8D44;&#x4EA7;&#x7684;&#x5BCC;&#x6709;&#x624D;&#x662F;&#x771F;&#x7684;&#x5BCC;&#x6709;&#xFF09;</p>
<blockquote>
<p>&#x65E5;&#x672C;&#x4EBA;&#x6CE8;&#x91CD;3&#x4E2D;&#x529B;&#x91CF;&#xFF1A;&#x5251;&#xFF0C;&#x5B9D;&#x77F3;&#xFF0C;&#x955C;&#x5B50;&#x3002;&#x5251;&#x4EE3;&#x8868;&#x7740;&#x6B66;&#x5668;&#xFF0C;&#x5C31;&#x662F;&#x529B;&#x91CF;&#x3002;&#x5B9D;&#x77F3;&#x4EE3;&#x8868;&#x4E2D;&#x9EC4;&#x91D1;&#xFF0C;&#x6709;&#x9EC4;&#x91D1;&#x7684;&#x5236;&#x5B9A;&#x89C4;&#x5219;&#x3002;&#x955C;&#x5B50;&#x4EE3;&#x8868;&#x81EA;&#x7701;&#xFF0C;&#x5C31;&#x662F;&#x81EA;&#x77E5;&#x7684;&#x529B;&#x91CF;&#x3002;</p>
</blockquote>
<p>&#x6211;&#x4EEC;&#x6BCF;&#x5929;&#x90FD;&#x9700;&#x8981;&#x95EE;&#x81EA;&#x5DF1;&#xFF0C;&#x4ECA;&#x5929;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x6709;&#x610F;&#x4E49;&#x561B;&#x3002;</p>
<blockquote>
<p>&#x5BCC;&#x7238;&#x7238;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x968F;&#x5927;&#x6D41;&#x7684;&#x4EBA;&#xFF0C;&#x4ED6;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x60F3;&#x6CD5;&#x3002;&#x4ED6;&#x75DB;&#x6068;&#x300C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x56E0;&#x4E3A;&#x5176;&#x4ED6;&#x4EBA;&#x8FD9;&#x4E48;&#x505A;&#x300D;&#x7684;&#x8BDD;&#xFF0C;&#x4E5F;&#x8BA8;&#x538C;&#x300C;&#x4E0D;&#x80FD;&#x300D;&#x8FD9;&#x4E2A;&#x8BCD;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x5E94;&#x8BE5;&#x5C31;&#x662F;NB&#x7684;&#x4EBA;&#x7684;&#x4FE1;&#x4EF0;&#xFF0C;&#x4E0D;&#x968F;&#x5927;&#x6D41;&#xFF0C;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x8003;&#x548C;&#x60F3;&#x6CD5;&#xFF0C;&#x7528;&#x601D;&#x8003;&#x4EE3;&#x66FF;&#x611F;&#x60C5;&#x3002;&#x800C;&#x4E14;&#x4ED6;&#x4EEC;&#x4E0D;&#x6015;&#x56F0;&#x96BE;&#xFF0C;&#x603B;&#x662F;&#x60F3;&#x7740;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x56F0;&#x96BE;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x754F;&#x60E7;&#x56F0;&#x96BE;&#x3002;</p>
<blockquote>
<p>&#x5BCC;&#x7238;&#x7238;&#x7684;&#x89C2;&#x70B9;&#x662F;&#x4E0D;&#x8981;&#x65E9;&#x65E9;&#x4E70;&#x623F;&#x5B50;&#x3002;</p>
</blockquote>
<p>&#x56E0;&#x4E3A;&#x4E70;&#x623F;&#x5B50;&#x662F;&#x4E00;&#x79CD;&#x300C;&#x8D1F;&#x503A;&#x300D;&#x800C;&#x4E0D;&#x662F;&#x300C;&#x8D44;&#x4EA7;&#x300D;&#x3002;&#x65E9;&#x4E70;&#x623F;&#x6709;&#x51E0;&#x4E2A;&#x5371;&#x5BB3;&#xFF1A;</p>
<ol>
<li>
<p>&#x6700;&#x5927;&#x7684;&#x635F;&#x5931;&#x662F;<strong>&#x81F4;&#x5BCC;&#x673A;&#x4F1A;&#x7684;&#x635F;&#x5931;</strong>&#x3002;&#x5982;&#x679C;&#x4F60;&#x5C06;&#x6240;&#x6709;&#x94B1;&#x90FD;&#x6295;&#x5728;&#x623F;&#x5B50;&#x4E0A;&#xFF0C;&#x4F60;&#x5C31;&#x4E0D;&#x5F97;&#x4E0D;&#x52AA;&#x529B;&#x5DE5;&#x4F5C;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x7684;&#x73B0;&#x91D1;&#x4E0D;&#x65AD;&#x5730;&#x4ECE;&#x652F;&#x51FA;&#x9879;&#x6D41;&#x51FA;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6D41;&#x5165;&#x8D44;&#x4EA7;&#x9879;&#x3002;&#x8FD9;&#x6837;&#x5B50;&#x4EBA;&#x5728;&#x5E74;&#x8F7B;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x5931;&#x53BB;&#x4E86;&#x300C;&#x6295;&#x8D44;&#x6559;&#x80B2;&#x300D;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x94B1;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x6295;&#x8D44;&#xFF0C;&#x6240;&#x6709;&#x6C38;&#x8FDC;&#x4E5F;&#x4E0D;&#x4F1A;&#x6210;&#x4E3A;&#x300C;&#x6210;&#x719F;&#x7684;&#x6295;&#x8D44;&#x8005;&#x300D;&#xFF0C;&#x800C;&#x6700;&#x597D;&#x7684;&#x6295;&#x8D44;&#x90FD;&#x662F;&#x7ED9;&#x8FD9;&#x4E9B;&#x6709;&#x7ECF;&#x9A8C;&#x7684;&#x4EBA;&#x7684;&#xFF0C;&#x518D;&#x7531;&#x4ED6;&#x4EEC;&#x8F6C;&#x624B;&#x7ED9;&#x4E86;&#x614E;&#x91CD;&#x7684;&#x4EBA;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x8F6C;&#x624B;&#x65F6;&#x5019;&#x5DF2;&#x7ECF;&#x62FF;&#x8D70;&#x4E86;&#x5927;&#x90E8;&#x5206;&#x7684;&#x5229;&#x76CA;&#x3002;</p>
</li>
<li>
<p>&#x94B1;&#x90FD;&#x7528;&#x5728;&#x623F;&#x5B50;&#x4E2D;&#xFF0C;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x53D8;&#x6210;&#x6709;&#x6548;&#x7684;&#x8D44;&#x4EA7;&#x3002;&#x867D;&#x7136;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x8BF4;&#xFF0C;&#x623F;&#x5B50;&#x4E5F;&#x53EF;&#x4EE5;&#x53D8;&#x4E3A;&#x8D44;&#x4EA7;&#xFF0C;&#x6BD4;&#x5982;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x51FA;&#x79DF;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x81EA;&#x5DF1;&#x800C;&#x8A00;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x623F;&#x5B50;&#x80AF;&#x5B9A;&#x662F;&#x81EA;&#x5DF1;&#x4F4F;&#xFF0C;&#x53EA;&#x6709;&#x5230;&#x4E86;&#x7B2C;&#x4E8C;&#x4E2A;&#x623F;&#x5B50;&#x7684;&#x65F6;&#x5019;&#x624D;&#x8003;&#x8651;&#x662F;&#x4E0D;&#x662F;&#x5E94;&#x8BE5;&#x51FA;&#x79DF;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x4F60;&#x5C31;&#x5DF2;&#x7ECF;&#x5F88;&#x5927;&#x4E86;&#xFF0C;&#x4E5F;&#x5C31;&#x4E22;&#x5931;&#x4E86;&#x300C;&#x5E74;&#x8F7B;&#x65F6;&#x5019;&#x5EFA;&#x7ACB;&#x8D44;&#x4EA7;&#x300D;&#x7684;&#x673A;&#x4F1A;&#x3002;</p>
</li>
<li>
<p>&#x6CA1;&#x6709;&#x597D;&#x7684;&#x73B0;&#x91D1;&#x6D41;&#x3002;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x8D44;&#x4EA7;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x53EA;&#x80FD;&#x5DE5;&#x4F5C;&#xFF0C;&#x5DE5;&#x4F5C;&#xFF0C;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x5F97;&#x5230;&#x66F4;&#x591A;&#x7684;&#x8D44;&#x4EA7;&#xFF0C;&#x4ECE;&#x800C;&#x81EA;&#x5DF1;&#x7684;&#x6297;&#x98CE;&#x9669;&#x80FD;&#x529B;&#x548C;&#x538B;&#x529B;&#x90FD;&#x5C06;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x5927;&#x3002;</p>
</li>
</ol>
<p>&#x867D;&#x7136;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x8BF4;&#xFF0C;&#x623F;&#x5B50;&#x662F;&#x53EF;&#x4EE5;&#x8F6C;&#x624B;&#x4E70;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x5B50;&#x5C31;&#x662F;&#x589E;&#x52A0;&#x4E86;&#x6536;&#x5165;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x4F60;&#x53EF;&#x4EE5;&#x4E70;&#x4E0B;&#x7684;&#x65F6;&#x5019;&#x518D;&#x5356;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53C8;&#x4E0D;&#x77E5;&#x8FC7;&#x4E86;&#x591A;&#x5C11;&#x5E74;&#xFF0C;&#x6C89;&#x9ED8;&#x8D44;&#x672C;&#x4E5F;&#x662F;&#x9700;&#x8981;&#x8003;&#x8651;&#x7684;&#x3002;&#x4F55;&#x51B5;&#x623F;&#x5B50;&#x4E5F;&#x4E0D;&#x4E00;&#x5B9A;&#x5C31;&#x4E00;&#x5B9A;&#x662F;&#x6323;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x7EFC;&#x5408;&#x6765;&#x770B;&#xFF0C;&#x623F;&#x5B50;&#x5E94;&#x8BE5;&#x8FD8;&#x662F;&#x300C;&#x8D1F;&#x503A;&#x300D;&#x7684;&#x5C5E;&#x6027;&#x9AD8;&#x4E9B;&#x3002;</p>
<p>&#x6211;&#x4E5F;&#x540C;&#x610F;&#x672C;&#x4E66;&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x81F3;&#x5C11;&#x5728;&#x81EA;&#x5DF1;&#x6CA1;&#x6709;&#x5F88;&#x591A;&#x8D44;&#x4EA7;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E0D;&#x8981;&#x65E9;&#x65E9;&#x7684;&#x4E70;&#x623F;&#xFF0C;&#x4E0D;&#x7136;&#x4F60;&#x6240;&#x6709;&#x7684;&#x6536;&#x5165;&#x90FD;&#x662F;&#x5728;&#x4E0D;&#x505C;&#x7684;&#x8FD8;&#x503A;&#xFF0C;&#x5373;&#x4F7F;&#x8FD8;&#x5230;&#x6700;&#x540E;&#xFF0C;&#x8FD8;&#x6E05;&#x4E86;&#xFF0C;&#x4E5F;&#x4E0D;&#x4E00;&#x5B9A;&#x5C31;&#x662F;&#x8D5A;&#x7684;&#x5C40;&#x9762;&#x3002;&#x90A3;&#x4F60;&#x7684;&#x6240;&#x6709;&#x94B1;&#x8D22;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x623F;&#x5B50;&#xFF0C;&#x7B49;&#x4E8E;&#x4F60;&#x4ED8;&#x51FA;&#x7684;&#x6240;&#x6709;&#x6295;&#x8D44;&#xFF0C;&#x6CA1;&#x6709;&#x4EA7;&#x751F;&#x989D;&#x5916;&#x7684;&#x4EF7;&#x503C;&#x3002;&#x800C;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x81EA;&#x5DF1;&#x6323;&#x7684;&#x94B1;&#xFF0C;&#x8981;&#x53D8;&#x6210;&#x8D44;&#x4EA7;&#xFF0C;&#x4EA7;&#x751F;&#x6BD4;&#x81EA;&#x5DF1;&#x6323;&#x5F97;&#x94B1;&#x8FD8;&#x8981;&#x591A;&#x7684;&#x8D22;&#x5BCC;&#x624D;&#x662F;&#x3002;</p>
<p>&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x5E94;&#x8BE5;&#x662F;&#xFF0C;&#x4F18;&#x5148;&#x5EFA;&#x7ACB;&#x81EA;&#x5DF1;&#x7684;&#x8D44;&#x4EA7;&#xFF0C;&#x4FDD;&#x8BC1;&#x8FD9;&#x4E9B;&#x8D44;&#x4EA7;&#x7684;&#x53EF;&#x7528;&#x73B0;&#x91D1;&#x6D41;&#x548C;&#x6536;&#x5165;&#xFF0C;&#x4E4B;&#x540E;&#x624D;&#x8003;&#x8651;&#x4E70;&#x623F;&#x5B50;&#x3002;&#x5148;&#x6295;&#x8D44;&#x81EA;&#x5DF1;&#xFF0C;&#x7B49;&#x4EE5;&#x540E;&#x81EA;&#x5DF1;&#x80FD;&#x529B;&#x548C;&#x8D44;&#x4EA7;&#x90FD;&#x589E;&#x52A0;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E70;&#x623F;&#x5B50;&#x7684;&#x8D37;&#x6B3E;&#x5C31;&#x662F;&#x975E;&#x5E38;&#x5C0F;&#x610F;&#x601D;&#x7684;&#x4E8B;&#x60C5;&#x4E86;&#xFF0C;&#x4F60;&#x6BCF;&#x6708;&#x591A;&#x4F59;&#x7684;&#x94B1;&#xFF08;&#x5982;&#x679C;&#x65E9;&#x65E9;&#x4E70;&#x53EF;&#x80FD;&#x5C31;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x591A;&#x4F59;&#x7684;&#x94B1;&#x4E86;&#xFF09;&#x8FD8;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x6295;&#x8D44;&#x4F4D;&#x8D44;&#x4EA7;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x7684;&#x6BCF;&#x4E2A;&#x6708;&#x7684;&#x6536;&#x5165;&#x8FD8;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x800C;&#x652F;&#x51FA;&#x76F8;&#x5BF9;&#x56FA;&#x5B9A;&#xFF0C;&#x8FD9;&#x6837;&#x5B50;&#x624D;&#x662F;&#x300C;&#x8D8A;&#x6765;&#x8D8A;&#x6709;&#x94B1;&#x300D;&#x7684;&#x89E3;&#x51B3;&#x4E4B;&#x9053;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x5BCC;&#x4EBA;&#x7684;&#x601D;&#x7EF4;&#x5C31;&#x662F;&#x300C;&#x6295;&#x8D44;&#x8D44;&#x4EA7;&#x300D;&#x800C;&#x4E0D;&#x662F;&#x300C;&#x8D1F;&#x503A;&#x300D;&#xFF0C;&#x4E0D;&#x505C;&#x7684;&#x52A0;&#x5165;&#x8D44;&#x4EA7;&#xFF0C;&#x81EA;&#x5DF1;&#x5C31;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x6709;&#x94B1;&#x3002;</p>
<p>&#x5173;&#x4E8E;&#x623F;&#x5B50;&#x7684;&#x770B;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x4E66;&#x4E2D; P88-P99 &#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x751A;&#x662F;&#x53D7;&#x6559;&#x3002;</p>
<blockquote>
<p>&#x6211;&#x5BF9;&#x4F1A;&#x8BA1;&#x548C;&#x73B0;&#x91D1;&#x7BA1;&#x7406;&#x61C2;&#x7684;&#x8D8A;&#x591A;&#xFF0C;&#x6211;&#x5C31;&#x8D8A;&#x80FD;&#x66F4;&#x597D;&#x5730;&#x8FDB;&#x884C;&#x6295;&#x8D44;&#x5206;&#x6790;&#x5E76;&#x5F00;&#x59CB;&#x5EFA;&#x7ACB;&#x81EA;&#x5DF1;&#x7684;&#x516C;&#x53F8;&#x3002;</p>
</blockquote>
<p>&#x6240;&#x4EE5;&#x8FD9;&#x4E24;&#x4E2A;&#x77E5;&#x8BC6;&#x9762;&#x975E;&#x5E38;&#x7684;&#x91CD;&#x8981;&#xFF1A;&#x4F1A;&#x8BA1;&#x548C;&#x73B0;&#x91D1;&#x7BA1;&#x7406;&#x3002;</p>
<blockquote>
<p><strong>&#x8FC7;&#x5206;&#x7684;&#x5BB3;&#x6015;&#x548C;&#x81EA;&#x6211;&#x6000;&#x7591;</strong>&#x662F;&#x6BC1;&#x6389;&#x6211;&#x4EEC;&#x624D;&#x80FD;&#x7684;&#x6700;&#x5927;&#x8981;&#x7D20;&#x3002;&#x5728;&#x73B0;&#x5B9E;&#x751F;&#x6D3B;&#x4E2D;&#xFF0C;&#x4EBA;&#x4EEC;&#x5F80;&#x5F80;&#x662F;<strong>&#x4F9D;&#x9760;&#x52C7;&#x6C14;&#x800C;&#x4E0D;&#x662F;&#x667A;&#x6167;</strong>&#x53BB;&#x53D6;&#x7684;&#x9886;&#x5148;&#x7684;&#x4F4D;&#x7F6E;&#x7684;&#x3002;</p>
</blockquote>
<p>&#x592A;&#x5BF9;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x603B;&#x662F;&#x4F1A;&#x663E;&#x5F97;&#x4E0D;&#x90A3;&#x4E48;&#x300C;&#x81EA;&#x4FE1;&#x300D;&#xFF0C;&#x603B;&#x662F;&#x53BB;&#x5BB3;&#x6015;&#x300C;&#x5931;&#x53BB;&#x300D;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x53BB;&#x5C1D;&#x8BD5;&#x4F60;&#x600E;&#x4E48;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x53EF;&#x4EE5;&#x4E0D;&#x53EF;&#x4EE5;&#x5462;&#xFF1F;&#x52C7;&#x6C14;&#x6709;&#x65F6;&#x5019;&#x6BD4;&#x667A;&#x6167;&#x6765;&#x7684;&#x66F4;&#x52A0;&#x7684;&#x91CD;&#x8981;&#x3002;</p>
<blockquote>
<p>&#x63D0;&#x9AD8;&#x8D22;&#x5546;&#x6709;&#x56DB;&#x4E2A;&#x56E0;&#x7D20;&#xFF1A;</p>
</blockquote>
<ol>
<li>&#x4F1A;&#x8BA1;&#x77E5;&#x8BC6;&#x3002;</li>
<li>&#x6295;&#x8D44;&#x77E5;&#x8BC6;&#x3002;</li>
<li>&#x4E86;&#x89E3;&#x5E02;&#x573A;&#x3002;</li>
<li>&#x4E86;&#x89E3;&#x6CD5;&#x5F8B;&#x3002;&#xFF08;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x7684;&#x907F;&#x7A0E;&#x5E76;&#x4E86;&#x89E3;&#x653F;&#x7B56;&#xFF09;</li>
</ol>
<blockquote>
<p>&#x4F60;&#x7684;&#x8D22;&#x5546;&#x8D8A;&#x9AD8;&#xFF0C;&#x4F60;&#x5C31;&#x8D8A;&#x5BB9;&#x6613;&#x5206;&#x6E05;&#x695A;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x662F;&#x597D;&#x662F;&#x574F;&#x3002;&#x771F;&#x6B63;&#x7099;&#x624B;&#x53EF;&#x70ED;&#x7684;&#x4EA4;&#x6613;&#x4E0D;&#x4F1A;&#x7559;&#x7ED9;&#x65B0;&#x624B;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x80FD;&#x4F7F;&#x5BCC;&#x8005;&#x66F4;&#x5BCC;&#x7684;&#x6700;&#x597D;&#x7684;&#x4EA4;&#x6613;&#x603B;&#x662F;&#x4E3A;&#x90A3;&#x4E9B;<strong>&#x7CBE;&#x901A;&#x6E38;&#x620F;&#x89C4;&#x5219;</strong>&#x7684;&#x4EBA;&#x51C6;&#x5907;&#x7684;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x5C31;&#x662F;&#x4E16;&#x754C;&#x7684;&#x300C;&#x6CD5;&#x5219;&#x300D;&#xFF0C;&#x4F60;&#x8D8A;&#x6709;&#x77E5;&#x8BC6;&#xFF0C;&#x4F60;&#x5C31;&#x8D8A;&#x80FD;&#x6323;&#x94B1;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x5BCC;&#x6709;&#x3002;&#x8D22;&#x5546;&#x4E5F;&#x662F;&#x4EBA;&#x7684;&#x91CD;&#x8981;&#x80FD;&#x529B;&#x4E4B;&#x4E00;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
<blockquote>
<p>&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x4ECE;&#x6765;&#x8D62;&#x4E0D;&#x4E86;&#x662F;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x592A;&#x5BB3;&#x6015;&#x5931;&#x53BB;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x6211;&#x53D1;&#x73B0;&#x7684;&#x5B66;&#x6821;&#x6559;&#x80B2;&#x7684;&#x4E00;&#x5927;&#x8BEF;&#x533A;&#x3002;<strong>&#x80DC;&#x5229;&#x8005;&#x4E0D;&#x5BB3;&#x6015;&#x5931;&#x8D25;&#xFF0C;&#x4F46;&#x5931;&#x8D25;&#x8005;&#x5BB3;&#x6015;&#x5931;&#x8D25;</strong>&#x3002;&#x5931;&#x8D25;&#x662F;&#x6210;&#x529F;&#x8FC7;&#x7A0B;&#x7684;&#x4E00;&#x4E2A;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x5982;&#x679C;&#x907F;&#x5F00;&#x5931;&#x8D25;&#xFF0C;&#x4E5F;&#x5C31;&#x4E0D;&#x4F1A;&#x6210;&#x529F;&#x3002;</p>
</blockquote>
<p>&#x592A;&#x5BF9;&#x4E86;&#x3002;&#x548C;&#x524D;&#x9762;&#x5BF9;&#x4E8E;NB&#x4EBA;&#x5206;&#x6790;&#x7684;&#x4E00;&#x6837;&#xFF0C;&#x4E0D;&#x8981;&#x5BB3;&#x6015;&#x5931;&#x8D25;&#xFF0C;&#x5931;&#x8D25;&#x662F;&#x6210;&#x529F;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x4F60;&#x4E0D;&#x53EF;&#x80FD;&#x4E0A;&#x6765;&#x4EC0;&#x4E48;&#x90FD;&#x4F1A;&#x7684;&#xFF0C;&#x603B;&#x662F;&#x8981;&#x4EA4;&#x5B66;&#x8D39;&#x7684;&#xFF0C;&#x4F60;&#x8D8A;&#x65E9;&#x7684;&#x4EA4;&#x4E86;&#x5B66;&#x8D39;&#xFF0C;&#x5C31;&#x6BD4;&#x522B;&#x4EBA;&#x8D8A;&#x65E9;&#x7684;&#x5F97;&#x5230;&#x6210;&#x529F;&#x3002;</p>
<blockquote>
<p>&#x300C;&#x8BB8;&#x591A;&#x77E5;&#x8BC6;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x77E5;&#x9053;&#x4E00;&#x70B9;&#x5C31;&#x591F;&#x4E86;&#x3002;&#x300D;&#x5BF9;&#x4E8E;&#x53D7;&#x8FC7;&#x826F;&#x597D;&#x6559;&#x80B2;&#x7684;&#x7238;&#x7238;&#x6765;&#x8BF4;&#xFF0C;&#x5DE5;&#x4F5C;&#x7684;&#x7A33;&#x5B9A;&#x5C31;&#x662F;&#x4E00;&#x5207;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;&#x5BCC;&#x7238;&#x7238;&#x6765;&#x8BF4;&#xFF0C;<strong>&#x4E0D;&#x65AD;&#x5B66;&#x4E60;&#x624D;&#x662F;&#x4E00;&#x5207;</strong>&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x7ECF;&#x8425;&#x4E00;&#x4EF6;&#x516C;&#x53F8;&#x6700;&#x56F0;&#x96BE;&#x7684;&#x5C31;&#x662F;&#x5BF9;&#x4EBA;&#x5458;&#x7684;&#x7BA1;&#x7406;&#x3002;&#x9886;&#x5BFC;&#x624D;&#x80FD;&#x624D;&#x662F;&#x4F60;&#x4E0B;&#x4E00;&#x6B65;&#x8FEB;&#x5207;&#x9700;&#x8981;&#x5B66;&#x4E60;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x4F18;&#x79C0;&#x7684;&#x9886;&#x5BFC;&#x8005;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x88AB;&#x80CC;&#x540E;&#x7684;&#x51B7;&#x7BAD;&#x5C04;&#x4E2D;&#xFF0C;&#x5C31;&#x50CF;&#x4ED6;&#x4EEC;&#x5728;&#x5546;&#x4E1A;&#x6D3B;&#x52A8;&#x4E2D;&#x505A;&#x7684;&#x90A3;&#x6837;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x76F8;&#x53CD;&#x6211;&#x529D;&#x544A;&#x5E74;&#x8F7B;&#x4EBA;&#x5728;&#x627E;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#x8981;&#x770B;&#x4ECE;&#x4E2D;&#x53EF;&#x4EE5;&#x5B66;&#x5230;&#x4EC0;&#x4E48;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x53EA;&#x770B;&#x80FD;&#x6323;&#x591A;&#x5C11;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x5E38;&#x5E38;&#x60F3;&#x4E00;&#x60F3;&#xFF1A;&#x300C;&#x4F60;&#x7EC8;&#x65E5;&#x5FD9;&#x788C;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x300D;</p>
</blockquote>
<blockquote>
<p>&#x5982;&#x679C;&#x60F3;&#x5B66;&#x4E60;&#x9500;&#x552E;&#x6280;&#x80FD;&#xFF0C;&#x6700;&#x597D;&#x8FDB;&#x4E00;&#x5BB6;&#x7F51;&#x7EDC;&#x8425;&#x9500;&#x516C;&#x53F8;&#xFF0C;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x591A;&#x7EA7;&#x8425;&#x9500;&#x516C;&#x53F8;&#x3002;&#x8FD9;&#x7C7B;&#x516C;&#x53F8;&#x591A;&#x534A;&#x80FD;&#x63D0;&#x4F9B;&#x826F;&#x597D;&#x7684;&#x57F9;&#x8BAD;&#x9879;&#x76EE;&#xFF0C;&#x5E2E;&#x52A9;&#x4EBA;&#x4EEC;&#x514B;&#x670D;&#x56E0;&#x300C;<strong>&#x5931;&#x8D25;&#x9020;&#x6210;&#x7684;&#x6CAE;&#x4E27;&#x548C;&#x6050;&#x60E7;&#x5FC3;&#x7406;</strong>&#x300D;&#xFF0C;&#x8FD9;&#x79CD;&#x5FC3;&#x7406;&#x5F80;&#x5F80;&#x662F;&#x5BFC;&#x81F4;&#x4EBA;&#x4EEC;&#x4E0D;&#x6210;&#x529F;&#x7684;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x3002;&#x4ECE;&#x957F;&#x8FDC;&#x6765;&#x770B;&#xFF0C;&#x6559;&#x80B2;&#x6BD4;&#x91D1;&#x94B1;&#x66F4;&#x52A0;&#x91CD;&#x8981;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x8BB8;&#x591A;&#x624D;&#x534E;&#x6A2A;&#x6EA2;&#x7684;&#x4EBA;&#x4E4B;&#x6240;&#x4EE5;&#x8D2B;&#x7A77;&#xFF0C;&#x5C31;&#x662F;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x53EA;&#x662F;&#x4E13;&#x5FC3;&#x4E8E;&#x505A;&#x597D;&#x4EA7;&#x54C1;&#xFF0C;&#x800C;&#x5BF9;&#x5546;&#x4E1A;&#x4F53;&#x7CFB;&#x5374;&#x77E5;&#x4E4B;&#x751A;&#x5C11;&#x3002;&#x4ED6;&#x4EEC;&#x53EA;&#x662F;&#x5C06;&#x6CE8;&#x610F;&#x529B;&#x96C6;&#x4E2D;&#x5728;&#x63D0;&#x9AD8;&#x505A;&#x6C49;&#x5821;&#x5305;&#x7684;&#x6280;&#x80FD;&#x4E0A;&#xFF0C;&#x5374;&#x4E0D;&#x6CE8;&#x610F;<strong>&#x63D0;&#x9AD8;&#x9500;&#x552E;&#x548C;&#x914D;&#x9001;&#x6C49;&#x5821;&#x5305;&#x7684;&#x6280;&#x80FD;</strong>&#xFF0C;&#x4E5F;&#x8BB8;&#x9EA6;&#x5F53;&#x52B3;&#x4E0D;&#x80FD;&#x505A;&#x51FA;&#x6700;&#x597D;&#x7684;&#x6C49;&#x5821;&#x5305;&#xFF0C;&#x4F46;&#x4ED6;&#x4EEC;&#x80FD;&#x5728;&#x505A;&#x51FA;&#x4E00;&#x822C;&#x6C34;&#x5E73;&#x7684;&#x6C49;&#x5821;&#x5305;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x505A;&#x5230;&#x6700;&#x597D;&#x7684;&#x9500;&#x552E;&#x548C;&#x914D;&#x9001;&#x5DE5;&#x4F5C;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x6700;&#x91CD;&#x8981;&#x7684;&#x6280;&#x80FD;&#x662F;&#x9500;&#x552E;&#x548C;&#x5BF9;&#x5E02;&#x573A;&#x8425;&#x9500;&#x7684;&#x7406;&#x89E3;&#x3002;&#x9500;&#x552E;&#x6280;&#x80FD;&#x662F;&#x4E2A;&#x4EBA;&#x6210;&#x529F;&#x7684;&#x57FA;&#x672C;&#x529F;&#x80FD;&#x3002;&#x6C9F;&#x901A;&#x80FD;&#x529B;&#xFF0C;&#x53E3;&#x5934;&#x8868;&#x8FBE;&#x80FD;&#x529B;&#x4EE5;&#x53CA;&#x8C08;&#x5224;&#x80FD;&#x529B;&#x5BF9;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x6210;&#x529F;&#x6765;&#x8BF4;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;&#x9500;&#x552E;&#x6280;&#x80FD;&#x638C;&#x63E1;&#x7684;&#x8D8A;&#x591A;&#xFF0C;&#x4F60;&#x5728;&#x5904;&#x7406;&#x4EBA;&#x9645;&#x5173;&#x7CFB;&#xFF0C;&#x5546;&#x52A1;&#x8C08;&#x5224;&#x548C;&#x88AB;&#x62D2;&#x7EDD;&#x65F6;&#x7684;&#x6050;&#x6016;&#x5FC3;&#x7406;&#x7B49;&#x65B9;&#x9762;&#x5C31;&#x4F1A;&#x505A;&#x7684;&#x8D8A;&#x597D;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x662F;&#x4E66;&#x4E2D;&#x7B2C;&#x4E03;&#x7AE0;&#x300C;&#x4E0D;&#x4E3A;&#x94B1;&#x5DE5;&#x4F5C;&#x300D;&#x7684;&#x7AE0;&#x8282;&#x603B;&#x7ED3;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x5199;&#x7684;&#x975E;&#x5E38;&#x7684;&#x597D;&#x3002;</p>
<p>&#x8FC7;&#x53BB;&#x7684;&#x6559;&#x80B2;&#x90FD;&#x5E0C;&#x671B;&#x6211;&#x4EEC;&#x662F;&#x4E00;&#x4E2A;&#x300C;&#x4E13;&#x624D;&#x300D;&#xFF0C;&#x8FD9;&#x4E2A;&#x662F;&#x5BF9;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5230;&#x4E86;&#x4E00;&#x5B9A;&#x4E13;&#x7684;&#x5730;&#x6B65;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x53BB;&#x63D0;&#x9AD8;&#x5E7F;&#x5EA6;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x5473;&#x7684;&#x4E13;&#x4E0B;&#x53BB;&#x3002;&#x6BD5;&#x7ADF;&#x4E16;&#x754C;&#x662F;&#x5706;&#x7684;&#xFF0C;&#x4E0D;&#x662F;&#x5403;&#x901A;&#x4E00;&#x4E2A;&#x6280;&#x80FD;&#x5C31;&#x53EF;&#x4EE5;&#x8D70;&#x5929;&#x4E0B;&#x7684;&#x3002;</p>
<p>&#x4F5C;&#x8005;&#x5C24;&#x5176;&#x63A8;&#x8350;&#x53BB;&#x5B66;&#x4E60;&#x5546;&#x4E1A;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x9500;&#x552E;&#x548C;&#x5E02;&#x573A;&#x7684;&#x77E5;&#x8BC6;&#x3002;&#x6211;&#x4E2A;&#x4EBA;&#x4E5F;&#x975E;&#x5E38;&#x8D5E;&#x540C;&#x3002;&#x6BD5;&#x7ADF;&#x6240;&#x6709;&#x7684;&#x4E8B;&#x60C5;&#x505A;&#x5230;&#x6700;&#x540E;&#x90FD;&#x662F;&#x4EBA;&#x4E8B;&#x3002;&#x800C;&#x4E14;&#x5B66;&#x4E60;&#x9500;&#x552E;&#x7684;&#x77E5;&#x8BC6;&#x8FD8;&#x4F1A;&#x57F9;&#x517B;&#x4E2A;&#x4EBA;&#x4E0D;&#x6015;&#x5931;&#x8D25;&#xFF0C;&#x4E0D;&#x6015;&#x300C;&#x5931;&#x8D25;&#x9020;&#x6210;&#x7684;&#x6CAE;&#x4E27;&#x548C;&#x6050;&#x60E7;&#x5FC3;&#x7406;&#x300D;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x800C;&#x4E14;&#x81F3;&#x5C11;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x4F60;&#x7684;&#x4EBA;&#x9645;&#x5173;&#x7CFB;&#xFF0C;&#x6211;&#x60F3;&#x8FD9;&#x786E;&#x5B9E;&#x662F;&#x975E;&#x5E38;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<blockquote>
<p>&#x5931;&#x8D25;&#x4F1A;&#x6FC0;&#x52B1;&#x80DC;&#x5229;&#x8005;&#xFF0C;&#x51FB;&#x57AE;&#x5931;&#x8D25;&#x8005;&#x3002;&#x8FD9;&#x662F;&#x80DC;&#x5229;&#x8005;&#x6700;&#x5927;&#x7684;&#x79D8;&#x5BC6;&#xFF0C;&#x4E5F;&#x662F;&#x5931;&#x8D25;&#x8005;&#x8BF4;&#x4E0D;&#x77E5;&#x9053;&#x7684;&#x79D8;&#x5BC6;&#x3002;&#x80DC;&#x5229;&#x8005;&#x6700;&#x5927;&#x7684;&#x79D8;&#x5BC6;&#x5C31;&#x662F;&#x5931;&#x8D25;&#x80FD;&#x591F;&#x6FC0;&#x52B1;&#x4ED6;&#x4EEC;&#x53D6;&#x80DC;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x4EEC;&#x4E0D;&#x6015;&#x5931;&#x8D25;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x91CD;&#x590D;&#x4E00;&#x904D;&#x5F17;&#x6717;&#x5854;&#x80AF;&#x987F;&#x7684;&#x540D;&#x8A00;&#x300E;&#x80DC;&#x5229;&#x610F;&#x5473;&#x7740;&#x4E0D;&#x5BB3;&#x6015;&#x5931;&#x8D25;&#x300F;</p>
</blockquote>
<p>&#x505A;&#x4EBA;&#x8981;&#x6D3B;&#x7684;&#x300C;&#x5927;&#x6C14;&#x300D;&#xFF0C;&#x4E0D;&#x5BB3;&#x6015;&#x5931;&#x8D25;&#xFF0C;&#x5E76;&#x4E14;&#x6562;&#x4E8E;&#x9762;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x5931;&#x8D25;&#xFF0C;&#x5E76;&#x63A5;&#x6536;&#xFF0C;&#x8BA9;&#x5176;&#x6210;&#x4E3A;&#x6FC0;&#x52B1;&#x81EA;&#x5DF1;&#x7684;&#x52A8;&#x529B;&#x3002;</p>
<blockquote>
<p>&#x6124;&#x4E16;&#x8005;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x6210;&#x529F;&#x3002;&#x300C;&#x672A;&#x7ECF;&#x8BC1;&#x5B9E;&#x300D;&#x7684;&#x300C;&#x6000;&#x7591;&#x548C;&#x6050;&#x60E7;&#x300D;&#x4F1A;&#x4F7F;&#x4EBA;&#x4EEC;&#x6210;&#x4E3A;&#x6124;&#x4E16;&#x5AC9;&#x4FD7;&#x8005;&#x3002;&#x6124;&#x4E16;&#x8005;&#x62B1;&#x6028;&#x73B0;&#x5B9E;&#xFF0C;&#x800C;&#x6210;&#x529F;&#x8005;&#x5206;&#x6790;&#x73B0;&#x5B9E;&#x3002;</p>
</blockquote>
<p>&#x786E;&#x5B9E;&#x5982;&#x6B64;&#xFF0C;&#x4EBA;&#x8981;&#x6D3B;&#x7684;&#x300C;&#x5927;&#x6C14;&#x300D;&#xFF0C;&#x8981;&#x6D3B;&#x7684;&#x300C;&#x7406;&#x6027;&#x300D;&#x3002;&#x6210;&#x529F;&#x8005;&#x51B7;&#x9759;&#x7684;&#x5206;&#x6790;&#x73B0;&#x5B9E;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6124;&#x4E16;&#x5AC9;&#x4FD7;&#xFF0C;&#x6216;&#x8005;&#x62B1;&#x6028;&#x3002;</p>
<blockquote>
<p>&#x5728;&#x8D22;&#x5BCC;&#x7684;&#x79EF;&#x7D2F;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6700;&#x56F0;&#x96BE;&#x7684;&#x4E8B;&#x60C5;&#x83AB;&#x8FC7;&#x4E8E;&#x575A;&#x6301;&#x81EA;&#x5DF1;&#x7684;&#x9009;&#x62E9;&#x800C;&#x4E0D;&#x76F2;&#x76EE;&#x4ECE;&#x4F17;&#x3002;&#x56E0;&#x4E3A;&#x5728;&#x7ADE;&#x4E89;&#x6FC0;&#x70C8;&#x7684;&#x5E02;&#x573A;&#x4E2D;&#xFF0C;&#x7FA4;&#x4F53;&#x5F80;&#x5F80;&#x4F1A;&#x53CD;&#x5E94;&#x8FDF;&#x949D;&#xFF0C;&#x6210;&#x4E3A;&#x88AB;&#x300C;&#x5BB0;&#x5272;&#x300D;&#x7684;&#x5BF9;&#x8C61;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x80C6;&#x5C0F;&#x7684;&#x6295;&#x8D44;&#x8005;&#x603B;&#x662F;&#x4EA6;&#x6B65;&#x4EA6;&#x8D8B;&#x5730;&#x8DDF;&#x5728;&#x4F17;&#x4EBA;&#x540E;&#x9762;&#xFF0C;&#x5F53;&#x6B32;&#x671B;&#x9A71;&#x4F7F;&#x4ED6;&#x4EEC;&#x7EC8;&#x4E8E;&#x5192;&#x9669;&#x6295;&#x8D44;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7CBE;&#x660E;&#x7684;&#x6295;&#x8D44;&#x8005;&#x65E9;&#x5C31;&#x5DF2;&#x7ECF;&#x83B7;&#x5229;&#x9000;&#x51FA;&#x4E86;&#x3002;&#x660E;&#x667A;&#x7684;&#x6295;&#x8D44;&#x8005;&#x5F80;&#x5F80;&#x4F1A;&#x8D2D;&#x4E70;&#x4E00;&#x9879;&#x4E0D;&#x88AB;&#x5927;&#x4F17;&#x770B;&#x597D;&#x7684;&#x6295;&#x8D44;&#xFF0C;&#x4ED6;&#x4EEC;&#x61C2;&#x5F97;&#x5229;&#x6DA6;&#x5728;&#x8D2D;&#x4E70;&#x65F6;&#x5019;&#x5C31;&#x5DF2;&#x7ECF;&#x786E;&#x5B9A;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x51FA;&#x552E;&#x7684;&#x65F6;&#x5019;&#x3002;</p>
</blockquote>
<p>&#x592A;&#x4ED6;&#x5988;&#x7684;&#x5BF9;&#x4E86;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x4E1C;&#x897F;&#x662F;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x662F;&#x89C9;&#x5F97;&#x597D;&#x7684;&#xFF0C;&#x90A3;&#x4E00;&#x5B9A;&#x662F;&#x4E0D;&#x6323;&#x94B1;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x6295;&#x8D44;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#x6709;&#x80FD;&#x529B;&#x53BB;&#x53D1;&#x73B0;&#x597D;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x540C;&#x65F6;&#x8981;&#x76F8;&#x4FE1;&#x81EA;&#x5DF1;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x4E0D;&#x8981;&#x88AB;&#x522B;&#x4EBA;&#x7684;&#x770B;&#x4F4E;&#x6240;&#x6000;&#x7591;&#x3002;&#x597D;&#x7684;&#x4E1C;&#x897F;&#x5728;&#x4F60;&#x4E70;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x5DF2;&#x7ECF;&#x5F97;&#x5230;&#x4E86;&#x4EF7;&#x503C;&#x3002;</p>
<blockquote>
<p>&#x9996;&#x5148;&#x652F;&#x4ED8;&#x81EA;&#x5DF1;&#xFF1A;&#x5C06;&#x81EA;&#x5DF1;&#x7684;&#x6536;&#x5165;&#x9996;&#x5148;&#x53D8;&#x6210;&#x8D44;&#x4EA7;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x53BB;&#x8FDB;&#x884C;&#x652F;&#x51FA;&#x548C;&#x507F;&#x8FD8;&#x503A;&#x52A1;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x4E0D;&#x8981;&#x80CC;&#x4E0A;&#x5927;&#x7684;&#x503A;&#x52A1;&#x5305;&#x88B1;&#x3002;&#x8981;&#x4FDD;&#x6301;&#x4F4E;&#x652F;&#x51FA;&#x3002;&#x9996;&#x5148;&#x589E;&#x52A0;&#x8D44;&#x4EA7;&#xFF0C;&#x7136;&#x540E;&#xFF0C;&#x518D;&#x7528;&#x8D44;&#x4EA7;&#x4EA7;&#x751F;&#x7684;&#x73B0;&#x91D1;&#x6D41;&#x6765;&#x4E70;&#x5927;&#x623F;&#x5B50;&#x548C;&#x597D;&#x8F66;&#x5B50;&#x3002;&#x9677;&#x5728;&#x300C;&#x8001;&#x9F20;&#x8D5B;&#x8DD1;&#x300D;&#x4E2D;&#x4E0D;&#x662F;&#x660E;&#x667A;&#x7684;&#x9009;&#x62E9;&#x3002;&#x5F53;&#x4F60;&#x8D44;&#x91D1;&#x77ED;&#x7F3A;&#x65F6;&#xFF0C;&#x8BA9;&#x538B;&#x529B;&#x53BB;&#x53D1;&#x6325;&#x4F5C;&#x7528;&#xFF0C;&#x800C;&#x4E0D;&#x8981;&#x52A8;&#x7528;&#x4F60;&#x7684;&#x50A8;&#x84C4;&#x6216;&#x8D44;&#x672C;&#x3002;&#x5229;&#x7528;&#x8FD9;&#x79CD;&#x538B;&#x529B;&#x6765;&#x6FC0;&#x53D1;&#x4F60;&#x7684;&#x7406;&#x8D22;&#x5929;&#x8D4B;&#xFF0C;&#x60F3;&#x51FA;&#x65B0;&#x7684;&#x529E;&#x6CD5;&#x6323;&#x5230;&#x66F4;&#x591A;&#x7684;&#x94B1;&#xFF0C;&#x7136;&#x540E;&#x652F;&#x4ED8;&#x8D26;&#x5355;&#x3002;&#x8FD9;&#x6837;&#x5B50;&#xFF0C;&#x4E0D;&#x4F46;&#x80FD;&#x8BA9;&#x4F60;&#x6323;&#x5230;&#x94B1;&#xFF0C;&#x4E5F;&#x80FD;&#x63D0;&#x9AD8;&#x4F60;&#x7684;&#x8D22;&#x5546;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x548C;&#x6211;&#x5728;&#x4E0A;&#x6587;&#x4E2D;&#x5206;&#x6790;&#x300C;&#x4E0D;&#x8981;&#x65E9;&#x4E70;&#x623F;&#x300D;&#x7684;&#x89C2;&#x70B9;&#x5F88;&#x543B;&#x5408;&#x3002;&#x5148;&#x8981;&#x6295;&#x8D44;&#x81EA;&#x5DF1;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x575A;&#x5B9A;&#x7684;&#x6267;&#x884C;&#xFF0C;&#x5C06;&#x6536;&#x5165;&#x53D8;&#x4E3A;&#x8D44;&#x4EA7;&#x9879;&#x76EE;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6D88;&#x8D39;&#xFF0C;&#x6216;&#x8005;&#x7528;&#x6765;&#x8FD8;&#x503A;&#xFF08;&#x4E0D;&#x7136;&#x5C31;&#x662F;&#x300C;&#x8001;&#x9F20;&#x8D5B;&#x8DD1;&#x300D;&#x7684;&#x5FAA;&#x73AF;&#x4E86;&#xFF09;&#x3002;&#x800C;&#x4E14;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x8D37;&#x6B3E;&#x6BD4;&#x8F83;&#x591A;&#x7684;&#x5E74;&#x9650;&#xFF0C;&#x964D;&#x4F4E;&#x81EA;&#x5DF1;&#x7684;&#x652F;&#x51FA;&#xFF08;&#x4FDD;&#x6301;&#x4F4E;&#x652F;&#x51FA;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x66F4;&#x591A;&#x7684;&#x94B1;&#x8FDB;&#x884C;&#x6295;&#x8D44;&#x3002;&#x800C;&#x4E14;&#x5982;&#x6587;&#x4E2D;&#x6240;&#x8BF4;&#xFF0C;&#x7EDD;&#x5BF9;&#x4E0D;&#x8981;&#x52A8;&#x7528;&#x4F60;&#x7684;&#x8D44;&#x4EA7;&#xFF0C;&#x5982;&#x679C;&#x8FD8;&#x662F;&#x7F3A;&#x94B1;&#xFF0C;&#x60F3;&#x529E;&#x6CD5;&#x53BB;&#x6323;&#x94B1;&#xFF0C;&#x901A;&#x8FC7;&#x538B;&#x529B;&#x6765;push&#x4F60;&#x4E0A;&#x8FDB;&#xFF01;</p>
<blockquote>
<p>&#x4FE1;&#x606F;&#x662F;&#x65E0;&#x4EF7;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x7ECF;&#x7EAA;&#x4EBA;&#x4E0D;&#x4EC5;&#x5E94;&#x8BE5;&#x7ED9;&#x4F60;&#x4FE1;&#x606F;&#xFF0C;&#x8FD8;&#x5E94;&#x8BE5;&#x613F;&#x610F;&#x82B1;&#x65F6;&#x95F4;&#x6765;&#x6559;&#x5BFC;&#x4F60;&#x3002;</p>
</blockquote>
<p>&#x7ED9;&#x597D;&#x7684;&#x7ECF;&#x6D4E;&#x4EBA;&#x597D;&#x7684;&#x62A5;&#x916C;&#xFF0C;&#x91CD;&#x89C6;&#x4FE1;&#x606F;&#x7684;&#x4EF7;&#x503C;&#x548C;&#x4E13;&#x4E1A;&#x7684;&#x4EF7;&#x503C;&#x3002;</p>
<blockquote>
<p>&#x8BB0;&#x4F4F;&#x8F7B;&#x677E;&#x7684;&#x9053;&#x8DEF;&#x5F80;&#x5F80;&#x8D8A;&#x8D70;&#x8D8A;&#x96BE;&#xFF0C;&#x800C;&#x8270;&#x96BE;&#x7684;&#x9053;&#x8DEF;&#x5F80;&#x5F80;&#x4F1A;&#x8D8A;&#x8D70;&#x8D8A;&#x8F7B;&#x677E;&#x3002;</p>
</blockquote>
<p>&#x9001;&#x7ED9;&#x6240;&#x6709;&#x559C;&#x6B22;&#x51B2;&#x52A8;&#x6D88;&#x8D39;&#x7684;&#x4EBA;&#x3002;&#x9996;&#x5148;&#x300C;&#x652F;&#x4ED8;&#x81EA;&#x5DF1;&#x300D;&#xFF01;</p>
<blockquote>
<p>&#x5F53;&#x4F60;&#x624B;&#x5934;&#x300C;&#x6709;&#x70B9;&#x7D27;&#x300D;&#x6216;&#x662F;&#x60F3;&#x8981;&#x5F97;&#x5230;&#x4EC0;&#x4E48;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9996;&#x5148;&#x8981;&#x60F3;&#x5230;&#x7ED9;&#x4E88;&#xFF0C;&#x53EA;&#x6709;&#x5148;&#x300C;&#x4E88;&#x300D;&#xFF0C;&#x4F60;&#x624D;&#x80FD;&#x5728;&#x5C06;&#x6765;&#x53D6;&#x5F97;&#x4E30;&#x539A;&#x7684;&#x56DE;&#x62A5;&#xFF0C;&#x65E0;&#x8BBA;&#x91D1;&#x94B1;&#xFF0C;&#x5FAE;&#x7B11;&#xFF0C;&#x7231;&#x60C5;&#x8FD8;&#x662F;&#x53CB;&#x8C0A;&#x90FD;&#x662F;&#x5982;&#x6B64;&#x3002;&#x6211;&#x77E5;&#x9053;&#x4EBA;&#x4EEC;&#x5E38;&#x628A;&#x7ED9;&#x4E88;&#x653E;&#x5728;&#x6700;&#x540E;&#xFF0C;&#x4F46;&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#x7528;&#x4E8E;&#x4ED8;&#x51FA;&#x5BF9;&#x6211;&#x603B;&#x662F;&#x5927;&#x6709;&#x88E8;&#x76CA;&#x3002;&#x6211;&#x76F8;&#x4FE1;&#x4E92;&#x5229;&#x4E92;&#x60E0;&#x7684;&#x539F;&#x5219;&#xFF0C;&#x6211;&#x60F3;&#x8981;&#x5F97;&#x5230;&#x5C31;&#x8981;&#x4ED8;&#x51FA;&#x3002;&#x6211;&#x60F3;&#x8981;&#x94B1;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x7ED9;&#x522B;&#x4EBA;&#x94B1;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x53C8;&#x6210;&#x500D;&#x7684;&#x6536;&#x56DE;&#x94B1;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x6211;&#x60F3;&#x505A;&#x9500;&#x552E;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5E2E;&#x52A9;&#x522B;&#x4EBA;&#x4E70;&#x4E1C;&#x897F;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x7684;&#x4E1C;&#x897F;&#x4E5F;&#x5356;&#x51FA;&#x53BB;&#x4E86;&#x3002;&#x6211;&#x9700;&#x8981;&#x7B7E;&#x8BA2;&#x5408;&#x7EA6;&#x505A;&#x751F;&#x610F;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4F1A;&#x5C3D;&#x6211;&#x6240;&#x80FD;&#x53BB;&#x5E2E;&#x52A9;&#x5176;&#x4ED6;&#x4EBA;&#x5F97;&#x5230;&#x5408;&#x7EA6;&#xFF0C;&#x5C31;&#x50CF;&#x53D8;&#x9B54;&#x672F;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x8981;&#x7684;&#x5408;&#x7EA6;&#x4E5F;&#x5230;&#x624B;&#x4E86;&#x3002;&#x591A;&#x5E74;&#x524D;&#x6211;&#x66FE;&#x542C;&#x5230;&#x4E00;&#x53E5;&#x8C1A;&#x8BED;&#xFF1A;&#x300E;&#x4E0A;&#x5E1D;&#x4E0D;&#x9700;&#x8981;&#x5F97;&#x5230;&#xFF0C;&#x800C;&#x4EBA;&#x7C7B;&#x9700;&#x8981;&#x4ED8;&#x51FA;&#x3002;&#x300F;</p>
</blockquote>
<blockquote>
<p>&#x5F53;&#x6D89;&#x53CA;&#x91D1;&#x94B1;&#xFF0C;&#x7231;&#x60C5;&#xFF0C;&#x5E78;&#x798F;&#xFF0C;&#x9500;&#x552E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90FD;&#x8981;&#x8BB0;&#x4F4F;&#x8981;&#x4E3A;&#x81EA;&#x5DF1;&#x60F3;&#x8981;&#x7684;&#x4E1C;&#x897F;&#x5148;&#x4ED8;&#x51FA;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x80FD;&#x5F97;&#x5230;&#x300C;&#x52A0;&#x500D;&#x300D;&#x7684;&#x56DE;&#x62A5;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x70B9;&#x786E;&#x5B9E;&#x975E;&#x5E38;&#x6709;&#x5EFA;&#x8BBE;&#x6027;&#x3002;&#x8FD9;&#x4F53;&#x73B0;&#x4E86;&#x4E24;&#x4E2A;&#x539F;&#x5219;&#xFF1A;</p>
<ol>
<li>&#x5438;&#x5F15;&#x529B;&#x539F;&#x5219;</li>
<li>&#x4E92;&#x60E0;&#x4E92;&#x5229;&#x539F;&#x5219;</li>
</ol>
<p>&#x8981;&#x60F3;&#x5F97;&#x5230;&#x4EC0;&#x4E48;&#xFF0C;&#x5C31;&#x8981;&#x5148;&#x4ED8;&#x51FA;&#xFF0C;&#x4F60;&#x4ED8;&#x51FA;&#x4E86;&#xFF0C;&#x522B;&#x4EBA;&#x5C31;&#x4F1A;&#x540C;&#x6837;&#x7ED9;&#x4F60;&#x4ED8;&#x51FA;&#xFF0C;&#x4ECE;&#x800C;&#x5F97;&#x5230;&#x300C;&#x52A0;&#x500D;&#x300D;&#x7684;&#x56DE;&#x62A5;&#x3002;&#x5BF9;&#x5F85;&#x7231;&#x60C5;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;&#x6240;&#x4EE5;&#x4EBA;&#x8981;&#x6D3B;&#x7684;&#x300C;&#x5927;&#x6C14;&#x300D;&#x4E00;&#x4E9B;&#xFF0C;&#x591A;&#x8D21;&#x732E;&#xFF0C;&#x518D;&#x60F3;&#x56DE;&#x62A5;&#x624D;&#x662F;&#x5927;&#x9053;&#x3002;</p>
<blockquote>
<p>&#x5176;&#x5B9E;&#xFF0C;&#x4F60;&#x6839;&#x672C;&#x5C31;&#x4E0D;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x4EF7;&#x683C;&#x624D;&#x662F;&#x300C;&#x5408;&#x9002;&#x300D;&#x7684;&#xFF0C;&#x9664;&#x975E;&#x6709;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x76F8;&#x540C;&#x7684;&#x4EA4;&#x6613;&#x4F5C;&#x4E3A;&#x53C2;&#x7167;&#x3002;&#x5927;&#x90E8;&#x5206;&#x5356;&#x4E3B;&#x7684;&#x8981;&#x4EF7;&#x90FD;&#x662F;&#x8FC7;&#x9AD8;&#x7684;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x6240;&#x4EE5;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#xFF0C;&#x591A;&#x53D1;&#x51FA;&#x51E0;&#x4EFD;&#x62A5;&#x4EF7;&#xFF0C;&#x800C;&#x4E14;&#x4EF7;&#x683C;&#x90FD;&#x8F83;&#x4F4E;&#xFF0C;&#x4F4E;&#x5230;&#x4E70;&#x5BB6;&#x7684;&#x4EF7;&#x683C;&#x7684;&#x4E00;&#x534A;&#x3002;&#x6CA1;&#x5356;&#x8FC7;&#x4E1C;&#x897F;&#x7684;&#x4EBA;&#xFF0C;&#x5BF9;&#x5356;&#x65B9;&#x60F3;&#x5356;&#x51FA;&#x4E1C;&#x897F;&#x7684;&#x8FEB;&#x5207;&#x5FC3;&#x60C5;&#x662F;&#x4E0D;&#x4F1A;&#x7406;&#x89E3;&#x7684;&#x3002;&#x8BB0;&#x4F4F;&#xFF0C;&#x505A;&#x4E70;&#x5356;&#x5C31;&#x662F;&#x4E00;&#x573A;&#x6709;&#x8DA3;&#x7684;&#x300C;&#x6E38;&#x620F;&#x300D;&#xFF0C;&#x4F60;&#x63D0;&#x51FA;&#x62A5;&#x4EF7;&#x4E4B;&#x540E;&#xFF0C;&#x53EF;&#x80FD;&#x5BF9;&#x65B9;&#x5C31;&#x4F1A;&#x8BF4;&#x300C;&#x6210;&#x4EA4;&#x300D;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x5BFB;&#x627E;&#x4E00;&#x6869;&#x597D;&#x751F;&#x610F;&#xFF0C;&#x4E00;&#x5BB6;&#x597D;&#x4F01;&#x4E1A;&#xFF0C;&#x4E00;&#x4F4D;&#x5408;&#x9002;&#x7684;&#x4EBA;&#xFF0C;&#x6216;&#x4EFB;&#x4F55;&#x300C;&#x7C7B;&#x4F3C;&#x7684;&#x4E1C;&#x897F;&#x300D;&#xFF08;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x4E1C;&#x897F;&#xFF09;&#xFF0C;&#x5C31;&#x5982;&#x540C;&#x7EA6;&#x4F1A;&#x4E00;&#x6837;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x5230;&#x5E02;&#x573A;&#x4E0A;&#x53BB;&#x548C;&#x8BB8;&#x591A;&#x4EBA;&#x8C08;&#xFF0C;&#x505A;&#x8BB8;&#x591A;&#x62A5;&#x4EF7;&#xFF0C;&#x8FD8;&#x4EF7;&#xFF0C;&#x8C08;&#x5224;&#xFF0C;&#x62D2;&#x7EDD;&#x6216;&#x8005;&#x63A5;&#x6536;&#x3002;&#x4ECE;&#x5BFB;&#x627E;&#xFF0C;&#x62A5;&#x4EF7;&#xFF0C;&#x62D2;&#x7EDD;&#xFF0C;&#x8C08;&#x5224;&#x5230;&#x6210;&#x529F;&#xFF0C;&#x51E0;&#x4E4E;&#x662F;&#x4EBA;&#x4E00;&#x751F;&#x4E2D;&#x8981;&#x7ECF;&#x5386;&#x7684;&#x5168;&#x90E8;&#x8FC7;&#x7A0B;&#x3002;</p>
</blockquote>
<p>&#x592A;&#x6709;&#x529B;&#x7684;&#x89C2;&#x70B9;&#x4E86;&#x3002;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x4F60;&#x81EA;&#x5DF1;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x624D;&#x662F;&#x6700;&#x597D;&#x7684;&#x300C;&#x62A5;&#x4EF7;&#x300D;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x9700;&#x8981;&#x52C7;&#x6562;&#x5230;&#x300C;&#x5E02;&#x573A;&#x300D;&#x4E0A;&#x9762;&#x8BD5;&#x9519;&#x5427;&#x3002;&#x5148;&#x5C06;&#x81EA;&#x5DF1;&#x7684;&#x8981;&#x6C42;&#x62AC;&#x9AD8;&#xFF0C;&#x964D;&#x4F4E;&#x5BF9;&#x65B9;&#x7684;&#x8981;&#x6C42;&#x548C;&#x5229;&#x76CA;&#xFF0C;&#x7136;&#x540E;&#x4E0D;&#x505C;&#x7684;&#x5C1D;&#x8BD5;&#x591A;&#x4E2A;&#x300C;&#x5BF9;&#x8C61;&#x300D;&#xFF0C;&#x6700;&#x7EC8;&#x786E;&#x5B9A;&#x81EA;&#x5DF1;&#x5B9E;&#x9645;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x4EE5;&#x53CA;&#x5BF9;&#x65B9;&#x5B9E;&#x9645;&#x7684;&#x4EF7;&#x503C;&#x3002;&#x505A;&#x597D;&#x5B9A;&#x4F4D;&#xFF0C;&#x8FD8;&#x4EF7;&#xFF0C;&#x8C08;&#x5224;&#xFF0C;&#x62D2;&#x7EDD;&#x6216;&#x8005;&#x6210;&#x529F;&#x3002;&#x91CD;&#x8981;&#x7684;&#x4E0D;&#x662F;&#x7ED3;&#x679C;&#xFF0C;&#x800C;&#x5728;&#x8FD9;&#x4EBA;&#x751F;&#x5FC5;&#x987B;&#x7ECF;&#x5386;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<h2 id="&#x5C0F;&#x72D7;&#x94B1;&#x94B1;">&#x300A;&#x5C0F;&#x72D7;&#x94B1;&#x94B1;&#x300B;</h2>
<p>&#x5C0F;&#x72D7;&#x94B1;&#x94B1;&#x4E5F;&#x662F;&#x4E00;&#x672C;&#x6295;&#x8D44;&#x7406;&#x8D22;&#x7684;&#x5165;&#x95E8;&#x542F;&#x8499;&#x4E66;&#x7C4D;&#x3002;&#x4F5C;&#x8005;&#x901A;&#x8FC7;&#x6545;&#x4E8B;&#x7684;&#x5F62;&#x5F0F;&#x6559;&#x4F1A;&#x4E86;&#x4E3B;&#x4EBA;&#x516C;&#x5982;&#x4F55;&#x7406;&#x8D22;&#xFF0C;&#x7406;&#x8D22;&#x6295;&#x8D44;&#x7684;&#x91CD;&#x8981;&#x6027;&#xFF0C;&#x4EE5;&#x53CA;&#x8BF4;&#x660E;&#x4E86;&#x5F88;&#x591A;&#x65B9;&#x6CD5;&#x8BBA;&#x4E0A;&#x9762;&#x7684;&#x7ECF;&#x9A8C;&#x3002;&#x76F8;&#x6BD4;&#x4E8E;&#x300C;&#x5BCC;&#x7238;&#x7238;&#xFF0C;&#x7A77;&#x7238;&#x7238;&#x300D;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x66F4;&#x52A0;&#x7684;&#x63A5;&#x5730;&#x6C14;&#xFF0C;&#x8BF4;&#x4E86;&#x5F88;&#x591A;&#x4E0D;&#x5149;&#x662F;&#x601D;&#x60F3;&#x5C42;&#x9762;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4E5F;&#x8BF4;&#x4E86;&#x4E00;&#x4E9B;&#x7528;&#x6765;&#x843D;&#x5730;&#x6267;&#x884C;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x975E;&#x5E38;&#x4E0D;&#x9519;&#x3002;&#x603B;&#x7ED3;&#x5982;&#x4E0B;&#xFF1B;</p>
<blockquote>
<p>&#x5FFD;&#x89C6;&#x8D22;&#x52A1;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x662F;&#x653E;&#x5F03;&#x6210;&#x529F;&#x7684;&#x673A;&#x4F1A;&#x3002;&#x8D22;&#x52A1;&#x81EA;&#x7531;&#x662F;&#x4ECA;&#x5929;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x53EF;&#x80FD;&#x5B9E;&#x73B0;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x5F53;&#x7136;&#x8FD9;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x62E5;&#x6709;&#x8FFD;&#x6C42;&#x81EA;&#x5DF1;&#x771F;&#x6B63;&#x60F3;&#x8981;&#x751F;&#x6D3B;&#x7684;&#x52C7;&#x6C14;&#x3002;&#x6B63;&#x5982;&#x4E00;&#x53E5;&#x540D;&#x8A00;&#x8BF4;&#x8BF4;&#xFF1A;&#x300C;&#x5E76;&#x975E;&#x56F0;&#x96BE;&#x4F7F;&#x6211;&#x4EEC;&#x653E;&#x5F03;&#xFF0C;&#x8FD8;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x653E;&#x5F03;&#xFF0C;&#x624D;&#x663E;&#x5F97;&#x5982;&#x6B64;&#x56F0;&#x96BE;&#x3002;&#x300D;</p>
</blockquote>
<p>&#x5176;&#x5B9E;&#x6211;&#x8BB0;&#x5F55;&#x7684;&#x76EE;&#x7684;&#x662F;&#x6700;&#x540E;&#x7684;&#x540D;&#x8A00;&#xFF0C;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x4E0D;&#x8981;&#x8F7B;&#x6613;&#x7684;&#x653E;&#x5F03;&#x81EA;&#x5DF1;&#x3002;</p>
<blockquote>
<p>&#x4E2D;&#x56FD;&#x667A;&#x8005;&#x8001;&#x5B50;&#x8BF4;&#x8FC7;&#xFF1A;&#x300C;&#x5929;&#x4E0B;&#x96BE;&#x4E8B;&#xFF0C;&#x5FC5;&#x4F5C;&#x4E8E;&#x6613;&#xFF1B;&#x5929;&#x4E0B;&#x5927;&#x4E8B;&#xFF0C;&#x5FC5;&#x4F5C;&#x4E8E;&#x7EC6;&#x300D;</p>
</blockquote>
<p>&#x592A;&#x6DF1;&#x523B;&#x3002;&#x4ECE;&#x5C0F;&#x4E8B;&#x505A;&#x8D77;&#xFF0C;&#x5C06;&#x5927;&#x4E8B;&#x5316;&#x4E3A;&#x5C0F;&#x4E8B;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x80FD;&#x505A;&#x6210;&#x5927;&#x4E8B;&#x3002;</p>
<blockquote>
<p>&#x597D;&#x5947;&#x662F;&#x597D;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x51B3;&#x4E0D;&#x80FD;&#x8BA9;&#x597D;&#x5947;&#x963B;&#x788D;&#x4F60;&#x505A;&#x4E8B;&#x3002;&#x592A;&#x591A;&#x7684;&#x4EBA;&#x505A;&#x4E8B;&#x72B9;&#x8C6B;&#x4E0D;&#x51B3;&#xFF0C;&#x5C31;&#x662F;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x89C9;&#x5F97;&#x6CA1;&#x6709;&#x5B8C;&#x5168;&#x5F04;&#x61C2;&#x8FD9;&#x4EF6;&#x4E8B;&#x3002;&#x771F;&#x6B63;&#x4ED8;&#x8BF8;&#x5B9E;&#x8DF5;&#x6BD4;&#x7EAF;&#x7CB9;&#x7684;&#x601D;&#x8003;&#x6709;&#x7528;&#x7684;&#x591A;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x300C;&#x5C1D;&#x8BD5;&#x300D;&#x7EAF;&#x7CB9;&#x662F;&#x4E00;&#x79CD;&#x501F;&#x53E3;&#xFF0C;&#x4F60;&#x8FD8;&#x6CA1;&#x6709;&#x505A;&#xFF0C;&#x5C31;&#x5DF2;&#x7ECF;&#x7ED9;&#x81EA;&#x5DF1;&#x60F3;&#x597D;&#x4E86;&#x9000;&#x8DEF;&#x3002;&#x4E0D;&#x80FD;&#x8BD5;&#x9A8C;&#xFF0C;&#x4F60;&#x53EA;&#x6709;&#x4E24;&#x4E2A;&#x9009;&#x62E9;&#x2013;&#x505A;&#x6216;&#x8005;&#x4E0D;&#x505A;&#x3002;</p>
</blockquote>
<p>&#x8981;&#x4E48;&#x505A;&#xFF0C;&#x8981;&#x4E48;&#x4E0D;&#x505A;&#x3002;&#x8981;&#x4E48;&#x884C;&#x52A8;&#xFF0C;&#x8981;&#x4E48;&#x6B7B;&#x53BB;&#x3002;</p>
<blockquote>
<p>&#x6709;&#x4E00;&#x53EA;&#x6D77;&#x9E25;&#x5BF9;&#x6211;&#x8BF4;&#x8FC7;&#xFF1A;&#x300C;&#x5728;&#x4F60;&#x5C55;&#x7FC5;&#x98DE;&#x7FD4;&#x4E4B;&#x524D;&#xFF0C;&#x4F60;&#x5C31;&#x5FC5;&#x987B;&#x76F8;&#x4FE1;&#x81EA;&#x5DF1;&#x80FD;&#x5230;&#x5230;&#x76EE;&#x7684;&#x5730;&#x3002;&#x300D;</p>
</blockquote>
<blockquote>
<p>&#x5728;&#x505A;&#x4EC0;&#x4E48;&#x4E8B;&#x4E4B;&#x524D;&#xFF0C;&#x4F60;&#x603B;&#x662F;&#x9996;&#x5148;&#x60F3;&#x300C;&#x8FD9;&#x4E8B;&#x662F;&#x505A;&#x4E0D;&#x6210;&#x7684;&#x300D;&#xFF0C;&#x8FD9;&#x6837;&#x662F;&#x80AF;&#x5B9A;&#x4E0D;&#x4F1A;&#x6210;&#x529F;&#x7684;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x4F60;&#x771F;&#x7684;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x613F;&#x671B;&#xFF0C;&#x5426;&#x5219;&#x4F60;&#x4E00;&#x9047;&#x5230;&#x56F0;&#x96BE;&#x5C31;&#x4F1A;&#x653E;&#x5F03;&#x4E86;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x4F60;&#x53BB;&#x51C6;&#x5907;&#x4E00;&#x4E2A;&#x672C;&#x5B50;&#xFF0C;&#x7ED9;&#x5B83;&#x53D6;&#x540D;&#x53EB;&#x300C;&#x6210;&#x529F;&#x65E5;&#x8BB0;&#x300D;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x6240;&#x6709;&#x505A;&#x6210;&#x529F;&#x7684;&#x662F;&#x4E8B;&#x60C5;&#x8BB0;&#x5F55;&#x8FDB;&#x53BB;&#x3002;</p>
</blockquote>
<p>&#x4F5C;&#x8005;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#xFF1A;1&#xFF09;&#x8BB0;&#x5F55;&#x4F60;&#x7684;&#x613F;&#x671B;&#x6E05;&#x5355; 2&#xFF09;&#x8BB0;&#x5F55;&#x4F60;&#x7684;&#x6210;&#x529F;&#x65E5;&#x8BB0;&#x3002;</p>
<p>&#x524D;&#x8005;&#x662F;&#x4E3A;&#x4E86;&#x5C06;&#x81EA;&#x5DF1;&#x7684;&#x76EE;&#x6807;&#x8FDB;&#x884C;&#x91CF;&#x5316;&#xFF0C;&#x8BA9;&#x81EA;&#x5DF1;&#x6709;&#x4E00;&#x4E2A;&#x7406;&#x8D22;&#x7684;&#x660E;&#x786E;&#x76EE;&#x6807;&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x6709;&#x52A8;&#x529B;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x6211;&#x89C9;&#x5F97;&#x5C31;&#x66F4;&#x52A0;&#x91CD;&#x8981;&#x4E86;&#xFF0C;&#x8BB0;&#x5F55;&#x4F60;&#x81EA;&#x5DF1;&#x6240;&#x6709;&#x8BA4;&#x4E3A;&#x6210;&#x529F;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4E0D;&#x8BBA;&#x5927;&#x4E8B;&#x6216;&#x8005;&#x5C0F;&#x4E8B;&#xFF0C;&#x7136;&#x540E;&#x4E5F;&#x987A;&#x5E26;&#x8BB0;&#x5F55;&#x6210;&#x529F;&#x7684;&#x539F;&#x56E0;&#x548C;&#x603B;&#x7ED3;&#x3002;&#xFF08;&#x6211;&#x60F3;&#x4E5F;&#x5E94;&#x8BE5;&#x914D;&#x5957;&#x8BB0;&#x5F55;&#x4E00;&#x4E0B;&#x5931;&#x8D25;&#x7684;&#x7ECF;&#x9A8C;&#xFF09;&#x3002;&#x8FD9;&#x4E2A;&#x672C;&#x5B50;&#x7684;&#x597D;&#x5904;&#x662F;&#x8BA9;&#x4F60;&#x66F4;&#x52A0;&#x660E;&#x786E;&#x81EA;&#x5DF1;&#x7684;&#x80FD;&#x529B;&#x6240;&#x5728;&#xFF0C;&#x5BF9;&#x81EA;&#x5DF1;&#x66F4;&#x52A0;&#x6709;&#x4FE1;&#x5FC3;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x771F;&#x7684;&#x662F;&#x592A;&#x7F3A;&#x4E4F;&#x300C;&#x81EA;&#x4FE1;&#x300D;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x4E86;&#x3002;&#x4F60;&#x5982;&#x679C;&#x66FE;&#x7ECF;&#x90FD;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x975E;&#x5E38;NB&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x8FD9;&#x6B21;&#x4F60;&#x4E5F;&#x4E00;&#x5B9A;&#x53EF;&#x4EE5;&#x3002;</p>
<p>&#x505A;&#x4E8B;&#x60C5;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x575A;&#x6301;&#x751A;&#x81F3;&#x6210;&#x529F;&#x603B;&#x7ED3;&#x4F4D;&#x51E0;&#x4E2A;&#x56E0;&#x7D20;&#xFF1A;</p>
<ol>
<li>&#x5206;&#x6790;&#x662F;&#x5426;&#x53EF;&#x884C;&#x3002;&#xFF08;&#x5982;&#x679C;&#x4E0D;&#x81EA;&#x4FE1;&#xFF0C;&#x8D1F;&#x9762;&#x5C31;&#x4F1A;&#x538B;&#x5012;&#xFF0C;&#x4F46;&#x662F;&#x5176;&#x5B9E;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x4F60;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x7684;&#x3002;&#x540C;&#x7406;&#x5BF9;&#x4E8E;&#x6210;&#x529F;&#x5B9E;&#x9645;&#x8BB0;&#x5F55;&#x7684;&#x8D8A;&#x591A;&#xFF0C;&#x4F60;&#x5C31;&#x8D8A;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x662F;&#x81EA;&#x5DF1;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x7684;&#x3002;&#xFF09;</li>
<li>&#x5206;&#x89E3;&#x95EE;&#x9898;&#x3002;</li>
<li>&#x575A;&#x5B9A;&#x7684;&#x6267;&#x884C;&#x3002;&#xFF08;&#x76EE;&#x6807;&#x8BA9;&#x4F60;&#x4E0D;&#x5BB9;&#x6613;&#x8F7B;&#x6613;&#x653E;&#x5F03;&#xFF09;</li>
</ol>
<p>&#x6240;&#x4EE5;&#x5F00;&#x59CB;&#x8BB0;&#x5F55;&#x8BE5;&#x6210;&#x529F;&#x65E5;&#x8BB0;&#x3002;</p>
<blockquote>
<p>&#x5982;&#x4F55;&#x6323;&#x94B1;&#xFF1A;</p>
<ol>
<li>&#x4E3A;&#x522B;&#x4EBA;&#x89E3;&#x51B3;&#x4E00;&#x4E2A;&#x96BE;&#x9898;&#xFF0C;&#x5C31;&#x53EF;&#x80FD;&#x5F97;&#x5230;&#x94B1;&#x3002;</li>
<li>&#x628A;&#x7CBE;&#x529B;&#x96C6;&#x4E2D;&#x5728;&#x4F60;&#x77E5;&#x9053;&#x7684;&#xFF0C;&#x80FD;&#x505A;&#x7684;&#x548C;&#x62E5;&#x6709;&#x7684;&#x4E1C;&#x897F;&#x4E0A;&#x3002;</li>
</ol>
</blockquote>
<p>focus&#x5728;&#x4F60;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x4ECE;&#x8FD9;&#x4E2A;&#x70B9;&#x8FDB;&#x884C;&#x51FA;&#x53D1;&#xFF0C;&#x53BB;&#x63A5;&#x89E6;&#x66F4;&#x591A;&#x53EF;&#x884C;&#x7684;&#x65B9;&#x6CD5;&#x548C;&#x4E16;&#x754C;&#x3002;&#xFF08;The law of attraction)
&#x800C;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x662F;&#x5C06;&#x7CBE;&#x529B;&#x96C6;&#x4E2D;&#x5728;&#x4ED6;&#x4EEC;&#x4E0D;&#x77E5;&#x9053;&#x7684;&#xFF0C;&#x4E0D;&#x80FD;&#x505A;&#x7684;&#xFF0C;&#x548C;&#x6CA1;&#x6709;&#x7684;&#x4E1C;&#x897F;&#x4E0A;&#x3002;</p>
<blockquote>
<p>&#x575A;&#x5B9A;&#x6267;&#x884C;&#x8BA1;&#x5212;&#x7684;&#x4E09;&#x4EF6;&#x91CD;&#x8981;&#x4E8B;&#x60C5;&#xFF1A;</p>
<ol>
<li>&#x5728;&#x9047;&#x5230;&#x56F0;&#x96BE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ECD;&#x8981;&#x575A;&#x6301;&#x81EA;&#x5DF1;&#x7684;&#x60F3;&#x6CD5;&#x3002;&#x4E00;&#x5207;&#x6B63;&#x5E38;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x80FD;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#x3002;&#x53EA;&#x6709;&#x5F53;&#x771F;&#x6B63;&#x7684;&#x56F0;&#x96BE;&#x51FA;&#x73B0;&#x7684;&#x65F6;&#x5019;&#x624D;&#x80FD;&#x89C1;&#x5206;&#x6653;&#x3002;&#x53EA;&#x6709;&#x5C11;&#x6570;&#x4EBA;&#x80FD;&#x575A;&#x5B9A;&#x4E0D;&#x79FB;&#x5730;&#x8D2F;&#x5F7B;&#x81EA;&#x5DF1;&#x7684;&#x8BA1;&#x5212;&#x3002;&#x90A3;&#x4E9B;&#x975E;&#x5E38;&#x6210;&#x529F;&#x7684;&#x4EBA;&#x751A;&#x81F3;&#x6709;&#x80FD;&#x529B;&#x5728;&#x4ED6;&#x4EEC;&#x6700;&#x56F0;&#x96BE;&#x7684;&#x65F6;&#x5019;&#x4F5C;&#x51FA;&#x6700;&#x6770;&#x51FA;&#x7684;&#x8868;&#x73B0;&#x3002;</li>
<li>&#x5728;&#x4E00;&#x5207;&#x8FDB;&#x5C55;&#x987A;&#x5229;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x4E5F;&#x5E94;&#x8BE5;&#x575A;&#x6301;&#x505A;&#x3002;</li>
<li>72&#x5C0F;&#x65F6;&#x89C4;&#x5B9A;&#x3002;&#x5F53;&#x4F60;&#x51B3;&#x5B9A;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x5728;72&#x4E2A;&#x5C0F;&#x65F6;&#x4E4B;&#x5185;&#x5B8C;&#x6210;&#xFF0C;&#x5426;&#x5219;&#x4F60;&#x5F88;&#x53EF;&#x80FD;&#x6C38;&#x8FDC;&#x90FD;&#x4E0D;&#x4F1A;&#x505A;&#x4E86;&#x3002;</li>
</ol>
</blockquote>
<p>&#x6DF1;&#x6709;&#x611F;&#x89E6;&#x3002;&#x5728;&#x4ECA;&#x5929;&#x9047;&#x5230;&#x56F0;&#x96BE;&#x6216;&#x8005;&#x4E0D;&#x597D;&#x53D7;&#x4E8B;&#x60C5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x81EA;&#x5DF1;&#x5C31;&#x4F1A;&#x9677;&#x5165;&#x5230;&#x4E00;&#x79CD;&#x60C5;&#x7EEA;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x4E60;&#x60EF;&#x6027;&#x7684;&#x9009;&#x62E9;&#x9003;&#x907F;&#x4E00;&#x5929;&#xFF0C;&#x7136;&#x540E;&#x5E94;&#x8BE5;&#x505A;&#x7684;&#x8BA1;&#x5212;&#x4E5F;&#x4F1A;&#x88AB;&#x9003;&#x907F;&#x6389;&#xFF08;&#x6BD4;&#x5982;&#x6709;&#x65F6;&#x5019;&#x4ECA;&#x5929;&#x65E5;&#x8BB0;&#x5C31;&#x4E0D;&#x5199;&#x4E4B;&#x7C7B;&#xFF09;&#x8FD9;&#x5176;&#x5B9E;&#x8FD8;&#x662F;&#x81EA;&#x5DF1;&#x8106;&#x5F31;&#x7684;&#x8868;&#x73B0;&#x3002;&#x5BF9;&#x5F3A;&#x8005;&#x800C;&#x8A00;&#xFF0C;&#x9047;&#x5230;&#x56F0;&#x96BE;&#x53CD;&#x800C;&#x662F;&#x6700;&#x5E94;&#x8BE5;&#x575A;&#x6301;&#x548C;&#x603B;&#x7ED3;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8C01;&#x90FD;&#x6709;&#x56F0;&#x96BE;&#xFF0C;&#x300C;&#x80DC;&#x5229;&#x610F;&#x5473;&#x7740;&#x4E0D;&#x5BB3;&#x6015;&#x5931;&#x8D25;&#x300D;&#xFF0C;&#x8D8A;&#x662F;&#x8FD9;&#x6837;&#x8D8A;&#x662F;&#x603B;&#x7ED3;&#x53CD;&#x601D;&#x7684;&#x597D;&#x673A;&#x4F1A;&#x3002;</p>
<p>&#x540C;&#x6837;&#xFF0C;&#x4E00;&#x5929;&#x5982;&#x679C;&#x975E;&#x5E38;&#x987A;&#x5229;&#xFF0C;&#x4E5F;&#x4F1A;&#x88AB;&#x80DC;&#x5229;&#x51B2;&#x6655;&#x4E86;&#x5934;&#x8111;&#xFF0C;&#x4ECE;&#x672A;&#x5FD8;&#x8BB0;&#x575A;&#x5B9A;&#x6267;&#x884C;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x6700;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#xFF1A;&#x6BCF;&#x5929;&#x56FA;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x6309;&#x7167;&#x8BA1;&#x5212;&#x56FA;&#x5B9A;&#x7684;&#x6267;&#x884C;&#xFF0C;&#x6210;&#x4E3A;&#x4E60;&#x60EF;&#xFF0C;&#x5E76;&#x4E14;&#x662F;&#x300C;&#x575A;&#x5B9A;&#x7684;&#x4E60;&#x60EF;&#x300D;&#x3002;</p>
<blockquote>
<p>4&#x6761;&#x5FE0;&#x544A;&#xFF0C;&#x89E3;&#x51B3;&#x8D22;&#x52A1;&#x5371;&#x673A;&#x95EE;&#x9898;&#xFF1A;</p>
<ol>
<li>&#x6B20;&#x503A;&#x7684;&#x4EBA;&#x5E94;&#x8BE5;&#x6BC1;&#x6389;&#x4FE1;&#x7528;&#x5361;&#x3002;</li>
<li>&#x5E94;&#x8BE5;&#x5C3D;&#x53EF;&#x80FD;&#x5C11;&#x7684;&#x507F;&#x8FD8;&#x8D37;&#x6B3E;&#x3002;&#xFF08;&#x5C3D;&#x91CF;&#x4F7F;&#x7528;&#x66F4;&#x591A;&#x7684;&#x5206;&#x671F;&#xFF09;</li>
<li>&#x5C06;&#x6263;&#x9664;&#x751F;&#x6D3B;&#x8D39;&#x5269;&#x4E0B;&#x7684;&#x94B1;&#x7684;&#x4E00;&#x534A;&#x5B58;&#x8D77;&#x6765;&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x4E00;&#x534A;&#x7528;&#x4E8E;&#x652F;&#x4ED8;&#x6D88;&#x8D39;&#x8D37;&#x6B3E;&#x3002;&#x6700;&#x597D;&#x6839;&#x672C;&#x4E0D;&#x7533;&#x8BF7;&#x6D88;&#x8D39;&#x8D37;&#x6B3E;&#x3002;</li>
<li>&#x4E70;&#x4E1C;&#x897F;&#x4E4B;&#x524D;&#x95EE;&#x4E00;&#x53E5;&#xFF1A;&#x300C;&#x8FD9;&#x771F;&#x7684;&#x6709;&#x5FC5;&#x8981;&#x561B;&#xFF1F;&#x300D;</li>
</ol>
</blockquote>
<p>&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x5C31;&#x662F;&#xFF1A;</p>
<ol>
<li>&#x91CF;&#x5165;&#x4E3A;&#x51FA;&#x3002;</li>
<li>&#x79EF;&#x7D2F;&#x8D44;&#x4EA7;&#x3002;</li>
</ol>
<p>&#x5BF9;&#x4E8E;&#x7B2C;&#x4E8C;&#x70B9;&#xFF0C;&#x4E2A;&#x4EBA;&#x4E5F;&#x662F;&#x5F88;&#x6709;&#x611F;&#x89E6;&#x3002;&#x4E24;&#x4E2A;&#x5206;&#x671F;&#x8BA1;&#x5212;&#x8FDB;&#x884C;&#x5BF9;&#x6BD4;&#xFF1A;</p>
<p>A&#xFF09;&#x4F7F;&#x7528;10&#x5E74;&#x65F6;&#x95F4;&#x8FD8;&#x94B1;</p>
<p>&#x4F18;&#x70B9;&#xFF1A;&#x603B;&#x7684;&#x94B1;&#x5C11;
&#x7F3A;&#x70B9;&#xFF1A;&#x6BCF;&#x4E2A;&#x6708;&#x53EF;&#x80FD;&#x5C06;&#x6536;&#x5165;&#x5168;&#x90E8;&#x90FD;&#x53D8;&#x4E3A;&#x652F;&#x51FA;&#xFF0C;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x79EF;&#x7D2F;&#x8D44;&#x4EA7;&#x3002;</p>
<p>B&#xFF09;&#x4F7F;&#x7528;20&#x5E74;&#x65F6;&#x95F4;&#x8FD8;&#x94B1;</p>
<p>&#x4F18;&#x70B9;&#xFF1A;&#x652F;&#x51FA;&#x7684;&#x94B1;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x591A;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x5269;&#x4E0B;&#x7684;&#x94B1;&#x8FDB;&#x884C;&#x6295;&#x8D44;&#x3002;&#x538B;&#x529B;&#x5C0F;&#x4E00;&#x4E9B;&#x3002;
&#x7F3A;&#x70B9;&#xFF1A;&#x603B;&#x7684;&#x652F;&#x51FA;&#x94B1;&#x591A;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x6211;&#x5BF9;&#x5206;&#x671F;&#x7684;&#x8BA1;&#x7B97;&#x65B9;&#x5F0F;&#x8FD8;&#x4E0D;&#x592A;&#x6E05;&#x695A;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;B&#x4F1A;&#x6BD4;A&#x591A;&#x591A;&#x5C11;&#xFF0C;&#x6240;&#x4EE5;&#x5206;&#x6790;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x8BEF;&#x5DEE;&#x3002;&#x4F46;&#x6709;&#x4E00;&#x70B9;&#x5012;&#x662F;&#x5BF9;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x662F;A&#x65B9;&#x6848;&#xFF0C;10&#x5E74;&#x4E4B;&#x540E;&#xFF0C;&#x300C;&#x4F60;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x7684;&#x8D44;&#x4EA7;&#x300D;&#xFF0C;&#x53EF;&#x662F;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x4F60;&#x5E74;&#x9F84;&#x5927;&#x4E86;&#xFF0C;&#x4E0D;&#x80FD;&#x8FD8;&#x662F;&#x4E00;&#x76F4;&#x4F9D;&#x8D56;&#x5DE5;&#x8D44;&#x5427;&#x3002;</p>
<p>&#x76F8;&#x6BD4;&#x800C;&#x8A00;&#xFF0C;B&#x65B9;&#x6848;&#x6709;&#x4E86;10&#x5E74;&#x7684;&#x7D2F;&#x79EF;&#xFF0C;&#x8D44;&#x4EA7;&#x9879;&#x76EE;&#x751F;&#x6210;&#x7684;&#x6536;&#x5165;&#x52A0;&#x4E0A;&#x4F60;&#x81EA;&#x5DF1;&#x4E0D;&#x65AD;&#x4E0A;&#x5347;&#x7684;&#x5DE5;&#x8D44;&#xFF08;&#x81F3;&#x5C11;&#x4F1A;&#x4E0A;&#x6DA8;&#x4E9B;&#x5427;&#xFF09;&#x7528;&#x6765;&#x8FD8;&#x6389;&#x8FC7;&#x53BB;&#x7684;&#x8D44;&#x91D1;&#x5E94;&#x8BE5;&#x4F1A;&#x66F4;&#x52A0;&#x5BB9;&#x6613;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x300C;&#x66F4;&#x591A;&#x7684;&#x94B1;&#x6301;&#x7EED;&#x653E;&#x5165;&#x5230;&#x8D44;&#x4EA7;&#x9879;&#x76EE;&#x4E2D;&#x300D;&#x3002;&#x8FD9;&#x6837;&#x5B50;&#x4F60;&#x624D;&#x4F1A;&#x62E5;&#x6709;&#x66F4;&#x591A;&#x7684;&#x8D44;&#x4EA7;&#x3002;&#x800C;&#x4F7F;&#x7528;A&#x65B9;&#x5F0F;&#xFF0C;&#x4F60;&#x6240;&#x6709;&#x7684;&#x94B1;&#x90FD;&#x53EA;&#x662F;&#x53BB;&#x8FD8;&#x503A;&#x4E86;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x6211;&#x4E5F;&#x66F4;&#x52A0;&#x540C;&#x610F;B&#x65B9;&#x6848;&#xFF0C;&#x8FD9;&#x4E2A;&#x548C;&#x524D;&#x9762;&#x5206;&#x6790;&#x7684;&#x300C;&#x4E0D;&#x8981;&#x65E9;&#x65E9;&#x4E70;&#x623F;&#x5B50;&#x300D;&#x662F;&#x5DEE;&#x4E0D;&#x591A;&#x7684;&#x3002;&#x6709;&#x51E0;&#x70B9;&#x5F88;&#x91CD;&#x8981;&#xFF1A;</p>
<ol>
<li>&#x4E00;&#x5B9A;&#x8981;&#x6709;&#x6301;&#x7EED;&#x7684;&#x8D44;&#x4EA7;&#x6295;&#x5165;&#x3002;</li>
<li><strong>&#x7528;&#x53D1;&#x5C55;&#x7684;&#x773C;&#x5149;&#x770B;&#x95EE;&#x9898;</strong>&#x3002;</li>
<li>&#x91CF;&#x5165;&#x4E3A;&#x51FA;&#x3002;&#x8FD9;&#x5305;&#x62EC;&#x7533;&#x8BF7;&#x8D37;&#x6B3E;&#xFF0C;&#x8D37;&#x6B3E;&#x7684;&#x6570;&#x503C;&#x5E94;&#x8BE5;<strong>&#x4F4E;&#x4E8E;&#x4F60;&#x6700;&#x9AD8;&#x53EF;&#x627F;&#x53D7;&#x7684;&#x4E00;&#x534A;</strong>&#x3002;&#x8FD9;&#x6837;&#x624D;&#x53EF;&#x80FD;&#x6709;&#x94B1;&#x7EE7;&#x7EED;&#x6295;&#x8D44;&#x3002;</li>
</ol>
<blockquote>
<p>&#x5E78;&#x8FD0;&#x53EA;&#x662F;&#x5145;&#x5206;&#x51C6;&#x5907;&#x52A0;&#x4E0A;&#x52AA;&#x529B;&#x5DE5;&#x4F5C;&#x7684;&#x7ED3;&#x679C;
&#x4E00;&#x4E2A;&#x4EBA;&#x867D;&#x7136;&#x5BB3;&#x6015;&#x4F46;&#x4ECD;&#x6562;&#x4E8E;&#x524D;&#x884C;&#xFF0C;&#x8FD9;&#x624D;&#x53EB;&#x52C7;&#x6562;</p>
</blockquote>
<p>anyway&#xFF0C;hard working really matters</p>
<blockquote>
<p>&#x6700;&#x73CD;&#x8D35;&#x7684;&#x793C;&#x7269;&#x662F;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x4E89;&#x53D6;&#x6765;&#x7684;&#x3002;&#x514B;&#x670D;&#x4E86;&#x4E22;&#x9762;&#x5B50;&#x7684;&#x6050;&#x60E7;&#xFF0C;&#x4E16;&#x754C;&#x4F1A;&#x5411;&#x4F60;&#x655E;&#x5F00;&#x5927;&#x95E8;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x751F;&#x6D3B;&#x6709;&#x65F6;&#x5019;&#x771F;&#x7684;&#x5F88;&#x96BE;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x5F88;&#x7CBE;&#x5F69;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x56F0;&#x96BE;&#xFF0C;&#x72AF;&#x9519;&#x8BEF;&#x548C;&#x4E22;&#x9762;&#x5B50;&#x5F15;&#x8D77;&#x7684;&#x6050;&#x60E7;&#x5DF2;&#x7ECF;&#x7834;&#x574F;&#x4E86;&#x65E0;&#x6570;&#x4EBA;&#x7684;&#x751F;&#x6D3B;&#x3002;</p>
</blockquote>
<blockquote>
<p>&#x6050;&#x60E7;&#x603B;&#x662F;&#x51FA;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x8BBE;&#x60F3;&#x4E8B;&#x60C5;&#x5982;&#x4F55;&#x4E0D;&#x987A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x5931;&#x8D25;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x60F3;&#x7684;&#x8D8A;&#x591A;&#xFF0C;&#x5C31;&#x4F1A;&#x8D8A;&#x5BB3;&#x6015;&#x3002;&#x800C;&#x5F53;&#x4F60;&#x770B;&#x7740;&#x81EA;&#x5DF1;&#x7684;&#x6210;&#x529F;&#x65E5;&#x8BB0;&#x65F6;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#x90A3;&#x4E9B;&#x6210;&#x529F;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x81EA;&#x70ED;&#x800C;&#x7136;&#x4E5F;&#x5C31;&#x4F1A;&#x60F3;&#x5230;&#x5E94;&#x8BE5;&#x600E;&#x6837;&#x53BB;&#x505A;&#x3002;</p>
</blockquote>
<p>&#x4E66;&#x4E2D;P140&#x5BF9;&#x6C49;&#x5185;&#x574E;&#x666E;&#x5148;&#x751F;&#x8FFD;&#x6C42;&#x81EA;&#x5DF1;&#x592A;&#x592A;&#x7684;&#x4E00;&#x6BB5;&#x8868;&#x8FF0;&#x975E;&#x5E38;&#x7684;&#x6DF1;&#x523B;&#x3002;&#x4ED6;&#x514B;&#x670D;&#x4E86;&#x6240;&#x6709;&#x7684;&#x6050;&#x60E7;&#x548C;&#x62C5;&#x5FC3;&#xFF0C;&#x6700;&#x7EC8;&#x642D;&#x8BAA;&#x8BA4;&#x8BC6;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x592A;&#x592A;&#xFF0C;&#x6536;&#x83B7;&#x4E86;&#x81EA;&#x5DF1;&#x4EBA;&#x751F;&#x4E2D;&#x300C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x793C;&#x7269;&#x300D;&#x3002;</p>
<p>&#x5BF9;&#x4EBA;&#x751F;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#xFF0C;<strong>&#x597D;&#x7684;&#x4E1C;&#x897F;&#x90FD;&#x662F;&#x4E89;&#x53D6;&#x6765;&#x7684;&#xFF0C;&#x4E0D;&#x8981;&#x5BB3;&#x6015;&#xFF0C;&#x52C7;&#x6562;&#x4E89;&#x53D6;</strong>&#x3002;</p>
<p>&#x8981;&#x591A;&#x7528;&#x6B63;&#x9762;&#x7684;&#x601D;&#x7EF4;&#x6765;&#x8FDB;&#x884C;&#x8003;&#x8651;&#xFF0C;<strong>&#x5982;&#x679C;&#x6211;&#x505A;&#x5230;&#x4E86;&#x6211;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x4EC0;&#x4E48;</strong>&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8FC7;&#x591A;&#x7684;&#x8003;&#x8651;&#x505A;&#x4E0D;&#x5230;&#x4F1A;&#x6709;&#x4EC0;&#x4E48;&#x635F;&#x5931;&#xFF08;&#x4E0D;&#x662F;&#x4E00;&#x6982;&#x800C;&#x8BBA;&#xFF0C;&#x53EA;&#x662F;&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x6CA1;&#x6709;&#x7279;&#x5B9A;&#x5927;&#x635F;&#x5931;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6BD4;&#x5982;&#x4E22;&#x9762;&#x5B50;&#x4E4B;&#x7C7B;&#x95EE;&#x9898;&#x7684;&#x5904;&#x7406;&#x6001;&#x5EA6;&#xFF09;</p>
<blockquote>
<p><strong>&#x5982;&#x679C;&#x4F60;&#x6CA1;&#x6709;&#x505A;&#x4ECA;&#x5929;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x4F60;&#x5C31;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x77E5;&#x9053;&#xFF0C;&#x7ED9;&#x81EA;&#x5DF1;&#x4E00;&#x4E9B;&#x538B;&#x529B;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x80FD;&#x591F;&#x505A;&#x5230;&#x4E9B;&#x4EC0;&#x4E48;&#x3002;&#x4E00;&#x4E2A;&#x4EBA;&#x89C9;&#x5F97;&#x6700;&#x5F15;&#x4EE5;&#x4E3A;&#x8C6A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5F80;&#x5F80;&#x662F;&#x90A3;&#x4E9B;&#x505A;&#x8D77;&#x6765;&#x6700;&#x8270;&#x96BE;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#x4F60;&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x5FD8;&#x8BB0;&#x3002;</strong></p>
</blockquote>
<p>&#x5176;&#x5B9E;&#x548C;&#x4E0A;&#x9762;&#x7684;&#x9053;&#x7406;&#x4E00;&#x81F4;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x5C06;&#x8FD9;&#x4E2A;&#x4F5C;&#x4E3A;&#x5355;&#x72EC;&#x7684;&#x63CF;&#x8FF0;&#x5217;&#x51FA;&#x6765;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x53E5;&#x8BDD;&#x8BF4;&#x5F97;&#x592A;&#x597D;&#x4E86;&#x3002;&#x975E;&#x5E38;&#x7684;&#x6709;&#x6FC0;&#x52B1;&#x6027;&#x3002;&#x300C;&#x4F60;&#x5F15;&#x4EE5;&#x4E3A;&#x8C6A;&#x300D;&#x7684;&#x4E8B;&#x60C5;&#x4E00;&#x5B9A;&#x662F;&#x505A;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x8270;&#x96BE;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4F60;&#x6C38;&#x8FDC;&#x4E0D;&#x8981;&#x5FD8;&#x8BB0;&#x3002;</p>
<blockquote>
<p>&#x4E0D;&#x8981;&#x4E3A;&#x5931;&#x53BB;&#x7684;&#x4E1C;&#x897F;&#x5FE7;&#x4F24;&#xFF0C;&#x800C;&#x8981;&#x5BF9;&#x62E5;&#x6709;&#x5979;&#x7684;&#x65F6;&#x5149;&#x8FDB;&#x884C;&#x611F;&#x6FC0;&#x3002;</p>
</blockquote>
<p>miss somebody but treasure her forever&#x3002;</p>

      
    </div>

    
      

  <div class="popular-posts-header">相关文章</div>
  <ul class="popular-posts">
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/02/01/the-art-of-unix-programming-reading-notes/" rel="bookmark">《The Art of UNIX Programming》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/08/07/book-change-the-conversation-learn-note/" rel="bookmark">《解决冲突的关键技巧》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/06/28/book-thinking-about-running-md/" rel="bookmark">《当我跑步时我谈些什么》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/02/02/code-complete-2-learn-note/" rel="bookmark">《Code Complete 2》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/03/24/book-liaoge-linux-course-md/" rel="bookmark">《鸟哥的Linux私房菜》读书笔记</a></div>
      
    </li>
  
  </ul>


    

    
    
    

    

    

    
      <div>
        <ul class="post-copyright">
  <li class="post-copyright-author">
    <strong>本文作者： </strong>whiledoing</li>
  <li class="post-copyright-link">
    <strong>本文链接：</strong>
    <a href="http://whiledoing.me/2017/11/30/money-hacker-reading-note/" title="《富爸爸穷爸爸》&《小狗钱钱》读书笔记">http://whiledoing.me/2017/11/30/money-hacker-reading-note/</a>
  </li>
  <li class="post-copyright-license">
    <strong>版权声明： </strong>本博客所有文章除特别声明外，均采用 <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/" rel="external nofollow" target="_blank">CC BY-NC-SA 4.0</a> 许可协议。转载请注明出处！</li>
</ul>

      </div>
    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/读书笔记/" rel="tag"># 读书笔记</a>
          
            <a href="/tags/理财/" rel="tag"># 理财</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2017/06/14/fenglun-talk-about-life-and-career/" rel="next" title="冯仑 - 「职场相对论」演讲听后感 - 如何平衡欲望和能力">
                <i class="fa fa-chevron-left"></i> 冯仑 - 「职场相对论」演讲听后感 - 如何平衡欲望和能力
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2017/12/07/diary/diary-2017-12-06-WED/" rel="prev" title="diary-2017-12-06-WED">
                diary-2017-12-06-WED <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <img class="site-author-image" itemprop="image"
                src="/images/avatar.jpeg"
                alt="whiledoing" />
            
              <p class="site-author-name" itemprop="name">whiledoing</p>
              <p class="site-description motion-element" itemprop="description">喜欢一切简单且美的事物，包括人。</p>
          </div>

          
            <nav class="site-state motion-element">
              
                <div class="site-state-item site-state-posts">
                
                  <a href="/archives/">
                
                    <span class="site-state-item-count">52</span>
                    <span class="site-state-item-name">日志</span>
                  </a>
                </div>
              

              

              
                
                
                <div class="site-state-item site-state-tags">
                  <a href="/tags/index.html">
                    
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                    <span class="site-state-item-count">28</span>
                    <span class="site-state-item-name">标签</span>
                  </a>
                </div>
              
            </nav>
          

          

          
            <div class="links-of-author motion-element">
              
                <span class="links-of-author-item">
                  <a href="https://github.com/whiledoing" target="_blank" title="GitHub">GitHub</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="http://www.douban.com/people/58249409" target="_blank" title="豆瓣">豆瓣</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="https://www.zhihu.com/people/whiledoing" target="_blank" title="知乎">知乎</a>
                  
                </span>
              
            </div>
          

          
          

          
          

          
            
          
          

        </div>
      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#富爸爸穷爸爸"><span class="nav-number">1.</span> <span class="nav-text">《富爸爸穷爸爸》</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#小狗钱钱"><span class="nav-number">2.</span> <span class="nav-text">《小狗钱钱》</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; 2016 &mdash; <span itemprop="copyrightYear">2018</span>
  <span class="with-love" id="animate">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">whiledoing</span>

  

  
</div>




  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动 v3.7.1</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/theme-next/hexo-theme-next">NexT.Mist</a> v6.2.0</div>




        








        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>
























  



  
  
    <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/reading_progress/reading_progress.js"></script>
  


  


  <script type="text/javascript" src="/js/src/utils.js?v=6.2.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=6.2.0"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=6.2.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=6.2.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=6.2.0"></script>



  



	





  





  










  

  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    var isXml = true;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length === 0) {
      search_path = "search.xml";
    } else if (/json$/i.test(search_path)) {
      isXml = false;
    }
    var path = "/" + search_path;
    // monitor main search box;

    var onPopupClose = function (e) {
      $('.popup').hide();
      $('#local-search-input').val('');
      $('.search-result-list').remove();
      $('#no-result').remove();
      $(".local-search-pop-overlay").remove();
      $('body').css('overflow', '');
    }

    function proceedsearch() {
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay"></div>')
        .css('overflow', 'hidden');
      $('.search-popup-overlay').click(onPopupClose);
      $('.popup').toggle();
      var $localSearchInput = $('#local-search-input');
      $localSearchInput.attr("autocapitalize", "none");
      $localSearchInput.attr("autocorrect", "off");
      $localSearchInput.focus();
    }

    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';

      // start loading animation
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay">' +
          '<div id="search-loading-icon">' +
          '<i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>' +
          '</div>' +
          '</div>')
        .css('overflow', 'hidden');
      $("#search-loading-icon").css('margin', '20% auto 0 auto').css('text-align', 'center');

      

      $.ajax({
        url: path,
        dataType: isXml ? "xml" : "json",
        async: true,
        success: function(res) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = isXml ? $("entry", res).map(function() {
            return {
              title: $("title", this).text(),
              content: $("content",this).text(),
              url: $("url" , this).text()
            };
          }).get() : res;
          var input = document.getElementById(search_id);
          var resultContent = document.getElementById(content_id);
          var inputEventFunction = function() {
            var searchText = input.value.trim().toLowerCase();
            var keywords = searchText.split(/[\s\-]+/);
            if (keywords.length > 1) {
              keywords.push(searchText);
            }
            var resultItems = [];
            if (searchText.length > 0) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var hitCount = 0;
                var searchTextCount = 0;
                var title = data.title.trim();
                var titleInLowerCase = title.toLowerCase();
                var content = data.content.trim().replace(/<[^>]+>/g,"");
                
                var contentInLowerCase = content.toLowerCase();
                var articleUrl = decodeURIComponent(data.url);
                var indexOfTitle = [];
                var indexOfContent = [];
                // only match articles with not empty titles
                if(title != '') {
                  keywords.forEach(function(keyword) {
                    function getIndexByWord(word, text, caseSensitive) {
                      var wordLen = word.length;
                      if (wordLen === 0) {
                        return [];
                      }
                      var startPosition = 0, position = [], index = [];
                      if (!caseSensitive) {
                        text = text.toLowerCase();
                        word = word.toLowerCase();
                      }
                      while ((position = text.indexOf(word, startPosition)) > -1) {
                        index.push({position: position, word: word});
                        startPosition = position + wordLen;
                      }
                      return index;
                    }

                    indexOfTitle = indexOfTitle.concat(getIndexByWord(keyword, titleInLowerCase, false));
                    indexOfContent = indexOfContent.concat(getIndexByWord(keyword, contentInLowerCase, false));
                  });
                  if (indexOfTitle.length > 0 || indexOfContent.length > 0) {
                    isMatch = true;
                    hitCount = indexOfTitle.length + indexOfContent.length;
                  }
                }

                // show search results

                if (isMatch) {
                  // sort index by position of keyword

                  [indexOfTitle, indexOfContent].forEach(function (index) {
                    index.sort(function (itemLeft, itemRight) {
                      if (itemRight.position !== itemLeft.position) {
                        return itemRight.position - itemLeft.position;
                      } else {
                        return itemLeft.word.length - itemRight.word.length;
                      }
                    });
                  });

                  // merge hits into slices

                  function mergeIntoSlice(text, start, end, index) {
                    var item = index[index.length - 1];
                    var position = item.position;
                    var word = item.word;
                    var hits = [];
                    var searchTextCountInSlice = 0;
                    while (position + word.length <= end && index.length != 0) {
                      if (word === searchText) {
                        searchTextCountInSlice++;
                      }
                      hits.push({position: position, length: word.length});
                      var wordEnd = position + word.length;

                      // move to next position of hit

                      index.pop();
                      while (index.length != 0) {
                        item = index[index.length - 1];
                        position = item.position;
                        word = item.word;
                        if (wordEnd > position) {
                          index.pop();
                        } else {
                          break;
                        }
                      }
                    }
                    searchTextCount += searchTextCountInSlice;
                    return {
                      hits: hits,
                      start: start,
                      end: end,
                      searchTextCount: searchTextCountInSlice
                    };
                  }

                  var slicesOfTitle = [];
                  if (indexOfTitle.length != 0) {
                    slicesOfTitle.push(mergeIntoSlice(title, 0, title.length, indexOfTitle));
                  }

                  var slicesOfContent = [];
                  while (indexOfContent.length != 0) {
                    var item = indexOfContent[indexOfContent.length - 1];
                    var position = item.position;
                    var word = item.word;
                    // cut out 100 characters
                    var start = position - 20;
                    var end = position + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if (end < position + word.length) {
                      end = position + word.length;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    slicesOfContent.push(mergeIntoSlice(content, start, end, indexOfContent));
                  }

                  // sort slices in content by search text's count and hits' count

                  slicesOfContent.sort(function (sliceLeft, sliceRight) {
                    if (sliceLeft.searchTextCount !== sliceRight.searchTextCount) {
                      return sliceRight.searchTextCount - sliceLeft.searchTextCount;
                    } else if (sliceLeft.hits.length !== sliceRight.hits.length) {
                      return sliceRight.hits.length - sliceLeft.hits.length;
                    } else {
                      return sliceLeft.start - sliceRight.start;
                    }
                  });

                  // select top N slices in content

                  var upperBound = parseInt('1');
                  if (upperBound >= 0) {
                    slicesOfContent = slicesOfContent.slice(0, upperBound);
                  }

                  // highlight title and content

                  function highlightKeyword(text, slice) {
                    var result = '';
                    var prevEnd = slice.start;
                    slice.hits.forEach(function (hit) {
                      result += text.substring(prevEnd, hit.position);
                      var end = hit.position + hit.length;
                      result += '<b class="search-keyword">' + text.substring(hit.position, end) + '</b>';
                      prevEnd = end;
                    });
                    result += text.substring(prevEnd, slice.end);
                    return result;
                  }

                  var resultItem = '';

                  if (slicesOfTitle.length != 0) {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + highlightKeyword(title, slicesOfTitle[0]) + "</a>";
                  } else {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + title + "</a>";
                  }

                  slicesOfContent.forEach(function (slice) {
                    resultItem += "<a href='" + articleUrl + "'>" +
                      "<p class=\"search-result\">" + highlightKeyword(content, slice) +
                      "...</p>" + "</a>";
                  });

                  resultItem += "</li>";
                  resultItems.push({
                    item: resultItem,
                    searchTextCount: searchTextCount,
                    hitCount: hitCount,
                    id: resultItems.length
                  });
                }
              })
            };
            if (keywords.length === 1 && keywords[0] === "") {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>'
            } else if (resultItems.length === 0) {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>'
            } else {
              resultItems.sort(function (resultLeft, resultRight) {
                if (resultLeft.searchTextCount !== resultRight.searchTextCount) {
                  return resultRight.searchTextCount - resultLeft.searchTextCount;
                } else if (resultLeft.hitCount !== resultRight.hitCount) {
                  return resultRight.hitCount - resultLeft.hitCount;
                } else {
                  return resultRight.id - resultLeft.id;
                }
              });
              var searchResultList = '<ul class=\"search-result-list\">';
              resultItems.forEach(function (result) {
                searchResultList += result.item;
              })
              searchResultList += "</ul>";
              resultContent.innerHTML = searchResultList;
            }
          }

          if ('auto' === 'auto') {
            input.addEventListener('input', inputEventFunction);
          } else {
            $('.search-icon').click(inputEventFunction);
            input.addEventListener('keypress', function (event) {
              if (event.keyCode === 13) {
                inputEventFunction();
              }
            });
          }

          // remove loading animation
          $(".local-search-pop-overlay").remove();
          $('body').css('overflow', '');

          proceedsearch();
        }
      });
    }

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched === false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(onPopupClose);
    $('.popup').click(function(e){
      e.stopPropagation();
    });
    $(document).on('keyup', function (event) {
      var shouldDismissSearchPopup = event.which === 27 &&
        $('.search-popup').is(':visible');
      if (shouldDismissSearchPopup) {
        onPopupClose();
      }
    });
  </script>





  

  

  
<script>
(function(){
    var bp = document.createElement('script');
    var curProtocol = window.location.protocol.split(':')[0];
    if (curProtocol === 'https') {
        bp.src = 'https://zz.bdstatic.com/linksubmit/push.js';        
    }
    else {
        bp.src = 'http://push.zhanzhang.baidu.com/push.js';
    }
    var s = document.getElementsByTagName("script")[0];
    s.parentNode.insertBefore(bp, s);
})();
</script>


  
  

  
  

  


  
  

  
  
  
  <script src="/lib/pangu/dist/pangu.min.js?v=3.3"></script>
  <script type="text/javascript">pangu.spacingPage();</script>


  
  <script type="text/javascript" src="/js/src/js.cookie.js?v=6.2.0"></script>
  <script type="text/javascript" src="/js/src/scroll-cookie.js?v=6.2.0"></script>


  

  

  
  <style>
      .copy-btn {
          display: inline-block;
          padding: 6px 12px;
          font-size: 13px;
          font-weight: 700;
          line-height: 20px;
          color: #333;
          white-space: nowrap;
          vertical-align: middle;
          cursor: pointer;
          background-color: #eee;
          background-image: linear-gradient(#fcfcfc, #eee);
          border: 1px solid #d5d5d5;
          border-radius: 3px;
          user-select: none;
      }

      .highlight-wrap .copy-btn {
          transition: opacity .3s ease-in-out;
          opacity: 0;
          padding: 2px 6px;
          position: fixed;
          right: 4px;
          top: 8px;
      }

      .highlight-wrap:hover .copy-btn,
      .highlight-wrap .copy-btn:focus {
          opacity: 1
      }

      .highlight-wrap {
          transform: translateZ(0);
      }
  </style>
  <script>
      $('.highlight').each(function(i, e) {
          var $wrap = $('<div>').addClass('highlight-wrap')
          $(e).after($wrap)
          $wrap.append($('<button>').addClass('copy-btn').append('复制').on('click', function(e) {
              var code = $(e.target).parent().find('.code').find('.line').map(function(i, e) {
                  return $(e).text()
              }).toArray().join('\n')
              var ta = document.createElement('textarea')
              document.body.appendChild(ta)
              ta.style.position = 'fixed'
              ta.style.top = 0
              ta.style.left = 0
              ta.value = code
              ta.select()
              ta.focus()
              document.execCommand('copy')
              document.body.removeChild(ta)
          })).append(e)
      })
  </script>


</body>
</html>
