<!DOCTYPE html>



  


<html class="theme-next mist use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>
<meta name="theme-color" content="#222">






  
  
  <link rel="stylesheet" media="all" href="/lib/Han/dist/han.min.css?v=3.3">




<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />
















  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />







<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.3" rel="stylesheet" type="text/css" />


  <link rel="apple-touch-icon" sizes="180x180" href="/favicon.png?v=5.1.3">


  <link rel="icon" type="image/png" sizes="32x32" href="/favicon.png?v=5.1.3">


  <link rel="icon" type="image/png" sizes="16x16" href="/favicon.png?v=5.1.3">


  <link rel="mask-icon" href="/favicon.png?v=5.1.3" color="#222">





  <meta name="keywords" content="自写,职场," />










<meta name="description" content="&amp;#x5927;&amp;#x4F6C;&amp;#x51AF;&amp;#x4ED1;&amp;#x6765;&amp;#x516C;&amp;#x53F8;&amp;#x505A;&amp;#x4E86;&amp;#x573A;&amp;#x5173;&amp;#x4E8E;&amp;#x300C;&amp;#x804C;&amp;#x573A;&amp;#x300D;&amp;#x7684;&amp;#x4E3B;&amp;#x9898;&amp;#x62A5;&amp;#x544A;&amp;#xFF0C;&amp;#x653E;&amp;#x4E0B;&amp;#x5DE5;">
<meta property="og:type" content="article">
<meta property="og:title" content="冯仑 - 「职场相对论」演讲听后感 - 如何平衡欲望和能力">
<meta property="og:url" content="http://whiledoing.github.io/2017/06/14/fenglun-talk-about-life-and-career/index.html">
<meta property="og:site_name" content="whiledoing">
<meta property="og:description" content="&amp;#x5927;&amp;#x4F6C;&amp;#x51AF;&amp;#x4ED1;&amp;#x6765;&amp;#x516C;&amp;#x53F8;&amp;#x505A;&amp;#x4E86;&amp;#x573A;&amp;#x5173;&amp;#x4E8E;&amp;#x300C;&amp;#x804C;&amp;#x573A;&amp;#x300D;&amp;#x7684;&amp;#x4E3B;&amp;#x9898;&amp;#x62A5;&amp;#x544A;&amp;#xFF0C;&amp;#x653E;&amp;#x4E0B;&amp;#x5DE5;">
<meta property="og:updated_time" content="2017-11-30T07:30:21.666Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="冯仑 - 「职场相对论」演讲听后感 - 如何平衡欲望和能力">
<meta name="twitter:description" content="&amp;#x5927;&amp;#x4F6C;&amp;#x51AF;&amp;#x4ED1;&amp;#x6765;&amp;#x516C;&amp;#x53F8;&amp;#x505A;&amp;#x4E86;&amp;#x573A;&amp;#x5173;&amp;#x4E8E;&amp;#x300C;&amp;#x804C;&amp;#x573A;&amp;#x300D;&amp;#x7684;&amp;#x4E3B;&amp;#x9898;&amp;#x62A5;&amp;#x544A;&amp;#xFF0C;&amp;#x653E;&amp;#x4E0B;&amp;#x5DE5;">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    version: '5.1.3',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":true,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://whiledoing.github.io/2017/06/14/fenglun-talk-about-life-and-career/"/>





  <title>冯仑 - 「职场相对论」演讲听后感 - 如何平衡欲望和能力 | whiledoing</title>
  








</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/"  class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">whiledoing</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">喜欢一切简单且美的事物，包括人。</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br />
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup search-popup local-search-popup">
  <div class="local-search-header clearfix">
    <span class="search-icon">
      <i class="fa fa-search"></i>
    </span>
    <span class="popup-btn-close">
      <i class="fa fa-times-circle"></i>
    </span>
    <div class="local-search-input-wrapper">
      <input autocomplete="off"
             placeholder="搜索..." spellcheck="false"
             type="text" id="local-search-input">
    </div>
  </div>
  <div id="local-search-result"></div>
</div>



    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://whiledoing.github.io/2017/06/14/fenglun-talk-about-life-and-career/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="whiledoing">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/img/avatar.jpeg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="whiledoing">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">冯仑 - 「职场相对论」演讲听后感 - 如何平衡欲望和能力</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2017-06-14T15:34:22+08:00">
                2017-06-14
              </time>
            

            
              <span class="post-meta-divider">|</span>
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-check-o"></i>
              </span>
              
                <span class="post-meta-item-text">更新于&#58;</span>
              
              <time title="更新于" itemprop="dateModified" datetime="2017-11-30T15:30:21+08:00">
                2017-11-30
              </time>
            
          </span>

          

          
            
          

          
          

          

          
            <div class="post-wordcount">
              
                
                  <span class="post-meta-divider">|</span>
                
                <span class="post-meta-item-icon">
                  <i class="fa fa-file-word-o"></i>
                </span>
                
                  <span class="post-meta-item-text">字数统计&#58;</span>
                
                <span title="字数统计">
                  1,029
                </span>
              

              

              
            </div>
          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body han-init-context" itemprop="articleBody">

      
      

      
        <p>&#x5927;&#x4F6C;&#x51AF;&#x4ED1;&#x6765;&#x516C;&#x53F8;&#x505A;&#x4E86;&#x573A;&#x5173;&#x4E8E;&#x300C;&#x804C;&#x573A;&#x300D;&#x7684;&#x4E3B;&#x9898;&#x62A5;&#x544A;&#xFF0C;&#x653E;&#x4E0B;&#x5DE5;&#x4F5C;&#x4E5F;&#x8981;&#x53BB;&#x542C;&#x4E00;&#x4E0B;&#x3002;&#x6574;&#x4E2A;&#x62A5;&#x544A;&#x5385;&#x5EA7;&#x65E0;&#x865A;&#x5E2D;&#xFF0C;&#x5927;&#x4F6C;&#x5F71;&#x54CD;&#x529B;&#x53EF;&#x89C1;&#x4E00;&#x6591;&#x3002;</p>
<p>&#x5927;&#x4F6C;&#x7684;&#x6F14;&#x8BB2;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x4E00;&#x79CD;&#x300C;&#x6709;&#x6846;&#x67B6;&#x5F0F;&#x7684;&#x6F2B;&#x8C08;&#x300D;&#xFF0C;&#x56E0;&#x4E3A;&#x4EBA;&#x751F;&#x9605;&#x5386;&#x4E30;&#x5BCC;&#xFF0C;&#x6240;&#x4EE5;&#x6F2B;&#x8C08;&#x90FD;&#x89C9;&#x5F97;&#x5F88;&#x5E26;&#x52B2;&#x3002;&#x5927;&#x4F6C;&#x5148;&#x662F;&#x8BB2;&#x8D77;&#x81EA;&#x5DF1;&#x4EBA;&#x751F;&#x7ECF;&#x5386;&#xFF1A;&#x4E2D;&#x56FD;&#x7B2C;&#x4E00;&#x6279;&#x6539;&#x9769;&#x5F00;&#x653E;&#x4E4B;&#x540E;&#x7684;&#x5927;&#x5B66;&#x751F;&#xFF0C;&#x4E00;&#x8DEF;&#x8BFB;&#x5230;&#x7814;&#x7A76;&#x751F;&#x3002;&#x6BD5;&#x4E1A;&#x524D;&#x4E94;&#x5E74;&#x5728;&#x56FD;&#x5BB6;&#x5355;&#x4F4D;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E94;&#x5E74;&#x4E4B;&#x540E;&#xFF0C;&#x559C;&#x6B22;&#x6298;&#x817E;&#x7684;&#x6027;&#x683C;&#x63A8;&#x8FDB;&#x4ED6;&#x51FA;&#x6765;&#x521B;&#x4E1A;&#x3002;&#x6240;&#x4EE5;&#x5982;&#x540C;&#x5927;&#x4F6C;&#x81EA;&#x5DF1;&#x8BF4;&#x7684;&#x90A3;&#x6837;&#x5B50;&#xFF0C;&#x81EA;&#x5DF1;&#x6253;&#x5DE5;&#x7684;&#x4EBA;&#x751F;&#x5F88;&#x77ED;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x53EF;&#x4EE5;&#x4ECB;&#x7ECD;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x4E00;&#x70B9;&#xFF0C;&#x5C31;&#x662F;&#x559C;&#x6B22;&#x6298;&#x817E;&#xFF0C;&#x4E0D;&#x53BB;&#x8003;&#x8651;&#x56FD;&#x5B57;&#x5934;&#x5355;&#x4F4D;&#x51E0;&#x5E74;&#x5206;&#x623F;&#x7B49;&#x300C;&#x7ED1;&#x5B9A;&#x6027;&#x300D;&#x653F;&#x7B56;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x8003;&#x8651;&#xFF0C;&#x6240;&#x4EE5;&#x6B32;&#x671B;&#x4F4E;&#xFF0C;&#x653E;&#x5F97;&#x5F00;&#xFF0C;&#x4E5F;&#x4E0D;&#x4E3A;&#x6B64;&#x800C;&#x7126;&#x8651;&#xFF0C;&#x66F4;&#x591A;&#x8003;&#x8651;&#x81EA;&#x5DF1;&#x7684;&#x53D1;&#x5C55;&#x548C;&#x594B;&#x6597;&#x3002;</p>
<p>&#x4E3B;&#x9898;&#x4E00;&#x4E0B;&#x5B50;&#x5C31;&#x8DF3;&#x51FA;&#x4E86;&#x300C;&#x804C;&#x573A;&#x300D;&#x8FDB;&#x5165;&#x5230;&#x300C;&#x7126;&#x8651;&#x300D;&#x548C;&#x300C;&#x9009;&#x62E9;&#x300D;&#x4E0A;&#x3002;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x9047;&#x5230;&#x7684;&#x7126;&#x8651;&#x591A;&#x6570;&#x6765;&#x81EA;&#x4E8E;&#x300C;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x9009;&#x62E9;&#x300D;&#x592A;&#x591A;&#xFF0C;&#x5982;&#x679C;&#x786E;&#x5B9A;&#x4E86;&#xFF0C;&#x4E5F;&#x5C31;&#x4E0D;&#x7126;&#x8651;&#x4E86;&#x3002;&#x800C;&#x9009;&#x62E9;&#x4E0D;&#x4EC5;&#x591A;&#xFF0C;&#x800C;&#x4E14;&#x4E0D;&#x786E;&#x5B9A;&#x3002;&#x672A;&#x77E5;&#x7684;&#x98CE;&#x9669;&#x4F1A;&#x8BA9;&#x6211;&#x4EEC;&#x7126;&#x8651;&#x800C;&#x505A;&#x4E0D;&#x51FA;&#x53CA;&#x65F6;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
<p>&#x4EBA;&#x7126;&#x8651;&#x7684;&#x70B9;&#x4E3B;&#x8981;&#x6709;&#x4E09;&#x4E2A;&#x5C42;&#x9762;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x94B1;&#x7684;&#x591A;&#x5C11;&#xFF0C;&#x4E8C;&#x662F;&#x5FEB;&#x4E50;&#x548C;&#x75DB;&#x82E6;&#x7684;&#x591A;&#x5C11;&#xFF0C;&#x4E09;&#x662F;&#x751F;&#x6B7B;&#x7684;&#x95EE;&#x9898;&#x3002;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x8981;&#x89E3;&#x51B3;&#x7126;&#x8651;&#xFF0C;&#x5C31;&#x662F;&#x89E3;&#x51B3;&#x300C;&#x591A;&#x5C11;/&#x5FEB;&#x4E50;/&#x751F;&#x6B7B;&#x300D;&#x8FD9;&#x51E0;&#x4E2A;&#x7EF4;&#x5EA6;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5927;&#x4F6C;&#x7684;&#x8BBA;&#x8BC1;&#x65B9;&#x5F0F;&#x662F;&#x5148;&#x770B;&#x4E0B;&#x4EC0;&#x4E48;&#x4EBA;&#x4E0D;&#x7126;&#x8651;: &#x6709;&#x4FE1;&#x4EF0;&#x7684;&#x4EBA;&#xFF08;&#x5927;&#x4F6C;&#x5E94;&#x8BE5;&#x662F;&#x975E;&#x5E38;&#x4FE1;&#x4EF0;&#x7684;&#x4EBA;&#xFF0C;&#x4E00;&#x76F4;&#x5728;&#x56F4;&#x7ED5;&#x8FD9;&#x4E9B;&#x6765;&#x8BF4;&#xFF09;&#x3002;&#x57FA;&#x7763;&#x6559;&#x548C;&#x4F0A;&#x65AF;&#x5170;&#x6559;&#x89E3;&#x51B3;&#x7126;&#x8651;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5F15;&#x5165;&#x795E;&#x7075;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x795E;&#x7684;&#x65E8;&#x610F;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x4E0D;&#x4F1A;&#x592A;&#x7126;&#x8651;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x7126;&#x8651;&#x4E5F;&#x6CA1;&#x6709;&#x7528;&#xFF0C;&#x964D;&#x4F4E;&#x4E86;&#x4EBA;&#x4EEC;&#x601D;&#x7EF4;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x3002;&#x800C;&#x53E6;&#x4E00;&#x4E2A;&#x662F;&#x4F5B;&#x6559;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F5B;&#x5BB6;&#x8BB2;&#x7A76;&#x81EA;&#x8EAB;&#x7684;&#x4FEE;&#x884C;&#xFF0C;&#x8FDB;&#x800C;&#x964D;&#x4F4E;&#x81EA;&#x8EAB;&#x7684;&#x6B32;&#x671B;&#x3002;&#x4EBA;&#x7684;&#x6B32;&#x671B;&#x5C11;&#x4E86;&#xFF0C;&#x81EA;&#x7136;&#x4E5F;&#x4E0D;&#x4F1A;&#x663E;&#x7684;&#x7279;&#x522B;&#x7126;&#x8651;&#x3002;</p>
<p>&#x5927;&#x4F6C;&#x4E3A;&#x6B64;&#x8BF4;&#x4E86;&#x4E00;&#x4E2A;&#x5F88;&#x6709;&#x610F;&#x601D;&#x7684;&#x4EBA;&#x6027;&#x5206;&#x6790;&#xFF1A;&#x5982;&#x679C;&#x7ECF;&#x6D4E;&#x53D1;&#x5C55;&#x5BFC;&#x81F4;&#x91D1;&#x94B1;&#x7684;&#x589E;&#x591A;&#x662F;&#x7EBF;&#x6027;&#x589E;&#x957F;&#x7684;&#x8BDD;&#xFF0C;&#x968F;&#x4E4B;&#x800C;&#x6765;&#x7684;&#x6B32;&#x671B;&#x589E;&#x957F;&#x5C31;&#x662F;&#x6307;&#x6570;&#x7EA7;&#xFF0C;&#x8FD9;&#x662F;&#x4EBA;&#x6027;&#x3002;&#x4EBA;&#x5BF9;&#x4E8E;&#x94B1;&#x65B9;&#x9762;&#x7684;&#x7126;&#x8651;&#x4E0D;&#x4F1A;&#x968F;&#x7740;&#x7ECF;&#x6D4E;&#x7684;&#x6539;&#x5584;&#x800C;&#x964D;&#x4F4E;&#xFF0C;&#x53CD;&#x800C;&#x4F1A;&#x589E;&#x52A0;&#x3002;&#x6240;&#x4EE5;&#x7ECF;&#x6D4E;&#x597D;&#x7684;&#x5730;&#x65B9;&#x53CD;&#x800C;&#x53EF;&#x80FD;&#x6709;&#x66F4;&#x591A;&#x7684;&#x4FE1;&#x4EF0;&#xFF0C;&#x5927;&#x4F6C;&#x7279;&#x522B;&#x8BF4;&#x4E86;&#x53F0;&#x6E7E;&#xFF0C;&#x8BF4;&#x53F0;&#x6E7E;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x5B50;&#xFF1A;&#x7ECF;&#x6D4E;&#x53D1;&#x5C55;&#x5230;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x540E;&#xFF0C;&#x66F4;&#x591A;&#x4E2D;&#x4EA7;&#x9636;&#x7EA7;&#x5F00;&#x59CB;&#x4FE1;&#x6559;&#xFF0C;&#x5728;&#x7269;&#x8D28;&#x8FFD;&#x6C42;&#x5230;&#x8FBE;&#x4E00;&#x4E2A;&#x70B9;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x4F1A;&#x7528;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x5E73;&#x8861;&#x4EBA;&#x6027;&#x7684;&#x6B32;, &#x542C;&#x8D77;&#x6765;&#x786E;&#x5B9E;&#x5F88;&#x6709;&#x9053;&#x7406;&#x3002;</p>
<p>&#x6700;&#x540E;&#x5F88;&#x6709;&#x610F;&#x601D;&#xFF0C;&#x505A;&#x4E3A;&#x641E;&#x5730;&#x4EA7;&#x7684;&#x5927;&#x4F6C;&#x8C08;&#x4E86;&#x8C08;&#x81EA;&#x5DF1;&#x5BF9;&#x4E8E;&#x300C;&#x5E74;&#x8F7B;&#x4EBA;&#x4E70;&#x623F;&#x300D;&#x7684;&#x89C2;&#x70B9;&#x3002;&#x5148;&#x662F;&#x8BF4;&#x4E86;&#x4E0B;&#x8861;&#x91CF;&#x623F;&#x4EF7;&#x662F;&#x5426;&#x4E0A;&#x6DA8;&#x7684;&#x6307;&#x6807;&#xFF1A;1&#xFF09;&#x4EBA;&#x5747;&#x662F;&#x5426;&#x5230;&#x4E86;8K&#x7F8E;&#x91D1;&#xFF0C;&#x5982;&#x679C;&#x8D85;&#x8FC7;&#xFF0C;&#x623F;&#x4EF7;&#x4E00;&#x822C;&#x4F1A;&#x7A33;&#x5B9A; 2&#xFF09;&#x653F;&#x7B56; 3&#xFF09;&#x4EBA;&#x53E3;&#x51C0;&#x5165;&#x6BD4; 4&#xFF09;&#x51FA;&#x552E;&#x65B0;&#x623F;&#x548C;&#x65E7;&#x623F;&#x7684;&#x6BD4;&#x4F8B;&#xFF0C;&#x5982;&#x679C;&#x65B0;&#x623F;&#x591A;&#x4F59;&#x65E7;&#x623F;&#xFF0C;&#x4F1A;&#x6DA8;&#x3002;5&#xFF09;&#x5173;&#x952E;&#x8BF4;&#x4E86;&#x6700;&#x540E;&#x4E00;&#x70B9;&#xFF0C;&#x56FD;&#x4EBA;&#x4E70;&#x623F;&#x7684;&#x6D88;&#x8D39;&#x662F;&#x4E00;&#x79CD;&#x5E94;&#x6FC0;&#x4E0A;&#x6DA8;&#x7684;&#x5FAA;&#x73AF;&#xFF0C;&#x8D8A;&#x89C9;&#x5F97;&#x4E0A;&#x6DA8;&#x8D8A;&#x4E70;&#xFF0C;&#x8D8A;&#x4E70;&#x8D8A;&#x957F;&#x3002;&#x4ECE;&#x51E0;&#x4E2A;&#x6570;&#x636E;&#x6765;&#x770B;&#xFF0C;&#x676D;&#x5DDE;&#x7684;&#x623F;&#x4EF7;&#x90FD;&#x4F1A;&#x6162;&#x6162;&#x8D8B;&#x4E8E;&#x7A33;&#x5B9A;&#xFF0C;&#x6240;&#x4EE5;&#x5927;&#x4F6C;&#x7684;&#x5EFA;&#x8BAE;&#x662F;<strong>&#x5E74;&#x8F7B;&#x4EBA;&#x53EF;&#x4EE5;&#x4E0D;&#x7528;&#x8FD9;&#x4E48;&#x7740;&#x6025;&#x4E70;&#x623F;</strong>&#xFF0C;&#x8FD9;&#x8FD8;&#x771F;&#x662F;&#x7B2C;&#x4E00;&#x6B21;&#x542C;&#x4E00;&#x4F4D;&#x5730;&#x4EA7;&#x5927;&#x4F6C;&#x5EFA;&#x8BAE;&#x8BF4;&#x4E0D;&#x8981;&#x6025;&#x7740;&#x4E70;&#x623F;&#x3002;&#x56FD;&#x5916;&#x4EBA;&#x4E70;&#x623F;&#x7684;&#x5E73;&#x5747;&#x5E74;&#x9F84;&#x662F;35&#x5C81;&#xFF0C;&#x800C;&#x4E2D;&#x56FD;&#x4EBA;&#x662F;27&#x5C81;&#x3002;&#x5927;&#x4F6C;&#x81EA;&#x5DF1;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x5B50;&#xFF0C;&#x867D;&#x7136;&#x4E00;&#x76F4;&#x505A;&#x623F;&#x5730;&#x4EA7;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x662F;35&#x5C81;&#x624D;&#x4E70;&#x7684;&#x4EBA;&#x751F;&#x7B2C;&#x4E00;&#x5957;&#x623F;&#x5B50;&#x3002;</p>
<p>&#x603B;&#x7684;&#x8BF4;&#x6765;&#x7406;&#x89E3;&#x5230;&#x7684;&#x4E8B;&#x60C5;&#xFF1A;</p>
<ol>
<li>&#x4EBA;&#x751F;&#x8981;&#x4F1A;&#x6298;&#x817E;&#xFF0C;&#x4E0D;&#x8981;&#x603B;&#x662F;&#x60F3;&#x7740;&#x4E00;&#x6210;&#x4E0D;&#x53D8;&#x675F;&#x7F1A;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x8FD9;&#x6837;&#x5B50;&#x4E5F;&#x4F1A;&#x51CF;&#x4F4E;&#x81EA;&#x5DF1;&#x7684;&#x6B32;&#x671B;&#x3002;</li>
<li>&#x627E;&#x5230;&#x5E73;&#x8861;&#x81EA;&#x5DF1;&#x6B32;&#x671B;&#x548C;&#x80FD;&#x529B;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x964D;&#x4F4E;&#x81EA;&#x5DF1;&#x7126;&#x8651;&#x7684;&#x6E90;&#x5934;&#xFF0C;&#x66F4;&#x597D;&#x6295;&#x5165;&#x4EBA;&#x751F;&#x594B;&#x6597;&#x3002;</li>
</ol>

      
    </div>
    
    
    

    

    

    
      <div>
        <ul class="post-copyright">
  <li class="post-copyright-author">
    <strong>本文作者：</strong>
    whiledoing
  </li>
  <li class="post-copyright-link">
    <strong>本文链接：</strong>
    <a href="http://whiledoing.github.io/2017/06/14/fenglun-talk-about-life-and-career/" title="冯仑 - 「职场相对论」演讲听后感 - 如何平衡欲望和能力">http://whiledoing.github.io/2017/06/14/fenglun-talk-about-life-and-career/</a>
  </li>
  <li class="post-copyright-license">
    <strong>版权声明： </strong>
    本博客所有文章除特别声明外，均采用 <a href="https://creativecommons.org/licenses/by-nc-sa/3.0/" rel="external nofollow" target="_blank">CC BY-NC-SA 3.0</a> 许可协议。转载请注明出处！
  </li>
</ul>

      </div>
    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/自写/" rel="tag"># 自写</a>
          
            <a href="/tags/职场/" rel="tag"># 职场</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2017/04/08/selling-is-everywhere/" rel="next" title="《销售无处不在》读书笔记">
                <i class="fa fa-chevron-left"></i> 《销售无处不在》读书笔记
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2017/11/30/money-hacker-reading-note/" rel="prev" title="《富爸爸穷爸爸》&《小狗钱钱》读书笔记">
                《富爸爸穷爸爸》&《小狗钱钱》读书笔记 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      

      <section class="site-overview-wrap sidebar-panel sidebar-panel-active">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <img class="site-author-image" itemprop="image"
                src="/img/avatar.jpeg"
                alt="whiledoing" />
            
              <p class="site-author-name" itemprop="name">whiledoing</p>
              <p class="site-description motion-element" itemprop="description">喜欢一切简单且美的事物，包括人。</p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="/archives/">
              
                  <span class="site-state-item-count">26</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            

            
              
              
              <div class="site-state-item site-state-tags">
                <a href="/tags/index.html">
                  <span class="site-state-item-count">24</span>
                  <span class="site-state-item-name">标签</span>
                </a>
              </div>
            

          </nav>

          

          <div class="links-of-author motion-element">
            
          </div>

          
          

          
          

          

        </div>
      </section>

      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; 2016 &mdash; <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">whiledoing</span>

  
    <span class="post-meta-divider">|</span>
    <span class="post-meta-item-icon">
      <i class="fa fa-area-chart"></i>
    </span>
    
      <span class="post-meta-item-text">Site words total count&#58;</span>
    
    <span title="Site words total count">61.8k</span>
  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Mist</a> v5.1.3</div>




        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
          <span id="scrollpercent"><span>0</span>%</span>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.3"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.3"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.3"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.3"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.3"></script>



  


  




	





  





  












  

  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    var isXml = true;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length === 0) {
      search_path = "search.xml";
    } else if (/json$/i.test(search_path)) {
      isXml = false;
    }
    var path = "/" + search_path;
    // monitor main search box;

    var onPopupClose = function (e) {
      $('.popup').hide();
      $('#local-search-input').val('');
      $('.search-result-list').remove();
      $('#no-result').remove();
      $(".local-search-pop-overlay").remove();
      $('body').css('overflow', '');
    }

    function proceedsearch() {
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay"></div>')
        .css('overflow', 'hidden');
      $('.search-popup-overlay').click(onPopupClose);
      $('.popup').toggle();
      var $localSearchInput = $('#local-search-input');
      $localSearchInput.attr("autocapitalize", "none");
      $localSearchInput.attr("autocorrect", "off");
      $localSearchInput.focus();
    }

    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';

      // start loading animation
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay">' +
          '<div id="search-loading-icon">' +
          '<i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>' +
          '</div>' +
          '</div>')
        .css('overflow', 'hidden');
      $("#search-loading-icon").css('margin', '20% auto 0 auto').css('text-align', 'center');

      $.ajax({
        url: path,
        dataType: isXml ? "xml" : "json",
        async: true,
        success: function(res) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = isXml ? $("entry", res).map(function() {
            return {
              title: $("title", this).text(),
              content: $("content",this).text(),
              url: $("url" , this).text()
            };
          }).get() : res;
          var input = document.getElementById(search_id);
          var resultContent = document.getElementById(content_id);
          var inputEventFunction = function() {
            var searchText = input.value.trim().toLowerCase();
            var keywords = searchText.split(/[\s\-]+/);
            if (keywords.length > 1) {
              keywords.push(searchText);
            }
            var resultItems = [];
            if (searchText.length > 0) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var hitCount = 0;
                var searchTextCount = 0;
                var title = data.title.trim();
                var titleInLowerCase = title.toLowerCase();
                var content = data.content.trim().replace(/<[^>]+>/g,"");
                var contentInLowerCase = content.toLowerCase();
                var articleUrl = decodeURIComponent(data.url);
                var indexOfTitle = [];
                var indexOfContent = [];
                // only match articles with not empty titles
                if(title != '') {
                  keywords.forEach(function(keyword) {
                    function getIndexByWord(word, text, caseSensitive) {
                      var wordLen = word.length;
                      if (wordLen === 0) {
                        return [];
                      }
                      var startPosition = 0, position = [], index = [];
                      if (!caseSensitive) {
                        text = text.toLowerCase();
                        word = word.toLowerCase();
                      }
                      while ((position = text.indexOf(word, startPosition)) > -1) {
                        index.push({position: position, word: word});
                        startPosition = position + wordLen;
                      }
                      return index;
                    }

                    indexOfTitle = indexOfTitle.concat(getIndexByWord(keyword, titleInLowerCase, false));
                    indexOfContent = indexOfContent.concat(getIndexByWord(keyword, contentInLowerCase, false));
                  });
                  if (indexOfTitle.length > 0 || indexOfContent.length > 0) {
                    isMatch = true;
                    hitCount = indexOfTitle.length + indexOfContent.length;
                  }
                }

                // show search results

                if (isMatch) {
                  // sort index by position of keyword

                  [indexOfTitle, indexOfContent].forEach(function (index) {
                    index.sort(function (itemLeft, itemRight) {
                      if (itemRight.position !== itemLeft.position) {
                        return itemRight.position - itemLeft.position;
                      } else {
                        return itemLeft.word.length - itemRight.word.length;
                      }
                    });
                  });

                  // merge hits into slices

                  function mergeIntoSlice(text, start, end, index) {
                    var item = index[index.length - 1];
                    var position = item.position;
                    var word = item.word;
                    var hits = [];
                    var searchTextCountInSlice = 0;
                    while (position + word.length <= end && index.length != 0) {
                      if (word === searchText) {
                        searchTextCountInSlice++;
                      }
                      hits.push({position: position, length: word.length});
                      var wordEnd = position + word.length;

                      // move to next position of hit

                      index.pop();
                      while (index.length != 0) {
                        item = index[index.length - 1];
                        position = item.position;
                        word = item.word;
                        if (wordEnd > position) {
                          index.pop();
                        } else {
                          break;
                        }
                      }
                    }
                    searchTextCount += searchTextCountInSlice;
                    return {
                      hits: hits,
                      start: start,
                      end: end,
                      searchTextCount: searchTextCountInSlice
                    };
                  }

                  var slicesOfTitle = [];
                  if (indexOfTitle.length != 0) {
                    slicesOfTitle.push(mergeIntoSlice(title, 0, title.length, indexOfTitle));
                  }

                  var slicesOfContent = [];
                  while (indexOfContent.length != 0) {
                    var item = indexOfContent[indexOfContent.length - 1];
                    var position = item.position;
                    var word = item.word;
                    // cut out 100 characters
                    var start = position - 20;
                    var end = position + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if (end < position + word.length) {
                      end = position + word.length;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    slicesOfContent.push(mergeIntoSlice(content, start, end, indexOfContent));
                  }

                  // sort slices in content by search text's count and hits' count

                  slicesOfContent.sort(function (sliceLeft, sliceRight) {
                    if (sliceLeft.searchTextCount !== sliceRight.searchTextCount) {
                      return sliceRight.searchTextCount - sliceLeft.searchTextCount;
                    } else if (sliceLeft.hits.length !== sliceRight.hits.length) {
                      return sliceRight.hits.length - sliceLeft.hits.length;
                    } else {
                      return sliceLeft.start - sliceRight.start;
                    }
                  });

                  // select top N slices in content

                  var upperBound = parseInt('1');
                  if (upperBound >= 0) {
                    slicesOfContent = slicesOfContent.slice(0, upperBound);
                  }

                  // highlight title and content

                  function highlightKeyword(text, slice) {
                    var result = '';
                    var prevEnd = slice.start;
                    slice.hits.forEach(function (hit) {
                      result += text.substring(prevEnd, hit.position);
                      var end = hit.position + hit.length;
                      result += '<b class="search-keyword">' + text.substring(hit.position, end) + '</b>';
                      prevEnd = end;
                    });
                    result += text.substring(prevEnd, slice.end);
                    return result;
                  }

                  var resultItem = '';

                  if (slicesOfTitle.length != 0) {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + highlightKeyword(title, slicesOfTitle[0]) + "</a>";
                  } else {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + title + "</a>";
                  }

                  slicesOfContent.forEach(function (slice) {
                    resultItem += "<a href='" + articleUrl + "'>" +
                      "<p class=\"search-result\">" + highlightKeyword(content, slice) +
                      "...</p>" + "</a>";
                  });

                  resultItem += "</li>";
                  resultItems.push({
                    item: resultItem,
                    searchTextCount: searchTextCount,
                    hitCount: hitCount,
                    id: resultItems.length
                  });
                }
              })
            };
            if (keywords.length === 1 && keywords[0] === "") {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>'
            } else if (resultItems.length === 0) {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>'
            } else {
              resultItems.sort(function (resultLeft, resultRight) {
                if (resultLeft.searchTextCount !== resultRight.searchTextCount) {
                  return resultRight.searchTextCount - resultLeft.searchTextCount;
                } else if (resultLeft.hitCount !== resultRight.hitCount) {
                  return resultRight.hitCount - resultLeft.hitCount;
                } else {
                  return resultRight.id - resultLeft.id;
                }
              });
              var searchResultList = '<ul class=\"search-result-list\">';
              resultItems.forEach(function (result) {
                searchResultList += result.item;
              })
              searchResultList += "</ul>";
              resultContent.innerHTML = searchResultList;
            }
          }

          if ('auto' === 'auto') {
            input.addEventListener('input', inputEventFunction);
          } else {
            $('.search-icon').click(inputEventFunction);
            input.addEventListener('keypress', function (event) {
              if (event.keyCode === 13) {
                inputEventFunction();
              }
            });
          }

          // remove loading animation
          $(".local-search-pop-overlay").remove();
          $('body').css('overflow', '');

          proceedsearch();
        }
      });
    }

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched === false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(onPopupClose);
    $('.popup').click(function(e){
      e.stopPropagation();
    });
    $(document).on('keyup', function (event) {
      var shouldDismissSearchPopup = event.which === 27 &&
        $('.search-popup').is(':visible');
      if (shouldDismissSearchPopup) {
        onPopupClose();
      }
    });
  </script>





  

  

  

  
  

  

  
  <script type="text/javascript" src="/js/src/js.cookie.js?v=5.1.3"></script>
  <script type="text/javascript" src="/js/src/scroll-cookie.js?v=5.1.3"></script>


  

</body>
</html>
