<!DOCTYPE html>



  


<html class="theme-next mist use-motion" lang="zh-CN">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=2"/>
<meta name="theme-color" content="#222">









  
  
  <link rel="stylesheet" media="all" href="/lib/Han/dist/han.min.css?v=3.3">




<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />






















<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=6.1.0" rel="stylesheet" type="text/css" />


  <link rel="apple-touch-icon" sizes="180x180" href="/images/favicon.png?v=6.1.0">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon.png?v=6.1.0">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon.png?v=6.1.0">


  <link rel="mask-icon" href="/images/logo.svg?v=6.1.0" color="#222">









<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    version: '6.1.0',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":false,"onmobile":false},
    fancybox: false,
    fastclick: false,
    lazyload: false,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>


  




  <meta name="description" content="&amp;#x4ECA;&amp;#x5929;&amp;#x662F;&amp;#x7237;&amp;#x7237;&amp;#x751F;&amp;#x75C5;&amp;#x4F4F;&amp;#x9662;&amp;#x7684;&amp;#x7B2C;23&amp;#x5929;&amp;#x3002; &amp;#x4E00;&amp;#x65E9;7&amp;#x70B9;&amp;#x6211;&amp;#x5C31;&amp;#x8D77;&amp;#x5E8A;&amp;#xFF0C;&amp;#x548C;&amp;#x5A9B;&amp;#x5A9B;&amp;#x7">
<meta name="keywords" content="自写,日记,爷爷">
<meta property="og:type" content="article">
<meta property="og:title" content="diary-2017-12-07-THU">
<meta property="og:url" content="http://whiledoing.me/2017/12/11/diary/diary-2017-12-07-THU/index.html">
<meta property="og:site_name" content="whiledoing">
<meta property="og:description" content="&amp;#x4ECA;&amp;#x5929;&amp;#x662F;&amp;#x7237;&amp;#x7237;&amp;#x751F;&amp;#x75C5;&amp;#x4F4F;&amp;#x9662;&amp;#x7684;&amp;#x7B2C;23&amp;#x5929;&amp;#x3002; &amp;#x4E00;&amp;#x65E9;7&amp;#x70B9;&amp;#x6211;&amp;#x5C31;&amp;#x8D77;&amp;#x5E8A;&amp;#xFF0C;&amp;#x548C;&amp;#x5A9B;&amp;#x5A9B;&amp;#x7">
<meta property="og:locale" content="zh-CN">
<meta property="og:image" content="http://static.zybuluo.com/whiledoing/tu7duvf79h1cd8a3l8j0qaoy/image_1c10oq48k1hl3leprv410sm1b9s9.png">
<meta property="og:updated_time" content="2017-12-10T17:55:41.691Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="diary-2017-12-07-THU">
<meta name="twitter:description" content="&amp;#x4ECA;&amp;#x5929;&amp;#x662F;&amp;#x7237;&amp;#x7237;&amp;#x751F;&amp;#x75C5;&amp;#x4F4F;&amp;#x9662;&amp;#x7684;&amp;#x7B2C;23&amp;#x5929;&amp;#x3002; &amp;#x4E00;&amp;#x65E9;7&amp;#x70B9;&amp;#x6211;&amp;#x5C31;&amp;#x8D77;&amp;#x5E8A;&amp;#xFF0C;&amp;#x548C;&amp;#x5A9B;&amp;#x5A9B;&amp;#x7">
<meta name="twitter:image" content="http://static.zybuluo.com/whiledoing/tu7duvf79h1cd8a3l8j0qaoy/image_1c10oq48k1hl3leprv410sm1b9s9.png">






  <link rel="canonical" href="http://whiledoing.me/2017/12/11/diary/diary-2017-12-07-THU/"/>



<script type="text/javascript" id="page.configurations">
  CONFIG.page = {
    sidebar: "",
  };
</script>

  <title>diary-2017-12-07-THU | whiledoing</title>
  




<script async src="https://www.googletagmanager.com/gtag/js?id=UA-117714040-1"></script>
<script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'UA-117714040-1');
</script>






  <noscript>
  <style type="text/css">
    .use-motion .motion-element,
    .use-motion .brand,
    .use-motion .menu-item,
    .sidebar-inner,
    .use-motion .post-block,
    .use-motion .pagination,
    .use-motion .comments,
    .use-motion .post-header,
    .use-motion .post-body,
    .use-motion .collection-title { opacity: initial; }

    .use-motion .logo,
    .use-motion .site-title,
    .use-motion .site-subtitle {
      opacity: initial;
      top: initial;
    }

    .use-motion {
      .logo-line-before i { left: initial; }
      .logo-line-after i { right: initial; }
    }
  </style>
</noscript>

</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-CN">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">whiledoing</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">喜欢一切简单且美的事物，包括人。</p>
      
  </div>

  <div class="site-nav-toggle">
    <button aria-label="切换导航栏">
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>




<nav class="site-nav">
  
    <ul id="menu" class="menu">
      
        
        
        
          
          <li class="menu-item menu-item-home">
    <a href="/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-home"></i> <br />首页</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-tags">
    <a href="/tags/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />标签</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-archives">
    <a href="/archives/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />归档</a>
  </li>

      
      
    </ul>
  

  
    

  

  
</nav>



  



</div>
    </header>

    


    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://whiledoing.me/2017/12/11/diary/diary-2017-12-07-THU/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="whiledoing">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/images/avatar.jpeg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="whiledoing">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">diary-2017-12-07-THU
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">

            
            
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              

              
                
              

              <time title="创建于：2017-12-11 01:48:48 / 更新于：01:55:41" itemprop="dateCreated datePublished" datetime="2017-12-11T01:48:48+08:00">2017-12-11</time>
            

            
              

              
            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body han-init-context" itemprop="articleBody">

      
      

      
        <p>&#x4ECA;&#x5929;&#x662F;&#x7237;&#x7237;&#x751F;&#x75C5;&#x4F4F;&#x9662;&#x7684;&#x7B2C;23&#x5929;&#x3002;</p>
<p>&#x4E00;&#x65E9;7&#x70B9;&#x6211;&#x5C31;&#x8D77;&#x5E8A;&#xFF0C;&#x548C;&#x5A9B;&#x5A9B;&#x7684;&#x7236;&#x4EB2;&#xFF0C;&#x4E5F;&#x662F;&#x6211;&#x7684;&#x4E8C;&#x7237;&#x4E00;&#x8D77;&#x51FA;&#x53D1;&#x53BB;&#x533B;&#x9662;&#x3002;8&#x70B9;&#x5230;&#x533B;&#x9662;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x62A4;&#x5DE5;&#x5434;&#x59D0;&#x6B63;&#x5728;&#x7ED9;&#x7237;&#x7237;&#x5582;&#x6C34;&#x3002;&#x8BE2;&#x95EE;&#x4E86;&#x4E0B;&#x6628;&#x591C;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6CA1;&#x6709;&#x51FA;&#x4E4E;&#x6211;&#x7684;&#x610F;&#x6599;&#xFF0C;&#x7237;&#x7237;&#x57FA;&#x672C;&#x4E0A;&#x4E00;&#x591C;&#x6CA1;&#x6709;&#x7761;&#x3002;&#x591C;&#x91CC;&#x4ED6;&#x603B;&#x662F;&#x4F1A;&#x5927;&#x58F0;&#x7684;&#x53EB;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x89E3;&#x4E86;&#x56DB;&#x6B21;&#x5927;&#x4FBF;&#xFF0C;&#x7740;&#x5B9E;&#x6298;&#x817E;&#x4E86;&#x62A4;&#x5DE5;&#x4E00;&#x7FFB;&#x3002;&#x800C;&#x4E14;&#x62A4;&#x5DE5;&#x65B0;&#x4E0A;&#x624B;&#xFF0C;&#x53EF;&#x80FD;&#x4E5F;&#x4E0D;&#x719F;&#x6089;&#x60C5;&#x51B5;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x5904;&#x7406;&#x4E0D;&#x53CA;&#x65F6;&#x6216;&#x8005;&#x4E0D;&#x5230;&#x4F4D;&#x90FD;&#x4F1A;&#x8BA9;&#x4ED6;&#x8D8A;&#x6765;&#x8D8A;&#x6025;&#x8E81;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x6837;&#x5B50;&#x7684;&#x72B6;&#x51B5;&#x4E5F;&#x5BFC;&#x81F4;&#x9694;&#x58C1;&#x5E8A;&#x5BF9;&#x6211;&#x4EEC;&#x975E;&#x5E38;&#x6709;&#x610F;&#x89C1;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x4E5F;&#x88AB;&#x641E;&#x5F97;&#x4E00;&#x591C;&#x90FD;&#x6CA1;&#x6709;&#x7761;&#x3002;</p>
<p>&#x6211;&#x60F3;&#x7740;&#x786E;&#x5B9E;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x8FC7;&#x53BB;&#x548C;&#x9694;&#x58C1;&#x5E8A;&#x7684;&#x4EBA;&#x9053;&#x6B49;&#xFF0C;&#x8BF4;&#x660E;&#x6211;&#x7237;&#x7237;&#x7684;&#x60C5;&#x51B5;&#x5E76;&#x4E0D;&#x662F;&#x4ED6;&#x523B;&#x610F;&#x7684;&#xFF0C;&#x4ED6;&#x5927;&#x8111;&#x6709;&#x635F;&#x4F24;&#xFF0C;&#x81EA;&#x5DF1;&#x4E0D;&#x80FD;&#x63A7;&#x5236;&#x81EA;&#x5DF1;&#x3002;&#x4F46;&#x662F;&#x9694;&#x58C1;&#x5E8A;&#x7684;&#x4EBA;&#x8FD8;&#x662F;&#x9887;&#x6709;&#x5FAE;&#x8BCD;&#xFF0C;&#x6211;&#x4E5F;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x73B0;&#x5B9E;&#x60C5;&#x51B5;&#x7684;&#x7A98;&#x8FEB;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x6CA1;&#x6709;&#x591A;&#x52A0;&#x8A00;&#x8BED;&#xFF0C;&#x60F3;&#x7740;&#x540E;&#x9762;&#x518D;&#x770B;&#x673A;&#x4F1A;&#x548C;&#x4EBA;&#x5BB6;&#x804A;&#x4E00;&#x804A;&#x3002;</p>
<p>&#x4E0A;&#x5348;&#x533B;&#x751F;&#x8FC7;&#x6765;&#x7ED9;&#x4E86;&#x6211;&#x4E00;&#x4E2A;&#x5C0F;&#x7EB8;&#x6761;&#xFF0C;&#x4E0A;&#x9762;&#x5199;&#x7740;&#x7237;&#x7237;&#x76EE;&#x524D;&#x9700;&#x8981;&#x505A;&#x7684;&#x5EB7;&#x590D;&#x5927;&#x7C7B;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x5E76;&#x8BA9;&#x6211;&#x5C3D;&#x65E9;&#x53BB;&#x9884;&#x7EA6;&#x5B89;&#x6392;&#x3002;&#x6211;&#x4E8E;&#x662F;&#x5C31;&#x62FF;&#x7740;&#x5C0F;&#x7EB8;&#x6761;&#x6309;&#x7167;&#x4E0A;&#x9762;&#x5199;&#x7740;&#x7684;&#x5EB7;&#x590D;&#x623F;&#x95F4;&#x7F16;&#x53F7;&#x53BB;&#x8BE2;&#x95EE;&#x3002;&#x51E0;&#x7ECF;&#x5468;&#x6298;&#xFF0C;&#x7EC8;&#x4E8E;&#x4E00;&#x4E2A;&#x4E2A;&#x9879;&#x76EE;&#x90FD;&#x5B89;&#x6392;&#x597D;&#x3002;&#x53D1;&#x73B0;&#x533B;&#x9662;&#x5C31;&#x548C;&#x6218;&#x573A;&#x4E00;&#x6837;&#xFF1A;&#x533B;&#x751F;&#x975E;&#x5E38;&#x7684;&#x7E41;&#x5FD9;&#xFF0C;&#x800C;&#x5BB6;&#x5C5E;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x5E0C;&#x671B;&#x5F97;&#x5230;&#x66F4;&#x591A;&#x7684;&#x533B;&#x62A4;&#x8D44;&#x6E90;&#xFF0C;&#x4F46;&#x662F;&#x73B0;&#x5B9E;&#x7684;&#x60C5;&#x51B5;&#x662F;&#xFF0C;&#x533B;&#x751F;&#x57FA;&#x672C;&#x5904;&#x4E8E;&#x6EE1;&#x8D1F;&#x8377;&#x7684;&#x5DE5;&#x4F5C;&#x72B6;&#x6001;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E5F;&#x662F;&#x5FD9;&#x5F97;&#x7126;&#x5934;&#x70C2;&#x989D;&#xFF1A;&#x4E00;&#x65B9;&#x9762;&#x8981;&#x7ED9;&#x75C5;&#x4EBA;&#x505A;&#x6CBB;&#x7597;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x53C8;&#x8981;&#x4E0D;&#x505C;&#x5904;&#x7406;&#x5404;&#x79CD;&#x5BB6;&#x5C5E;&#x4E0A;&#x95E8;&#x7684;&#x8BE2;&#x95EE;&#xFF0C;&#x8D28;&#x7591;&#xFF0C;&#x751A;&#x81F3;&#x5404;&#x79CD;&#x7EA0;&#x7ED3;&#x7684;&#x9700;&#x6C42;&#x3002;&#x60F3;&#x6765;&#x89C9;&#x5F97;&#x5927;&#x5BB6;&#x771F;&#x7684;&#x90FD;&#x4E0D;&#x5BB9;&#x6613;&#xFF0C;&#x66F4;&#x89C9;&#x5F97;&#x751F;&#x6D3B;&#x4EA6;&#x662F;&#x5982;&#x6B64;&#x3002;</p>
<p>&#x5B89;&#x6392;&#x597D;&#x4E86;&#x5EB7;&#x590D;&#x9879;&#x76EE;&#xFF0C;&#x5C31;&#x60F3;&#x7740;&#x8981;&#x7ED9;&#x7237;&#x7237;&#x53BB;&#x5B89;&#x6392;&#x6CBB;&#x7597;&#x3002;&#x6211;&#x548C;&#x76F8;&#x5173;&#x533B;&#x751F;&#x8BF4;&#x660E;&#x4E86;&#x7237;&#x7237;&#x76EE;&#x524D;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4E00;&#x6765;&#x4ED6;&#x7684;&#x60C5;&#x51B5;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#xFF0C;&#x4E8C;&#x6765;&#x7237;&#x7237;&#x5FEB;&#x4E5D;&#x5341;&#x5E74;&#x9F84;&#x4E5F;&#x8F83;&#x5927;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x4EEC;&#x544A;&#x8BC9;&#x6211;&#x90E8;&#x5206;&#x9879;&#x76EE;&#x53EF;&#x4EE5;&#x5230;&#x5E8A;&#x8FB9;&#x6CBB;&#x7597;&#x3002;&#x6240;&#x4EE5;&#x5F00;&#x59CB;&#x6211;&#x5C31;&#x5728;&#x5E8A;&#x8FB9;&#x7B49;&#x5F85;&#x533B;&#x751F;&#x7684;&#x5230;&#x6765;&#xFF0C;&#x53EF;&#x73B0;&#x5B9E;&#x7740;&#x5B9E;&#x7ED9;&#x6211;&#x4E0A;&#x4E86;&#x4E00;&#x8BFE;&#xFF1A;&#x4F60;&#x6C38;&#x8FDC;&#x4E0D;&#x80FD;&#x7B49;&#x533B;&#x751F;&#xFF0C;&#x800C;&#x662F;&#x8981;&#x4E3B;&#x52A8;&#x51FA;&#x51FB;&#x8BA9;&#x533B;&#x751F;&#x5C06;&#x65F6;&#x95F4;&#x5B89;&#x6392;&#x5230;&#x4F60;&#x8FD9;&#x91CC;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x5982;&#x6B64;&#xFF1F;&#x4E00;&#x6765;&#x533B;&#x9662;&#x7684;&#x9884;&#x7EA6;&#x6392;&#x8868;&#x5176;&#x5B9E;&#x662F;&#x5927;&#x6982;&#x65F6;&#x95F4;&#x8303;&#x56F4;&#x7684;&#x8BBE;&#x5B9A;&#xFF0C;&#x6839;&#x672C;&#x4E0D;&#x53EF;&#x80FD;&#x505A;&#x5230;&#x5BF9;&#x5E94;&#x65F6;&#x95F4;&#x5C31;&#x975E;&#x5E38;&#x51C6;&#x70B9;&#x7684;&#x75C5;&#x4EBA;&#x51C6;&#x5907;&#x5C31;&#x7EEA;&#x4E14;&#x533B;&#x751F;&#x4E5F;&#x6709;&#x7A7A;&#xFF0C;&#x603B;&#x662F;&#x4F1A;&#x6709;&#x5404;&#x79CD;&#x5BF9;&#x4E0D;&#x4E0A;&#x7684;&#x60C5;&#x51B5;&#x51FA;&#x73B0;&#x3002;&#x6BD4;&#x5982;&#x533B;&#x751F;&#x6709;&#x522B;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4E0A;&#x4E2A;&#x75C5;&#x4EBA;&#x591A;&#x6CBB;&#x7597;&#x4E86;&#x4E9B;&#x65F6;&#x95F4;&#xFF0C;&#x4EA6;&#x6216;&#x662F;&#x75C5;&#x4EBA;&#x8FD9;&#x8FB9;&#x9700;&#x8981;&#x68C0;&#x6D4B;&#xFF0C;&#x6302;&#x6C34;&#x6CA1;&#x6CD5;&#x6CBB;&#x7597;&#xFF0C;&#x6216;&#x8005;&#x5C31;&#x6BD4;&#x5982;&#x6211;&#x7237;&#x7237;&#x7684;&#x60C5;&#x51B5;&#xFF1A;&#x521A;&#x597D;&#x5728;&#x7761;&#x89C9;&#x8D77;&#x4E0D;&#x6765;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x6276;&#x4E0A;&#x8F6E;&#x6905;&#x9700;&#x8981;&#x5F88;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x800C;&#x6240;&#x6709;&#x803D;&#x8BEF;&#x3002;&#x800C;&#x533B;&#x9662;&#x6392;&#x73ED;&#x65F6;&#x95F4;&#x8868;&#x662F;&#x4EE5;&#x4E8C;&#x5341;&#x5206;&#x949F;&#x4E3A;&#x4E00;&#x4E2A;&#x5355;&#x5143;&#x8FDB;&#x884C;&#x5B89;&#x6392;&#xFF0C;&#x4E2D;&#x95F4;&#x4E00;&#x523B;&#x5197;&#x4F59;&#x7684;&#x7A7A;&#x9699;&#x65F6;&#x95F4;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x4E00;&#x65E6;&#x5EF6;&#x8BEF;&#x5C31;&#x5EF6;&#x8BEF;&#x4E86;&#xFF0C;&#x53EA;&#x80FD;&#x540E;&#x9762;&#x518D;&#x60F3;&#x529E;&#x6CD5;&#x89C1;&#x7F1D;&#x63D2;&#x9488;&#x7684;&#x548C;&#x533B;&#x751F;&#x53BB;&#x534F;&#x5546;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x4ECA;&#x5929;&#x7684;&#x5DE5;&#x4F5C;&#x5C31;&#x662F;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x52A8;&#x6001;&#x89C4;&#x5212;&#xFF1A;</p>
<ul>
<li>&#x770B;&#x597D;&#x4E0B;&#x4E00;&#x4E2A;&#x5EB7;&#x590D;&#x9879;&#x76EE;&#x7684;&#x65F6;&#x95F4;&#x3002;</li>
<li>&#x63D0;&#x524D;&#x627E;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x533B;&#x751F;&#x5E76;&#x5BF9;&#x65F6;&#x95F4;&#x3002;</li>
<li>&#x63D0;&#x524D;&#x89C4;&#x5212;&#x597D;&#x53EF;&#x80FD;&#x5EF6;&#x8BEF;&#x65F6;&#x95F4;&#x7684;&#x56E0;&#x7D20;&#xFF0C;&#x6BD4;&#x5982;&#x9700;&#x8981;&#x505A;&#x68C0;&#x67E5;&#xFF0C;&#x9700;&#x8981;&#x6302;&#x6C34;&#xFF0C;&#x8D77;&#x5E8A;&#x5230;&#x8F6E;&#x6905;&#x6D88;&#x8017;&#x7684;&#x65F6;&#x95F4;&#x7B49;&#x3002;</li>
<li>&#x63D0;&#x524D;&#x89C4;&#x5212;&#x597D;&#x7237;&#x7237;&#x8BE5;&#x4F11;&#x606F;&#x548C;&#x8BE5;&#x63D0;&#x524D;&#x5524;&#x9192;&#x7684;&#x65F6;&#x95F4;&#x3002;</li>
<li>&#x5982;&#x679C;&#x6CA1;&#x6709;&#x6309;&#x65F6;&#x505A;&#x9879;&#x76EE;&#xFF0C;&#x9700;&#x8981;&#x770B;&#x51C6;&#x65F6;&#x95F4;&#x89C1;&#x7F1D;&#x63D2;&#x9488;&#x7684;&#x627E;&#x533B;&#x751F;&#x534F;&#x8C03;&#x3002;</li>
<li>&#x89C4;&#x5212;&#x597D;&#x6216;&#x8005;&#x662F;&#x8C03;&#x6574;&#x597D;&#x505A;&#x9879;&#x76EE;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5C3D;&#x91CF;&#x5C06;&#x9700;&#x8981;&#x5750;&#x8F6E;&#x6905;&#x5230;&#x5404;&#x4E2A;&#x5EB7;&#x590D;&#x5BA4;&#x505A;&#x6CBB;&#x7597;&#x7684;&#x65F6;&#x95F4;&#x534F;&#x8C03;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0A;&#x4E0B;&#x4E00;&#x6B21;&#x8F6E;&#x6905;&#x7740;&#x5B9E;&#x82B1;&#x529F;&#x592B;&#x3002;</li>
</ul>
<p>&#x786E;&#x5B9E;&#x662F;&#x56F0;&#x96BE;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x9700;&#x8981;&#x8010;&#x5FC3;&#xFF0C;&#x7EC6;&#x5FC3;&#x548C;&#x575A;&#x5B9A;&#x7684;&#x6267;&#x884C;&#x529B;&#x3002;&#x4F46;&#x662F;&#x6211;&#x77E5;&#x9053;&#x6211;&#x5177;&#x5907;&#x8FD9;&#x6837;&#x5B50;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x4E5F;&#x4E00;&#x5B9A;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#xFF0C;&#x4E5F;&#x4E00;&#x5B9A;&#x53EF;&#x4EE5;&#x505A;&#x597D;&#xFF0C;&#x4E00;&#x5B9A;&#xFF01;</p>
<p>&#x53C8;&#x53CA;&#xFF0C;&#x7237;&#x7237;&#x7684;&#x6CBB;&#x7597;&#x65F6;&#x95F4;&#x5B89;&#x6392;&#x8868;&#xFF1A;</p>
<p><img src="http://static.zybuluo.com/whiledoing/tu7duvf79h1cd8a3l8j0qaoy/image_1c10oq48k1hl3leprv410sm1b9s9.png" alt="&#x7237;&#x7237;&#x6CBB;&#x7597;&#x65F6;&#x95F4;&#x5B89;&#x6392;&#x8868;"></p>

      
    </div>

    

    
    
    

    

    

    
      <div>
        <ul class="post-copyright">
  <li class="post-copyright-author">
    <strong>本文作者： </strong>whiledoing</li>
  <li class="post-copyright-link">
    <strong>本文链接：</strong>
    <a href="http://whiledoing.me/2017/12/11/diary/diary-2017-12-07-THU/" title="diary-2017-12-07-THU">http://whiledoing.me/2017/12/11/diary/diary-2017-12-07-THU/</a>
  </li>
  <li class="post-copyright-license">
    <strong>版权声明： </strong>本博客所有文章除特别声明外，均采用 <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/" rel="external nofollow" target="_blank">CC BY-NC-SA 4.0</a> 许可协议。转载请注明出处！</li>
</ul>

      </div>
    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/自写/" rel="tag"># 自写</a>
          
            <a href="/tags/日记/" rel="tag"># 日记</a>
          
            <a href="/tags/爷爷/" rel="tag"># 爷爷</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2017/12/07/diary/diary-2017-12-06-WED/" rel="next" title="diary-2017-12-06-WED">
                <i class="fa fa-chevron-left"></i> diary-2017-12-06-WED
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2017/12/11/diary/diary-2017-12-08-FRI/" rel="prev" title="diary-2017-12-08-FRI">
                diary-2017-12-08-FRI <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      

      <section class="site-overview-wrap sidebar-panel sidebar-panel-active">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <img class="site-author-image" itemprop="image"
                src="/images/avatar.jpeg"
                alt="whiledoing" />
            
              <p class="site-author-name" itemprop="name">whiledoing</p>
              <p class="site-description motion-element" itemprop="description">喜欢一切简单且美的事物，包括人。</p>
          </div>

          
            <nav class="site-state motion-element">
              
                <div class="site-state-item site-state-posts">
                
                  <a href="/archives/">
                
                    <span class="site-state-item-count">51</span>
                    <span class="site-state-item-name">日志</span>
                  </a>
                </div>
              

              

              
                
                
                <div class="site-state-item site-state-tags">
                  <a href="/tags/index.html">
                    
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                    <span class="site-state-item-count">29</span>
                    <span class="site-state-item-name">标签</span>
                  </a>
                </div>
              
            </nav>
          

          

          
            <div class="links-of-author motion-element">
              
                <span class="links-of-author-item">
                  <a href="https://github.com/whiledoing" target="_blank" title="GitHub">GitHub</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="http://www.douban.com/people/58249409" target="_blank" title="豆瓣">豆瓣</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="https://www.zhihu.com/people/whiledoing" target="_blank" title="知乎">知乎</a>
                  
                </span>
              
            </div>
          

          
          

          
          

          
            
          
          

        </div>
      </section>

      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; 2016 &mdash; <span itemprop="copyrightYear">2018</span>
  <span class="with-love" id="animate">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">whiledoing</span>

  

  
</div>




  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动 v3.7.1</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/theme-next/hexo-theme-next">NexT.Mist</a> v6.1.0</div>




        








        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>


























  
  
    <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  


  


  <script type="text/javascript" src="/js/src/utils.js?v=6.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=6.1.0"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=6.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=6.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=6.1.0"></script>



  



	





  





  










  





  

  

  

  
  

  
  

  


  
  

  
  
  
  <script src="/lib/pangu/dist/pangu.min.js?v=3.3"></script>
  <script type="text/javascript">pangu.spacingPage();</script>


  
  <script type="text/javascript" src="/js/src/js.cookie.js?v=6.1.0"></script>
  <script type="text/javascript" src="/js/src/scroll-cookie.js?v=6.1.0"></script>


  

  

  
  <style>
    .copy-btn {
        position: relative;
        display: inline-block;
        padding: 6px 12px;
        font-size: 13px;
        font-weight: 700;
        line-height: 20px;
        color: #333;
        white-space: nowrap;
        vertical-align: middle;
        cursor: pointer;
        background-color: #eee;
        background-image: linear-gradient(#fcfcfc, #eee);
        border: 1px solid #d5d5d5;
        border-radius: 3px;
        user-select: none;
    }

    .highlight {
        position: relative;
    }

    .highlight .copy-btn {
        transition: opacity .3s ease-in-out;
        opacity: 0;
        padding: 2px 6px;
        position: absolute;
        right: 4px;
        top: 8px;
    }

    .highlight:hover .copy-btn,
    .highlight .copy-btn:focus {
        opacity: 1
    }
  </style>
  <script>
    $('.highlight').prepend($('<button>').addClass('copy-btn').append('Copy').on('click', function(e) {
      var code = $(e.target).parent().find('.code').find('.line').map(function(i, e){
        return $(e).text()
      }).toArray().join('\n')
      var ta = document.createElement('textarea')
      document.body.appendChild(ta)
      ta.style.position = 'fixed'
      ta.style.top = 0
      ta.style.left = 0
      ta.value = code
      ta.select()
      ta.focus()
      document.execCommand('copy')
      document.body.removeChild(ta)
    }))
  </script>


</body>
</html>
