<!DOCTYPE html>












  


<html class="theme-next mist use-motion" lang="zh-CN">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=2"/>
<meta name="theme-color" content="#222">






  
  
    
    
  <script src="/lib/pace/pace.min.js?v=1.0.2"></script>
  <link href="/lib/pace/pace-theme-minimal.min.css?v=1.0.2" rel="stylesheet">




  
  
  <link rel="stylesheet" media="all" href="/lib/Han/dist/han.min.css?v=3.3">




<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />






















<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=6.4.2" rel="stylesheet" type="text/css" />


  <link rel="apple-touch-icon" sizes="180x180" href="/images/favicon.png?v=6.4.2">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon.png?v=6.4.2">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon.png?v=6.4.2">


  <link rel="mask-icon" href="/images/logo.svg?v=6.4.2" color="#222">









<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    version: '6.4.2',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":false,"onmobile":false},
    fancybox: false,
    fastclick: false,
    lazyload: false,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>


  




  <meta name="description" content="《淘宝产品十年事》这本书描写了淘宝发展背后的故事，以及决策背后的深层次思考。淘宝做为一款改变中国人生活方式的产品，其所属范畴已经不单是一款产品，而更是一种生态。也就可想而知设计这样的生态产品将会遇到怎样的复杂和困难。也许正如作者所写的那样，做产品往大了说，都是在阐释人性和哲学。 读完本书，我最先想到的就是《简约至上》中提到的乔老爷子的话：  乍一看到某个问题，你会觉得简单，其实你并没有理解其复杂性">
<meta name="keywords" content="读书笔记,产品">
<meta property="og:type" content="article">
<meta property="og:title" content="《淘宝产品十年事》与「优雅」的解决之道">
<meta property="og:url" content="http://whiledoing.me/2018/05/04/note/taobao-product-stories-note/index.html">
<meta property="og:site_name" content="whiledoing">
<meta property="og:description" content="《淘宝产品十年事》这本书描写了淘宝发展背后的故事，以及决策背后的深层次思考。淘宝做为一款改变中国人生活方式的产品，其所属范畴已经不单是一款产品，而更是一种生态。也就可想而知设计这样的生态产品将会遇到怎样的复杂和困难。也许正如作者所写的那样，做产品往大了说，都是在阐释人性和哲学。 读完本书，我最先想到的就是《简约至上》中提到的乔老爷子的话：  乍一看到某个问题，你会觉得简单，其实你并没有理解其复杂性">
<meta property="og:locale" content="zh-CN">
<meta property="og:updated_time" content="2018-09-05T06:46:19.364Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="《淘宝产品十年事》与「优雅」的解决之道">
<meta name="twitter:description" content="《淘宝产品十年事》这本书描写了淘宝发展背后的故事，以及决策背后的深层次思考。淘宝做为一款改变中国人生活方式的产品，其所属范畴已经不单是一款产品，而更是一种生态。也就可想而知设计这样的生态产品将会遇到怎样的复杂和困难。也许正如作者所写的那样，做产品往大了说，都是在阐释人性和哲学。 读完本书，我最先想到的就是《简约至上》中提到的乔老爷子的话：  乍一看到某个问题，你会觉得简单，其实你并没有理解其复杂性">






  <link rel="canonical" href="http://whiledoing.me/2018/05/04/note/taobao-product-stories-note/"/>



<script type="text/javascript" id="page.configurations">
  CONFIG.page = {
    sidebar: "",
  };
</script>

  <title>《淘宝产品十年事》与「优雅」的解决之道 | whiledoing</title>
  




<script async src="https://www.googletagmanager.com/gtag/js?id=UA-117714040-1"></script>
<script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'UA-117714040-1');
</script>



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "https://hm.baidu.com/hm.js?6de2920425778ca5a4ee717be5055e96";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>




  <noscript>
  <style type="text/css">
    .use-motion .motion-element,
    .use-motion .brand,
    .use-motion .menu-item,
    .sidebar-inner,
    .use-motion .post-block,
    .use-motion .pagination,
    .use-motion .comments,
    .use-motion .post-header,
    .use-motion .post-body,
    .use-motion .collection-title { opacity: initial; }

    .use-motion .logo,
    .use-motion .site-title,
    .use-motion .site-subtitle {
      opacity: initial;
      top: initial;
    }

    .use-motion {
      .logo-line-before i { left: initial; }
      .logo-line-after i { right: initial; }
    }
  </style>
</noscript>

</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-CN">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/" class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">whiledoing</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
    
      
        <p class="site-subtitle">喜欢一切简单且美的事物，包括人。</p>
      
    
  </div>

  <div class="site-nav-toggle">
    <button aria-label="切换导航栏">
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>



<nav class="site-nav">
  
    <ul id="menu" class="menu">
      
        
        
        
          
          <li class="menu-item menu-item-home">
    <a href="/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-home"></i> <br />首页</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-about">
    <a href="/about/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-user"></i> <br />关于</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-tags">
    <a href="/tags/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />标签</a>
  </li>
        
        
        
          
          <li class="menu-item menu-item-archives">
    <a href="/archives/" rel="section">
      <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />归档</a>
  </li>

      
      
    </ul>
  

  
    

  

  
</nav>



  



</div>
    </header>

    


    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  
    <div class="reading-progress-bar"></div>
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://whiledoing.me/2018/05/04/note/taobao-product-stories-note/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="whiledoing">
      <meta itemprop="description" content="喜欢一切简单且美的事物，包括人。">
      <meta itemprop="image" content="/images/avatar.jpeg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="whiledoing">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">《淘宝产品十年事》与「优雅」的解决之道
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">

            
            
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              

              
                
              

              <time title="创建时间：2018-05-04 18:13:24" itemprop="dateCreated datePublished" datetime="2018-05-04T18:13:24+08:00">2018-05-04</time>
            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body han-init-context" itemprop="articleBody">

      
      

      
        <p><a href="https://book.douban.com/subject/25732463/" target="_blank" rel="noopener">&#x300A;&#x6DD8;&#x5B9D;&#x4EA7;&#x54C1;&#x5341;&#x5E74;&#x4E8B;&#x300B;</a>&#x8FD9;&#x672C;&#x4E66;&#x63CF;&#x5199;&#x4E86;&#x6DD8;&#x5B9D;&#x53D1;&#x5C55;&#x80CC;&#x540E;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x4EE5;&#x53CA;&#x51B3;&#x7B56;&#x80CC;&#x540E;&#x7684;&#x6DF1;&#x5C42;&#x6B21;&#x601D;&#x8003;&#x3002;&#x6DD8;&#x5B9D;&#x505A;&#x4E3A;&#x4E00;&#x6B3E;&#x6539;&#x53D8;&#x4E2D;&#x56FD;&#x4EBA;&#x751F;&#x6D3B;&#x65B9;&#x5F0F;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x5176;&#x6240;&#x5C5E;&#x8303;&#x7574;&#x5DF2;&#x7ECF;&#x4E0D;&#x5355;&#x662F;&#x4E00;&#x6B3E;&#x4EA7;&#x54C1;&#xFF0C;&#x800C;&#x66F4;&#x662F;&#x4E00;&#x79CD;&#x751F;&#x6001;&#x3002;&#x4E5F;&#x5C31;&#x53EF;&#x60F3;&#x800C;&#x77E5;&#x8BBE;&#x8BA1;&#x8FD9;&#x6837;&#x7684;&#x751F;&#x6001;&#x4EA7;&#x54C1;&#x5C06;&#x4F1A;&#x9047;&#x5230;&#x600E;&#x6837;&#x7684;&#x590D;&#x6742;&#x548C;&#x56F0;&#x96BE;&#x3002;&#x4E5F;&#x8BB8;&#x6B63;&#x5982;&#x4F5C;&#x8005;&#x6240;&#x5199;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x505A;&#x4EA7;&#x54C1;&#x5F80;&#x5927;&#x4E86;&#x8BF4;&#xFF0C;&#x90FD;&#x662F;&#x5728;&#x9610;&#x91CA;&#x4EBA;&#x6027;&#x548C;&#x54F2;&#x5B66;&#x3002;</p>
<p>&#x8BFB;&#x5B8C;&#x672C;&#x4E66;&#xFF0C;&#x6211;&#x6700;&#x5148;&#x60F3;&#x5230;&#x7684;&#x5C31;&#x662F;<a href="https://book.douban.com/subject/5394309/" target="_blank" rel="noopener">&#x300A;&#x7B80;&#x7EA6;&#x81F3;&#x4E0A;&#x300B;</a>&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x4E54;&#x8001;&#x7237;&#x5B50;&#x7684;&#x8BDD;&#xFF1A;</p>
<blockquote>
<p>&#x4E4D;&#x4E00;&#x770B;&#x5230;&#x67D0;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4F60;&#x4F1A;&#x89C9;&#x5F97;&#x7B80;&#x5355;&#xFF0C;&#x5176;&#x5B9E;&#x4F60;&#x5E76;&#x6CA1;&#x6709;&#x7406;&#x89E3;&#x5176;&#x590D;&#x6742;&#x6027;&#x3002;&#x5F53;&#x4F60;&#x628A;&#x95EE;&#x9898;&#x641E;&#x6E05;&#x695A;&#x4E4B;&#x540E;&#xFF0C;&#x53C8;&#x4F1A;&#x53D1;&#x73B0;&#x771F;&#x7684;&#x5F88;&#x590D;&#x6742;&#xFF0C;&#x4E8E;&#x662F;&#x4F60;&#x5C31;&#x62FF;&#x51FA;&#x4E00;&#x5957;&#x590D;&#x6742;&#x7684;&#x65B9;&#x6848;&#x6765;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#x53EA;&#x505A;&#x4E86;&#x4E00;&#x534A;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x4E5F;&#x90FD;&#x4F1A;&#x5230;&#x6B64;&#x4E3A;&#x6B62;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x771F;&#x6B63;&#x4F1F;&#x5927;&#x7684;&#x4EBA;&#x8FD8;&#x4F1A;&#x7EE7;&#x7EED;&#x5411;&#x524D;&#xFF0C;&#x76F4;&#x81F3;&#x627E;&#x5230;&#x95EE;&#x9898;&#x7684;&#x5173;&#x952E;&#x548C;&#x6DF1;&#x5C42;&#x6B21;&#x539F;&#x56E0;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x62FF;&#x51FA;&#x4E00;&#x4E2A;&#x4F18;&#x96C5;&#x7684;&#x3001;&#x582A;&#x79F0;&#x5B8C;&#x7F8E;&#x7684;&#x6709;&#x6548;&#x65B9;&#x6848;&#x3002;  &#x2014;&#x2014; &#x53F2;&#x8482;&#x592B; &#x2219; &#x4E54;&#x5E03;&#x65AF;</p>
</blockquote>
<p>&#x6211;&#x81EA;&#x5DF1;&#x5728;&#x505A;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x65F6;&#x4E5F;&#x4F1A;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x611F;&#x53D7;&#x3002;&#x4E00;&#x822C;&#x800C;&#x8A00;&#xFF0C;&#x5199;&#x4EE3;&#x7801;&#x89E3;&#x51B3;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#x95EE;&#x9898;&#x6216;&#x8005;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x6846;&#x67B6;&#xFF0C;&#x8981;&#x5728;&#x7B2C;&#x4E09;&#x6B21;&#x5B9E;&#x73B0;&#x65F6;&#x624D;&#x53EF;&#x4EE5;&#x505A;&#x597D;&#x3002;&#x524D;&#x4E24;&#x6B21;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x603B;&#x4F1A;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x300C;&#x4E0D;&#x90A3;&#x4E48;&#x4F18;&#x96C5;&#x300D;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x53EF;&#x4E00;&#x65E6;&#x4F60;&#x5BF9;&#x95EE;&#x9898;&#x6709;&#x4E86;&#x66F4;&#x6DF1;&#x5165;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#x6700;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x539F;&#x6765;&#x5982;&#x6B64;&#x300C;&#x4F18;&#x96C5;&#x300D;&#xFF08;&#x4E2A;&#x4EBA;&#x7406;&#x89E3;&#xFF1A;&#x4F18;&#x96C5;&#x4E0D;&#x4EE3;&#x8868;&#x5C31;&#x662F;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x4E00;&#x5B9A;&#x9700;&#x8981;&#x6E05;&#x6670;&#xFF0C;&#x7B80;&#x6D01;&#xFF0C;&#x6709;&#x6548;&#xFF09;&#x3002;</p>
<p>&#x672C;&#x4E66;&#x63D0;&#x5230;&#x7684;&#x6848;&#x4F8B;&#x548C;&#x5BF9;&#x5E94;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x4EA6;&#x4F1A;&#x8BA9;&#x6211;&#x60F3;&#x5230;&#x4E54;&#x8001;&#x7237;&#x5B50;&#x63D0;&#x5230;&#x7684;&#x300C;&#x4F18;&#x96C5;&#x300D;&#x4E4B;&#x6982;&#x5FF5;&#x3002;&#x4E66;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5F88;&#x591A;&#x770B;&#x4F3C;&#x7B80;&#x5355;&#xFF0C;&#x5176;&#x80CC;&#x540E;&#x5374;&#x5BF9;&#x5E94;&#x7740;&#x975E;&#x5E38;&#x590D;&#x6742;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x6709;&#x4E9B;&#x751A;&#x81F3;&#x662F;&#x4EBA;&#x6027;&#x7684;&#x535A;&#x5F08;&#xFF0C;&#x800C;&#x6700;&#x540E;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x5374;&#x53C8;&#x4F18;&#x96C5;&#x6709;&#x6548;&#x3002;&#x770B;&#x5B8C;&#x672C;&#x4E66;&#xFF0C;&#x91CD;&#x65B0;&#x590D;&#x76D8;&#x4E2A;&#x4E2D;&#x6848;&#x4F8B;&#x8FD8;&#x662F;&#x5F88;&#x6709;&#x610F;&#x601D;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x5C06;&#x4E2A;&#x4E2D;&#x6211;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x6848;&#x4F8B;&#xFF0C;&#x6309;&#x6211;&#x4E2A;&#x4EBA;&#x7406;&#x89E3;&#x7684;&#x903B;&#x8F91;&#x91CD;&#x65B0;&#x6574;&#x7406;&#x4E86;&#x4E00;&#x904D;&#xFF0C;&#x5206;&#x6210;&#x4E0B;&#x9762;&#x51E0;&#x4E2A;&#x90E8;&#x5206;&#xFF1A;</p>
<ol>
<li>&#x8C03;&#x52A8;&#x79EF;&#x6781;&#x6027;&#x3002;</li>
<li>&#x7070;&#x5EA6;&#x6D4B;&#x8BD5;&#x4E0E;&#x53EF;&#x7528;&#x6027;&#x6D4B;&#x8BD5;&#x3002;</li>
<li>&#x89C4;&#x5219;&#x53EF;&#x89E3;&#x91CA;&#x3002;</li>
<li>&#x5206;&#x5C42;&#x8BBE;&#x8BA1;&#x3002;</li>
<li>&#x6570;&#x636E;&#x7684;&#x4EF7;&#x503C;&#x3002;</li>
<li>&#x96C6;&#x6743;&#x4E0E;&#x653E;&#x6743;&#x3002;</li>
<li>&#x58A8;&#x83F2;&#x5B9A;&#x5F8B;&#x3002;</li>
</ol>
<a id="more"></a>
<h2 id="&#x8C03;&#x52A8;&#x79EF;&#x6781;&#x6027;">&#x8C03;&#x52A8;&#x79EF;&#x6781;&#x6027;</h2>
<p>p53&#x3002;&#x6DD8;&#x5B9D;&#x641C;&#x7D22;&#x7684;&#x4E00;&#x79CD;&#x6392;&#x5E8F;&#x673A;&#x5236;&#xFF1A;&#x6A71;&#x7A97;&#x3002;&#x8BE5;&#x673A;&#x5236;&#x7C7B;&#x4F3C;&#x4E8E;&#x4F20;&#x7EDF;&#x5546;&#x4E1A;&#x7684;&#x5E7F;&#x544A;&#x4F4D;&#xFF0C;&#x6BCF;&#x4E2A;&#x6DD8;&#x5B9D;&#x5356;&#x5BB6;&#x4F9D;&#x636E;&#x7B49;&#x7EA7;&#x63D0;&#x4F9B;&#x6570;&#x91CF;&#x4E0D;&#x7B49;&#x7684;&#x6A71;&#x7A97;&#x3002;&#x62E5;&#x6709;&#x6A71;&#x7A97;&#x7684;&#x5B9D;&#x8D1D;&#x4EAB;&#x6709;&#x641C;&#x7D22;&#x4F18;&#x5148;&#x6743;&#x3002;&#x6A71;&#x7A97;&#x63A8;&#x8350;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x4E00;&#x79CD;&#x673A;&#x5236;&#xFF0C;&#x501F;&#x52A9;&#x6BCF;&#x4E00;&#x4E2A;&#x5356;&#x5BB6;&#x5E2E;&#x6DD8;&#x5B9D;&#x7B5B;&#x9009;&#x4F18;&#x8D28;&#x5546;&#x54C1;&#x3002;&#x8FD9;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x523A;&#x6FC0;&#x4E86;&#x5356;&#x5BB6;&#x7684;&#x4E3B;&#x89C2;&#x80FD;&#x52A8;&#x6027;&#xFF0C;&#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x8003;&#x8651;&#x81EA;&#x5DF1;&#x7684;&#x54EA;&#x4E9B;&#x5546;&#x54C1;&#x66F4;&#x597D;&#xFF0C;&#x5C06;&#x4F18;&#x5148;&#x6743;&#x7ED9;&#x5230;&#x66F4;&#x597D;&#x7684;&#x5546;&#x54C1;&#x3002;</p>
<p>p56&#x3002;&#x6DD8;&#x5B9D;&#x65B0;&#x641C;&#x7D22;&#x7B97;&#x6CD5;&#x300C;&#x963F;&#x57FA;&#x7C73;&#x5FB7;&#x300D;&#x5728;&#x6392;&#x5E8F;&#x65F6;&#x4F1A;&#x7EFC;&#x5408;&#x8003;&#x8651;&#x5356;&#x5BB6;&#x7684;&#x670D;&#x52A1;&#x8D28;&#x91CF;&#x3002;&#x8FD9;&#x5305;&#x62EC;&#x5356;&#x5BB6;&#x7684;&#x4EA4;&#x6613;&#x91CF;&#x3001;&#x597D;&#x8BC4;&#x7387;&#x3001;&#x662F;&#x5426;&#x5B58;&#x5728;&#x9000;&#x8D27;&#x3001;&#x4FE1;&#x8A89;&#x5EA6;&#x7B49;&#x56E0;&#x7D20;&#x3002;&#x8FD9;&#x7ED9;&#x5356;&#x5BB6;&#x63D0;&#x9AD8;&#x670D;&#x52A1;&#x8D28;&#x91CF;&#x6CE8;&#x5165;&#x4E86;&#x52A8;&#x529B;&#x3002;</p>
<p>&#x8BBE;&#x8BA1;&#x4EA7;&#x54C1;&#x5C31;&#x9700;&#x8981;&#x8BBE;&#x5B9A;&#x300C;&#x5929;&#x9053;&#x916C;&#x52E4;&#x300D;&#x7684;&#x89C4;&#x5219;&#x2014;&#x2014;<strong>&#x4F60;&#x8D8A;&#x52AA;&#x529B;&#xFF0C;&#x5C31;&#x8D8A;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x66F4;&#x9AD8;&#x7684;&#x7B49;&#x7EA7;&#xFF0C;&#x8D8A;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x66F4;&#x591A;&#x7684;&#x4F18;&#x52BF;</strong>&#x3002;&#x89C4;&#x5219;&#x8BBE;&#x5B9A;&#x597D;&#xFF0C;&#x5C31;&#x4F1A;&#x6B63;&#x5411;&#x523A;&#x6FC0;&#x7528;&#x6237;&#x7684;&#x4E3B;&#x89C2;&#x80FD;&#x52A8;&#x6027;&#x3002;</p>
<h2 id="&#x7070;&#x5EA6;&#x6D4B;&#x8BD5;&#x4E0E;&#x53EF;&#x7528;&#x6027;&#x6D4B;&#x8BD5;">&#x7070;&#x5EA6;&#x6D4B;&#x8BD5;&#x4E0E;&#x53EF;&#x7528;&#x6027;&#x6D4B;&#x8BD5;</h2>
<p>p127&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x5F88;&#x6709;&#x610F;&#x601D;&#x3002;&#x6280;&#x672F;&#x4EBA;&#x5458;&#x7528;&#x6700;&#x65B0;&#x7684;AJAX&#x6280;&#x672F;&#x5BF9;&#x300C;&#x6211;&#x7684;&#x6DD8;&#x5B9D;&#x300D;&#x9875;&#x9762;&#x8FDB;&#x884C;&#x91CD;&#x5199;&#xFF0C;&#x52A0;&#x5165;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x7F51;&#x9875;&#x64CD;&#x4F5C;&#x7279;&#x6027;&#xFF0C;&#x4F46;&#x5728;&#x4E0A;&#x7EBF;&#x540E;&#x5374;&#x906D;&#x5230;&#x4E86;&#x73A9;&#x5BB6;&#x7684;&#x62B5;&#x5236;&#x3002;&#x867D;&#x7136;&#x539F;&#x6765;&#x7684;&#x9875;&#x9762;&#x6BD4;&#x8F83;&#x8001;&#x65E7;&#x4E5F;&#x64CD;&#x4F5C;&#x4E0D;&#x4FBF;&#xFF0C;&#x4F46;&#x8001;&#x7528;&#x6237;&#x5DF2;&#x7ECF;&#x4E60;&#x60EF;&#xFF0C;&#x4E00;&#x4E0B;&#x5B50;&#x6362;&#x5230;&#x9AD8;&#x7EA7;&#x7684;&#x64CD;&#x4F5C;&#x5F62;&#x5F0F;&#xFF0C;&#x7528;&#x6237;&#x53CD;&#x800C;&#x300C;&#x4E0D;&#x4F1A;&#x73A9;&#x300D;&#x4E86;&#x3002;&#x8981;&#x5C0A;&#x91CD;&#x7528;&#x6237;&#x7684;&#x64CD;&#x4F5C;&#x4E60;&#x60EF;&#x548C;&#x8003;&#x8651;<strong>&#x8FC1;&#x79FB;&#x6210;&#x672C;</strong>&#x3002;</p>
<p>p165&#x3002;&#x6DD8;&#x5B9D;&#x7684;&#x4EA4;&#x6613;&#x8BC4;&#x4EF7;&#x5FC5;&#x987B;&#x5728;&#x4EA4;&#x6613;&#x6210;&#x529F;&#x540E;&#x624D;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#xFF0C;&#x4F46;&#x8FD9;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x5982;&#x679C;&#x4EA4;&#x6613;&#x4E0D;&#x6210;&#x529F;&#x5C31;&#x65E0;&#x6CD5;&#x8BC4;&#x4EF7;&#x3002;&#x4F46;&#x4EA4;&#x6613;&#x4E0D;&#x6210;&#x529F;&#x6240;&#x9047;&#x5230;&#x7684;&#x95EE;&#x9898;&#x624D;&#x662F;&#x6700;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x8BC4;&#x4EF7;&#x6765;&#x53CD;&#x6620;&#x7684;&#x95EE;&#x9898;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x7B97;&#x662F;&#x4E00;&#x79CD;&#x300C;&#x540E;&#x9A8C;&#x6982;&#x7387;&#x7684;&#x8BA4;&#x77E5;&#x504F;&#x5DEE;&#x300D;&#x5427;&#xFF0C;&#x4E5F;&#x59D1;&#x4E14;&#x7B97;&#x662F;&#x4E00;&#x79CD;&#x53EF;&#x7528;&#x6027;&#x6D4B;&#x8BD5;&#x7684;&#x7F3A;&#x5931;&#x3002;</p>
<p>&#x5C3D;&#x53EF;&#x80FD;&#x8BA9;<strong>&#x771F;&#x5B9E;&#x4F7F;&#x7528;&#x7684;&#x7528;&#x6237;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;</strong>&#x3002;</p>
<h2 id="&#x89C4;&#x5219;&#x53EF;&#x89E3;&#x91CA;">&#x89C4;&#x5219;&#x53EF;&#x89E3;&#x91CA;</h2>
<p>p58&#x3002;&#x7B2C;&#x4E00;&#x7248;&#x300C;&#x963F;&#x57FA;&#x7C73;&#x5FB7;&#x300D;&#x4E0A;&#x7EBF;&#x8FD0;&#x884C;&#x7684;&#x53C2;&#x6570;&#x662F;&#x673A;&#x5668;&#x901A;&#x8FC7;&#x7B97;&#x6CD5;&#x751F;&#x6210;&#x7684;&#xFF0C;&#x4F46;&#x8FD9;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x95EE;&#x9898;&#x2014;&#x2014;&#x6CA1;&#x6CD5;&#x89E3;&#x91CA;&#x3002;&#x5BF9;&#x4E8E;&#x6DD8;&#x5B9D;&#x8FD9;&#x6837;&#x5B50;&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#x800C;&#x8A00;&#xFF0C;&#x54EA;&#x6015;&#x4E00;&#x70B9;&#x70B9;&#x7684;&#x6539;&#x53D8;&#xFF0C;&#x90FD;&#x4F1A;&#x5BFC;&#x81F4;&#x80CC;&#x540E;&#x51E0;&#x5341;&#xFF0C;&#x4E0A;&#x767E;&#x4EBA;&#x7684;&#x751F;&#x8BA1;&#x53D7;&#x5F71;&#x54CD;&#x3002;&#x4E00;&#x6765;&#xFF0C;&#x5927;&#x7684;&#x6539;&#x52A8;&#x8981;&#x505A;&#x7070;&#x5EA6;&#x6D4B;&#x8BD5;&#x3002;&#x4E8C;&#x6765;&#xFF0C;&#x6539;&#x52A8;&#x8981;&#x53EF;&#x89E3;&#x91CA;&#x3002;&#x8FD9;&#x6837;&#x5B50;&#xFF0C;&#x5373;&#x4F7F;&#x51FA;&#x73B0;&#x4E86;&#x89C4;&#x5219;&#x7684;&#x8FED;&#x4EE3;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6709;&#x7406;&#x6709;&#x636E;&#x5730;&#x544A;&#x8BC9;&#x7528;&#x6237;&#x65B0;&#x7684;&#x89C4;&#x5219;&#x662F;&#x5565;&#x6837;&#x5B50;&#xFF0C;&#x5373;&#x4F7F;&#x4E0D;&#x544A;&#x4E4B;&#x89C4;&#x5219;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x544A;&#x8BC9;&#x7528;&#x6237;<strong>&#x54EA;&#x91CC;&#x505A;&#x9519;&#x4E86;&#xFF0C;&#x8BE5;&#x5982;&#x4F55;&#x6539;&#x8FDB;</strong>&#x3002;</p>
<p>p69&#x3002;&#x524D;&#x9762;&#x63D0;&#x5230;&#x7684;&#x300C;&#x963F;&#x57FA;&#x7C73;&#x5FB7;&#x300D;&#x544A;&#x8BC9;&#x53CD;&#x4F5C;&#x5F0A;&#x56E2;&#x961F;&#xFF0C;&#x5356;&#x5BB6;&#x9700;&#x8981;&#x6709;&#x4E2A;&#x548C;&#x6211;&#x4EEC;&#x6C9F;&#x901A;&#x7684;&#x6865;&#x6881;&#xFF0C;&#x5356;&#x5BB6;&#x505A;&#x7684;&#x4E0D;&#x5BF9;&#xFF0C;&#x8981;&#x7F5A;&#xFF0C;&#x66F4;&#x8981;&#x544A;&#x8BC9;&#x5356;&#x5BB6;&#x5982;&#x4F55;&#x53EF;&#x4EE5;&#x505A;&#x7684;&#x66F4;&#x597D;&#x3002;</p>
<p>&#x7C7B;&#x4F3C;&#x5BB6;&#x957F;&#x6559;&#x80B2;&#x5B69;&#x5B50;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x5B69;&#x5B50;&#x72AF;&#x4E86;&#x9519;&#x8BEF;&#xFF0C;&#x53EA;&#x60E9;&#x7F5A;&#x662F;&#x4E0D;&#x591F;&#x7684;&#xFF0C;&#x8FD8;&#x8981;&#x544A;&#x8BC9;&#x5B69;&#x5B50;&#x9519;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x8BE5;&#x5982;&#x4F55;&#x6539;&#x6B63;&#x3002;<strong>&#x4ECE;&#x7F5A;&#x4EBA;&#x5230;&#x6E21;&#x4EBA;&#xFF0C;&#x66F4;&#x50CF;&#x662F;&#x4E00;&#x79CD;&#x5FC3;&#x6001;&#x7684;&#x4FEE;&#x70BC;&#x3002;</strong></p>
<h2 id="&#x5206;&#x5C42;&#x8BBE;&#x8BA1;">&#x5206;&#x5C42;&#x8BBE;&#x8BA1;</h2>
<p>p65&#x3002;&#x5BF9;&#x4E00;&#x4E9B;Top&#x8BCD;&#xFF08;&#x6307;&#x641C;&#x7D22;&#x91CF;&#x6700;&#x5927;&#x7684;&#x90A3;&#x4E9B;&#x5173;&#x952E;&#x8BCD;&#xFF09;&#x7167;&#x987E;&#x5F97;&#x592A;&#x591A;&#xFF0C;&#x7ECF;&#x5E38;&#x5C31;&#x4F1A;&#x4F24;&#x5BB3;&#x957F;&#x5C3E;&#x8BCD;&#x3002;&#x5047;&#x8BBE;&#x5728;&#x624B;&#x673A;&#x5E02;&#x573A;&#xFF0C;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x4E09;&#x661F;&#x3001;&#x82F9;&#x679C;&#x8FD9;&#x6837;&#x7684;&#x54C1;&#x724C;&#x6BD4;&#x8F83;&#x70ED;&#x9500;&#xFF0C;&#x5728;&#x5BFC;&#x822A;&#x4E0A;&#x8981;&#x6392;&#x524D;&#x3002;&#x8FD9;&#x5728;&#x7528;&#x6237;&#x6D4F;&#x89C8;&#x72B6;&#x51B5;&#x4E0B;&#xFF0C;&#x6216;&#x641C;&#x7D22;&#x300C;&#x624B;&#x673A;&#x300D;&#x3001;&#x300C;&#x667A;&#x80FD;&#x624B;&#x673A;&#x300D;&#x8FD9;&#x6837;&#x7684;&#x573A;&#x666F;&#x6BD4;&#x8F83;&#x6709;&#x6548;&#x3002;&#x4F46;&#x641C;&#x7D22;&#x7684;&#x7279;&#x70B9;&#x5C31;&#x662F;&#x9700;&#x6C42;&#x5206;&#x6563;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x6237;&#x641C;&#x7684;&#x662F;&#x300C;&#x534E;&#x4E3A;&#x70ED;&#x9500;&#x667A;&#x80FD;&#x624B;&#x673A;&#x300D;&#x5462;&#xFF1F;&#x6240;&#x4EE5;&#x8BF4;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x9002;&#x7528;&#x573A;&#x666F;&#x4E0B;&#xFF0C;&#x5782;&#x76F4;&#x5E02;&#x573A;&#x53EF;&#x4EE5;&#x5728;&#x7279;&#x5B9A;&#x60C5;&#x51B5;&#x4E0B;&#x4E3A;&#x4E86;Top&#x8BCD;&#x800C;&#x727A;&#x7272;&#x957F;&#x5C3E;&#x8BCD;&#xFF0C;&#x4F46;&#x4E3B;&#x641C;&#x7D22;&#x4E00;&#x5B9A;&#x8981;&#x517C;&#x987E;&#x4E24;&#x8005;&#xFF0C;&#x8003;&#x8651;&#x5168;&#x5C40;&#x3002;</p>
<p>p39&#x3002;&#x7269;&#x54C1;&#x7C7B;&#x76EE;&#x6574;&#x7406;&#x65B9;&#x6CD5;&#x533A;&#x5206;&#x524D;&#x540E;&#x53F0;&#x3002;&#x5356;&#x5BB6;&#x901A;&#x8FC7;&#x540E;&#x53F0;&#x7C7B;&#x76EE;&#x53D1;&#x5E03;&#x5546;&#x54C1;&#xFF0C;&#x5356;&#x5BB6;&#x901A;&#x8FC7;&#x524D;&#x53F0;&#x7C7B;&#x76EE;&#x9009;&#x62E9;&#x5546;&#x54C1;&#x3002;&#x540E;&#x53F0;&#x5546;&#x5BB6;&#x7684;&#x5206;&#x7C7B;&#x7C7B;&#x522B;&#x66F4;&#x52A0;&#x9F50;&#x5168;&#xFF0C;&#x4E5F;&#x66F4;&#x52A0;&#x7A33;&#x5B9A;&#xFF0C;&#x4F46;&#x8FD9;&#x5BF9;&#x7528;&#x6237;&#x800C;&#x8A00;&#x975E;&#x5E38;&#x4E0D;&#x53CB;&#x597D;&#xFF0C;&#x8BD5;&#x60F3;&#x6CA1;&#x6709;&#x90A3;&#x4E2A;&#x7528;&#x6237;&#x9700;&#x8981;&#x5728;&#x7406;&#x6E05;&#x5546;&#x54C1;&#x7684;&#x7C7B;&#x522B;&#x540E;&#x518D;&#x8D2D;&#x7269;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x524D;&#x53F0;&#x5C55;&#x793A;&#x7684;&#x7C7B;&#x76EE;&#x4E5F;&#x4F1A;&#x968F;&#x7740;&#x5B63;&#x8282;&#xFF0C;&#x5F53;&#x524D;&#x70ED;&#x9500;&#x7B49;&#x73AF;&#x5883;&#x53D8;&#x5316;&#xFF0C;&#x6240;&#x4EE5;&#x524D;&#x53F0;&#x9700;&#x8981;&#x66F4;&#x7075;&#x6D3B;&#xFF0C;&#x800C;&#x540E;&#x53F0;&#x9700;&#x8981;&#x66F4;&#x7A33;&#x5B9A;&#x3002;&#x5206;&#x5F00;&#x8003;&#x8651;&#xFF0C;&#x4F7F;&#x7528;&#x4E2D;&#x95F4;&#x5C42;&#x8FDB;&#x884C;&#x8FDE;&#x63A5;&#x662F;&#x66F4;&#x597D;&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x6848;&#x3002;&#x6709;&#x70B9;&#x7C7B;&#x4F3C;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x7684;MVC&#x67B6;&#x6784;&#x3002;</p>
<p>&#x5957;&#x7528;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x7684;&#x4E00;&#x4E2A;&#x7406;&#x5FF5;&#xFF1A;<strong>&#x4EFB;&#x4F55;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x52A0;&#x5165;&#x4E00;&#x4E2A;&#x4E2D;&#x95F4;&#x5C42;&#x6765;&#x89E3;&#x8026;</strong>&#x3002;</p>
<h2 id="&#x6570;&#x636E;&#x7684;&#x4EF7;&#x503C;">&#x6570;&#x636E;&#x7684;&#x4EF7;&#x503C;</h2>
<p>p75&#x3002;&#x5229;&#x7528;&#x5927;&#x6570;&#x636E;&#x8BAD;&#x7EC3;&#x7684;&#x641C;&#x7D22;&#x7B97;&#x6CD5;&#x65E2;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x7B97;&#x6CD5;&#x7684;&#x7CBE;&#x7EC6;&#x5EA6;&#x548C;&#x4E2A;&#x6027;&#x5EA6;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x5927;&#x91CF;&#x4E2D;&#x5C0F;&#x5356;&#x5BB6;&#x5546;&#x54C1;&#x7684;&#x83B7;&#x5C55;&#x51E0;&#x7387;&#x2014;&#x2014;&#x6CA1;&#x6709;&#x9500;&#x91CF;&#x7684;&#x4F18;&#x8D28;&#x5546;&#x54C1;&#x4E5F;&#x4F1A;&#x83B7;&#x5F97;&#x66F4;&#x591A;&#x7684;&#x5C55;&#x793A;&#x673A;&#x4F1A;&#x3002;</p>
<p>p143&#x3002;&#x4E00;&#x76F4;&#x4E00;&#x6765;&#x6DD8;&#x5B9D;&#x90FD;&#x6CA1;&#x6709;&#x653E;&#x5F00;&#x300C;&#x62D2;&#x5356;&#x300D;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x62C5;&#x5FC3;&#x5356;&#x5BB6;&#x56E0;&#x6B64;&#x4F1A;&#x62D2;&#x7EDD;&#x7ED9;&#x76F8;&#x5BF9;&#x96BE;&#x641E;&#x5B9A;&#x6216;&#x8005;&#x5C0F;&#x767D;&#x5BA2;&#x6237;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF0C;&#x8FDB;&#x800C;&#x5F71;&#x54CD;&#x4E86;&#x4E70;&#x5BB6;&#x7684;&#x4F53;&#x9A8C;&#x3002;&#x4E0D;&#x8FC7;&#x901A;&#x8FC7;&#x6570;&#x636E;&#x53D1;&#x73B0;&#xFF0C;&#x5356;&#x5BB6;&#x6839;&#x672C;&#x4E0D;&#x662F;&#x8FD9;&#x4E48;&#x60F3;&#x3002;&#x5356;&#x5BB6;&#x672C;&#x8EAB;&#x4E5F;&#x5728;&#x5229;&#x7528;&#x7528;&#x6237;&#x7684;&#x6570;&#x636E;&#x5BF9;&#x300C;&#x6076;&#x610F;&#x7684;&#x4E70;&#x5BB6;&#x300D;&#x8FDB;&#x884C;&#x8BC6;&#x522B;&#x548C;&#x533A;&#x5206;&#x3002;&#x5176;&#x5B9E;&#x4E5F;&#x597D;&#x7406;&#x89E3;&#xFF0C;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x5BF9;&#x5356;&#x5BB6;&#x6076;&#x610F;&#x670D;&#x52A1;&#x5236;&#x8861;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x5356;&#x5BB6;&#x5F53;&#x7136;&#x4E5F;&#x60F3;&#x597D;&#x597D;&#x6301;&#x7EED;&#x7ECF;&#x8425;&#xFF0C;&#x597D;&#x597D;&#x670D;&#x52A1;&#x5BA2;&#x6237;&#x3002;&#x6240;&#x4EE5;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x8BF4;&#xFF0C;&#x968F;&#x7740;&#x5E73;&#x53F0;&#x7684;&#x5065;&#x5168;&#x548C;&#x58EE;&#x5927;&#xFF0C;&#x5E73;&#x53F0;&#x5E94;&#x8BE5;&#x9010;&#x6B65;&#x5730;&#x653E;&#x5F00;&#xFF0C;&#x7ED9;&#x4E88;&#x53C2;&#x4E0E;&#x8005;&#x66F4;&#x591A;&#x7684;&#x4FE1;&#x4EFB;&#x3002;</p>
<p>&#x6211;&#x4E2A;&#x4EBA;&#x7406;&#x89E3;&#xFF0C;&#x7535;&#x5B50;&#x5546;&#x52A1;&#x76F8;&#x6BD4;&#x4F20;&#x7EDF;&#x5546;&#x52A1;&#x7684;&#x6700;&#x5927;&#x4F18;&#x52BF;&#x5C31;&#x662F;&#x6570;&#x636E;&#x3002;&#x4F20;&#x7EDF;&#x7684;&#x7EBF;&#x4E0B;&#x4E70;&#x5356;&#xFF0C;&#x5E76;&#x4E0D;&#x80FD;&#x77E5;&#x9053;&#x4E4B;&#x524D;&#x7ECF;&#x8425;&#x8005;&#x7684;&#x8BDA;&#x4FE1;&#x60C5;&#x51B5;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x4E0D;&#x4F1A;&#x77E5;&#x9053;&#x8D2D;&#x4E70;&#x8005;&#x7684;&#x8BDA;&#x4FE1;&#x60C5;&#x51B5;&#x3002;&#x4F46;&#x7535;&#x5B50;&#x5546;&#x52A1;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4EA4;&#x6613;&#xFF0C;&#x6D3B;&#x52A8;&#x90FD;&#x6709;&#x6570;&#x636E;&#x5B58;&#x6863;&#xFF0C;&#x90FD;&#x6709;&#x8FF9;&#x53EF;&#x5FAA;&#x3002;&#x770B;&#x6765;&#x771F;&#x662F;&#x8FDB;&#x5165;&#x4E86;<strong>&#x6570;&#x636E;&#x4E3A;&#x738B;&#x7684;DT&#x65F6;&#x4EE3;&#x3002;</strong></p>
<h2 id="&#x96C6;&#x6743;&#x4E0E;&#x653E;&#x6743;">&#x96C6;&#x6743;&#x4E0E;&#x653E;&#x6743;</h2>
<p>p123&#x3002;&#x6DD8;&#x5B9D;&#x6700;&#x65E9;&#x7684;&#x8425;&#x9500;&#x5DE5;&#x5177;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x96C6;&#x6743;&#x56FA;&#x5316;&#x6A21;&#x5F0F;&#xFF0C;&#x4F46;&#x968F;&#x7740;&#x4E1A;&#x52A1;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x8BE5;&#x6A21;&#x5F0F;&#x5B8C;&#x5168;&#x8DDF;&#x4E0D;&#x4E0A;&#x7528;&#x6237;&#x7684;&#x9700;&#x6C42;&#x53D1;&#x5C55;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x91C7;&#x7528;&#x4E86;&#x5E73;&#x53F0;&#x5316;&#x7684;&#x601D;&#x8DEF;&#x89E3;&#x51B3;&#x4E86;&#x8BE5;&#x95EE;&#x9898;&#xFF1A;&#x653E;&#x5F03;&#x63A7;&#x5236;&#x3002;&#x4F17;&#x5305;&#xFF0C;&#x5927;&#x5BB6;&#x4E00;&#x8D77;&#x5EFA;&#x8BBE;&#x3002;&#x8425;&#x9500;&#x5E73;&#x53F0;&#x5E72;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#x63D0;&#x4F9B;&#x57FA;&#x672C;&#x7684;&#x89C4;&#x5219;&#x548C;&#x7EC4;&#x4EF6;&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x4EA4;&#x7ED9;&#x5356;&#x5BB6;&#x81EA;&#x7531;&#x5B9A;&#x5236;&#x3002;&#x8FD9;&#x6709;&#x70B9;&#x50CF;UGC&#x7684;&#x73A9;&#x6CD5;&#xFF0C;&#x5E73;&#x53F0;&#x63D0;&#x4F9B;&#x89C4;&#x5219;&#xFF0C;&#x8BA9;&#x7528;&#x6237;&#x81EA;&#x5DF1;&#x521B;&#x9020;&#x3002;</p>
<p>p131&#x3002;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x6700;&#x6709;&#x4EE3;&#x8868;&#x6027;&#xFF0C;&#x4F5C;&#x8005;&#x5728;&#x5176;&#x300A;&#x4EBA;&#x4EBA;&#x90FD;&#x662F;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;2.0&#x300B;&#x4E66;&#x4E2D;&#x4E5F;&#x63D0;&#x5230;&#x8FC7;&#x8BE5;&#x4F8B;&#x5B50;&#x3002;&#x4F55;&#x65F6;&#x51CF;&#x5E93;&#x5B58;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x770B;&#x4F3C;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x5176;&#x5B9E;&#x975E;&#x5E38;&#x590D;&#x6742;&#x3002;&#x770B;&#x4F3C;&#x662F;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#x95EE;&#x9898;&#xFF0C;&#x5176;&#x80CC;&#x540E;&#x662F;&#x4EB2;&#x4E70;&#x5BB6;&#x8FD8;&#x662F;&#x4EB2;&#x5356;&#x5BB6;&#x8FD9;&#x6837;&#x4E25;&#x8083;&#x7684;&#x653F;&#x6CBB;&#x9009;&#x62E9;&#x95EE;&#x9898;&#x3002;&#x6700;&#x540E;&#x7684;&#x51B3;&#x7B56;&#x662F;&#x653E;&#x6743;&#xFF0C;&#x5C06;&#x9009;&#x62E9;&#x6743;&#x4EA4;&#x7ED9;&#x5356;&#x5BB6;&#x3002;&#x6BD4;&#x5982;&#x5C31;B&#xFF08;&#x5929;&#x732B;&#x5546;&#x5BB6;&#xFF09;&#x548C;C&#xFF08;&#x6DD8;&#x5B9D;&#x5546;&#x5BB6;&#xFF09;&#x6765;&#x8BA8;&#x8BBA;&#x3002;B&#x7684;&#x5546;&#x5BB6;&#x66F4;&#x6210;&#x719F;&#xFF0C;&#x66F4;&#x9002;&#x5408;&#x4ED8;&#x6B3E;&#x540E;&#x51CF;&#x3002;&#x800C;C&#x5546;&#x5BB6;&#x66F4;&#x9700;&#x8981;&#x6D41;&#x91CF;&#x3001;&#x4EBA;&#x6C14;&#xFF0C;&#x5C31;&#x4F1A;&#x9009;&#x62E9;&#x62CD;&#x4E0B;&#x51CF;&#x5E93;&#x5B58;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x770B;&#x4F3C;&#x65E0;&#x6CD5;&#x5E73;&#x8861;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x901A;&#x8FC7;&#x300C;&#x653E;&#x624B;&#x300D;&#x8FBE;&#x5230;&#x4E86;&#x52A8;&#x6001;&#x7684;&#x5E73;&#x8861;&#x3002;</p>
<p>&#x6709;&#x65F6;&#x5019;&#xFF0C;<strong>&#x653E;&#x6743;&#x770B;&#x4F3C;&#x662F;&#x4E00;&#x79CD;&#x300C;&#x65E0;&#x4E3A;&#x800C;&#x6CBB;&#x300D;&#xFF0C;&#x4F46;&#x5374;&#x662F;&#x6700;&#x5408;&#x7406;&#x7684;&#x6CBB;&#x7406;&#x65B9;&#x5F0F;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x667A;&#x6167;&#x3002;</strong></p>
<h2 id="&#x5206;&#x6790;&#x672C;&#x8D28;">&#x5206;&#x6790;&#x672C;&#x8D28;</h2>
<p>p135&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x5E94;&#x8BE5;&#x662F;&#x6700;&#x6709;&#x610F;&#x601D;&#x7684;&#x3002;&#x4E3A;&#x4E86;&#x9884;&#x9632;&#x76D7;&#x53F7;&#x8005;&#x8FDB;&#x5165;&#x5356;&#x5BB6;&#x8D26;&#x53F7;&#x76D7;&#x53D6;&#x865A;&#x62DF;&#x5361;&#x5361;&#x5BC6;&#xFF0C;&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x8F9B;&#x82E6;&#x4E86;&#x4E09;&#x4E2A;&#x6708;&#x5F00;&#x53D1;&#x4E86;&#x5404;&#x79CD;&#x5B89;&#x5168;&#x673A;&#x5236;&#x6765;&#x9632;&#x6B62;&#x76D7;&#x53F7;&#x8005;&#x770B;&#x5230;&#x5361;&#x5BC6;&#x3002;&#x7ED3;&#x679C;&#xFF0C;&#x9AD8;&#x6F6E;&#x6765;&#x4E86;&#xFF0C;&#x4E0A;&#x7EBF;&#x4E00;&#x4E2A;&#x665A;&#x4E0A;&#x5C31;&#x88AB;&#x7834;&#x89E3;&#x4E86;&#x3002;&#x76D7;&#x53F7;&#x8005;&#x53D1;&#x73B0;&#x770B;&#x4E0D;&#x5230;&#x5361;&#x5BC6;&#x4E86;&#xFF0C;&#x5C31;&#x5C06;&#x865A;&#x62DF;&#x5361;&#x7684;&#x4EF7;&#x683C;&#x6539;&#x6210;1&#x5206;&#x94B1;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x7528;&#x5C0F;&#x53F7;&#x5168;&#x90E8;&#x4E70;&#x8D70;&#x3002;&#x3002;&#x3002;</p>
<p>&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x91CC;&#x72AF;&#x4E86;<strong>&#x6CA1;&#x6709;&#x5206;&#x6790;&#x672C;&#x8D28;&#x95EE;&#x9898;&#x7684;&#x9519;&#x8BEF;</strong>&#x3002;&#x672C;&#x8D28;&#x7684;&#x95EE;&#x9898;&#x5E94;&#x8BE5;&#x662F;&#x76D7;&#x53F7;&#x540E;&#x7684;&#x6743;&#x9650;&#x7BA1;&#x7406;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x770B;&#x5230;&#x5361;&#x5BC6;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="&#x58A8;&#x83F2;&#x5B9A;&#x5F8B;">&#x58A8;&#x83F2;&#x5B9A;&#x5F8B;</h2>
<p>&#x57FA;&#x672C;&#x4E0A;&#x6240;&#x6709;&#x6848;&#x4F8B;&#x90FD;&#x53EF;&#x4EE5;&#x626F;&#x5230;&#x58A8;&#x83F2;&#x5B9A;&#x5F8B;&#x3002;&#x51E1;&#x662F;&#x6709;&#x79EF;&#x5206;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5C31;&#x6709;&#x4EBA;&#x5237;&#x79EF;&#x5206;&#x3002;&#x51E1;&#x4E8B;&#x6709;&#x5229;&#x76CA;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5C31;&#x6709;&#x4EBA;&#x94BB;&#x6F0F;&#x6D1E;&#x3002;&#x51E1;&#x4E8B;&#x6709;&#x804A;&#x5929;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5C31;&#x6709;&#x4EBA;&#x5237;&#x975E;&#x6CD5;&#x8A00;&#x8BBA;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x6700;&#x597D;&#x5728;<strong>&#x6700;&#x5F00;&#x59CB;&#x8BBE;&#x8BA1;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x7559;&#x4E00;&#x4E2A;&#x5FC3;&#x773C;</strong>&#x3002;</p>
<h2 id="wrap">wrap</h2>
<p>&#x6700;&#x540E;&#xFF0C;&#x76F4;&#x63A5;&#x6458;&#x6284;&#x4E00;&#x4E0B;&#x4E66;&#x4E2D;&#x7684;&#x4E00;&#x6BB5;&#x8BDD;&#xFF1A;</p>
<blockquote>
<p>p186&#x3002;&#x6210;&#x529F;&#x4E86;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x626F;&#x6DE1;&#x90FD;&#x662F;&#x6218;&#x7565;&#xFF1B;&#x5931;&#x8D25;&#x4E86;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x6218;&#x7565;&#x90FD;&#x662F;&#x626F;&#x6DE1;&#xFF01;&#x4E0D;&#x65E0;&#x9053;&#x7406;&#x3002;&#x800C;&#x6211;&#x7684;&#x4F53;&#x4F1A;&#x662F;&#xFF0C;&#x505A;&#x4EA7;&#x54C1;&#xFF0C;&#x8FD8;&#x662F;&#x5F97;&#x987A;&#x7740;&#x7528;&#x6237;&#x9700;&#x6C42;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x987A;&#x7740;&#x884C;&#x4E1A;&#x70ED;&#x70B9;&#x3002;</p>
</blockquote>

      
    </div>

    
      

  <div class="popular-posts-header">相关文章</div>
  <ul class="popular-posts">
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2018/04/19/note/making-net-pm-note/" rel="bookmark">《结网 @改变世界的互联网产品经理》 - 读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/02/01/the-art-of-unix-programming-reading-notes/" rel="bookmark">《The Art of UNIX Programming》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/06/28/book-thinking-about-running-md/" rel="bookmark">《当我跑步时我谈些什么》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/03/24/book-liaoge-linux-course-md/" rel="bookmark">《鸟哥的Linux私房菜》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/02/02/code-complete-2-learn-note/" rel="bookmark">《Code Complete 2》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2016/04/01/how-to-life-learn-note/" rel="bookmark">《活法》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/02/19/how-to-measure-your-life-reading-notes/" rel="bookmark">《如何衡量你的人生》读书笔记</a></div>
      
    </li>
  
    <li class="popular-posts-item">
      
      
      <div class="popular-posts-title"><a href="/2017/11/30/money-hacker-reading-note/" rel="bookmark">《富爸爸穷爸爸》&《小狗钱钱》读书笔记</a></div>
      
    </li>
  
  </ul>


    

    
    
    

    

    

    
      <div>
        <ul class="post-copyright">
  <li class="post-copyright-author">
    <strong>本文作者： </strong>whiledoing</li>
  <li class="post-copyright-link">
    <strong>本文链接：</strong>
    <a href="http://whiledoing.me/2018/05/04/note/taobao-product-stories-note/" title="《淘宝产品十年事》与「优雅」的解决之道">http://whiledoing.me/2018/05/04/note/taobao-product-stories-note/</a>
  </li>
  <li class="post-copyright-license">
    <strong>版权声明： </strong>本博客所有文章除特别声明外，均采用 <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/" rel="external nofollow" target="_blank">CC BY-NC-SA 4.0</a> 许可协议。转载请注明出处！</li>
</ul>

      </div>
    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/读书笔记/" rel="tag"># 读书笔记</a>
          
            <a href="/tags/产品/" rel="tag"># 产品</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2018/05/01/ml/coursera-dl-course-5-sequence-model/" rel="next" title="Coursera - Andrew Ng - Deep Learning - 5 - Sequence Models - 学习记录">
                <i class="fa fa-chevron-left"></i> Coursera - Andrew Ng - Deep Learning - 5 - Sequence Models - 学习记录
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2018/06/13/prog/python-coroutine/" rel="prev" title="python coroutine and asyncio">
                python coroutine and asyncio <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>


  </div>


          </div>
          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap">
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview-wrap">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview-wrap sidebar-panel">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <img class="site-author-image" itemprop="image"
                src="/images/avatar.jpeg"
                alt="whiledoing" />
            
              <p class="site-author-name" itemprop="name">whiledoing</p>
              <p class="site-description motion-element" itemprop="description">喜欢一切简单且美的事物，包括人。</p>
          </div>

          
            <nav class="site-state motion-element">
              
                <div class="site-state-item site-state-posts">
                
                  <a href="/archives/">
                
                    <span class="site-state-item-count">62</span>
                    <span class="site-state-item-name">日志</span>
                  </a>
                </div>
              

              

              
                
                
                <div class="site-state-item site-state-tags">
                  <a href="/tags/index.html">
                    
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                      
                    
                    <span class="site-state-item-count">33</span>
                    <span class="site-state-item-name">标签</span>
                  </a>
                </div>
              
            </nav>
          

          

          
            <div class="links-of-author motion-element">
              
                <span class="links-of-author-item">
                  <a href="https://github.com/whiledoing" target="_blank" title="GitHub">GitHub</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="http://www.douban.com/people/58249409" target="_blank" title="豆瓣">豆瓣</a>
                  
                </span>
              
                <span class="links-of-author-item">
                  <a href="https://www.zhihu.com/people/whiledoing" target="_blank" title="知乎">知乎</a>
                  
                </span>
              
            </div>
          

          
          

          
          

          
            
          
          

        </div>
      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#调动积极性"><span class="nav-number">1.</span> <span class="nav-text">调动积极性</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#灰度测试与可用性测试"><span class="nav-number">2.</span> <span class="nav-text">灰度测试与可用性测试</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#规则可解释"><span class="nav-number">3.</span> <span class="nav-text">规则可解释</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#分层设计"><span class="nav-number">4.</span> <span class="nav-text">分层设计</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#数据的价值"><span class="nav-number">5.</span> <span class="nav-text">数据的价值</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#集权与放权"><span class="nav-number">6.</span> <span class="nav-text">集权与放权</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#分析本质"><span class="nav-number">7.</span> <span class="nav-text">分析本质</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#墨菲定律"><span class="nav-number">8.</span> <span class="nav-text">墨菲定律</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#wrap"><span class="nav-number">9.</span> <span class="nav-text">wrap</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; 2016 – <span itemprop="copyrightYear">2018</span>
  <span class="with-love" id="animate">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">whiledoing</span>

  

  
</div>




  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动 v3.7.1</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 – <a class="theme-link" target="_blank" href="https://theme-next.org">NexT.Mist</a> v6.4.2</div>




        








        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

    
	
    

    
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>
























  



  
  
    <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/reading_progress/reading_progress.js"></script>
  


  


  <script type="text/javascript" src="/js/src/utils.js?v=6.4.2"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=6.4.2"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=6.4.2"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=6.4.2"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=6.4.2"></script>



  



  










  





  

  

  
<script>
(function(){
    var bp = document.createElement('script');
    var curProtocol = window.location.protocol.split(':')[0];
    if (curProtocol === 'https') {
        bp.src = 'https://zz.bdstatic.com/linksubmit/push.js';        
    }
    else {
        bp.src = 'http://push.zhanzhang.baidu.com/push.js';
    }
    var s = document.getElementsByTagName("script")[0];
    s.parentNode.insertBefore(bp, s);
})();
</script>


  
  

  
  

  


  
  

  
  
  
  <script src="/lib/pangu/dist/pangu.min.js?v=3.3"></script>
  <script type="text/javascript">pangu.spacingPage();</script>


  
  <script type="text/javascript" src="/js/src/js.cookie.js?v=6.4.2"></script>
  <script type="text/javascript" src="/js/src/scroll-cookie.js?v=6.4.2"></script>


  

  

  
  <style>
    .copy-btn {
      display: inline-block;
      padding: 6px 12px;
      font-size: 13px;
      font-weight: 700;
      line-height: 20px;
      color: #333;
      white-space: nowrap;
      vertical-align: middle;
      cursor: pointer;
      background-color: #eee;
      background-image: linear-gradient(#fcfcfc, #eee);
      border: 1px solid #d5d5d5;
      border-radius: 3px;
      user-select: none;
      outline: 0;
    }

    .highlight-wrap .copy-btn {
      transition: opacity .3s ease-in-out;
      opacity: 0;
      padding: 2px 6px;
      position: absolute;
      right: 4px;
      top: 8px;
    }

    .highlight-wrap:hover .copy-btn,
    .highlight-wrap .copy-btn:focus {
      opacity: 1
    }

    .highlight-wrap {
      position: relative;
    }
  </style>
  <script>
    $('.highlight').each(function (i, e) {
      var $wrap = $('<div>').addClass('highlight-wrap')
      $(e).after($wrap)
      $wrap.append($('<button>').addClass('copy-btn').append('复制').on('click', function (e) {
        var code = $(this).parent().find('.code').find('.line').map(function (i, e) {
          return $(e).text()
        }).toArray().join('\n')
        var ta = document.createElement('textarea')
        document.body.appendChild(ta)
        ta.style.position = 'absolute'
        ta.style.top = '0px'
        ta.style.left = '0px'
        ta.value = code
        ta.select()
        ta.focus()
        var result = document.execCommand('copy')
        document.body.removeChild(ta)
        
        $(this).blur()
      })).on('mouseleave', function (e) {
        var $b = $(this).find('.copy-btn')
        setTimeout(function () {
          $b.text('复制')
        }, 300)
      }).append(e)
    })
  </script>


</body>
</html>
